{"speaker":{"id":10,"title":"","firstname":"Dean","middleinitial":"","lastname":"Kamen","description":"Inventor","whotheyare":"Dean Kamen landed in the limelight with the Segway, but he has been innovating since high school, with more than 150 patents under his belt. Recent projects include portable energy and water purification for the developing world, and a prosthetic arm for maimed soldiers.","whylisten":"<p>Dean Kamen is an innovator, but not just of things. <strong>He hopes to revolutionize attitudes, quality of life, awareness.<\/strong> While an undergraduate, he developed the first portable infusion device, which delivers drug treatments that once required round-the-clock hospital care. And, through his <a href=\"http:\/\/www.dekaresearch.com\" target=\"_blank\">DEKA Research and Development<\/a>, which he cofounded in 1982, he developed a portable dialysis machine, a vascular stent, and the <a href=\"http:\/\/www.ibotnow.com\/\" target=\"_blank\">iBOT<\/a>  -- a motorized wheelchair that climbs stairs (Stephen Colbert took one for a spin). <\/p><p>Yes, he&#39;s a college dropout, but he&#39;s a huge believer in education, and in 1989 established the nonprofit <a href=\"http:\/\/www.usfirst.org\/\" target=\"_blank\">FIRST (For Inspiration and Recognition of Science and Technology)<\/a>  to inspire teenagers to pursue careers in science. FIRST sponsors lively annual competitions, where students form teams to create the best robot. <\/p><p>His focus now is on off-grid electricity and water purification for developing countries; <strong>another recent project, previewed at TED2007, is a <a href=\"http:\/\/bits.blogs.nytimes.com\/2007\/08\/08\/dean-kamen-lends-a-hand-or-two\/\" target=\"_blank\">prosthetic arm<\/a>  for maimed soldiers (read an update <a href=\"http:\/\/spectrum.ieee.org\/feb08\/5957\" target=\"_blank\">here<\/a>).<\/strong> He&#39;s also working on a power source for the wonderful <a href=\"http:\/\/money.cnn.com\/magazines\/business2\/business2_archive\/2007\/08\/01\/100138830\/index.htm?eref=rss_topstories\" target=\"_blank\">Think car<\/a>. And, with more funding in the works, we haven&#39;t seen the last of the <a href=\"http:\/\/www.segway.com\/\" target=\"_blank\">Segway<\/a>.<\/p>","slug":"dean_kamen","published_at":"2007-02-13 11:03:00","updated_at":"2009-04-13 10:28:25"}}