{"speaker":{"id":100,"title":"","firstname":"William","middleinitial":"","lastname":"McDonough","description":"Architect","whotheyare":"Architect William McDonough believes green design can prevent environmental disaster and drive economic growth. He champions “cradle to cradle” design, which considers a product's full life cycle -- from creation with sustainable materials to a recycled afterlife. ","whylisten":"<p>Architect <a href=\"http:\/\/www.mbdc.com\/about-mbdc\/williammcdonough\/\" target=\"_blank\">William McDonough<\/a>  practices green architecture on a massive scale. In a 20-year project, he is redesigning Ford&#39;s city-sized <a href=\"http:\/\/www.mcdonoughpartners.com\/projects\/ford-dtp\/default.asp?projID=ford-dtp\" target=\"_blank\">River Rouge truck plant<\/a> and turning it into the Rust Belt&#39;s eco-poster child, with the world&#39;s largest &quot;living roof&quot; for reclaiming storm runoff. He has created buildings that produce more energy and clean water than they use. He is building the future of design on the site of the future of exploration: the NASA Sustainability Base. Oh, and he&#39;s designing seven entirely new and entirely <a href=\"http:\/\/www.chinauscenter.org\/purpose\/default.asp\" target=\"_blank\">green cities<\/a>  in China. <br \/><br \/>Bottom-line economic benefits are another specialty of McDonough&#39;s practice. A tireless proponent of the idea that absolute sustainability and economic success can go hand-in-hand, he&#39;s designed buildings for the Gap, Nike, Frito-Lay and Ford that have lowered corporate utility bills by capturing daylight for lighting, using natural ventilation instead of AC, and heating with solar or geothermal energy. They&#39;re also simply nicer places to work, surrounded by natural landscaping that gives back to the biosphere,              showcasing their innovative culture. <\/p><p>In 2002, McDonough co-wrote <em><a href=\"http:\/\/geni.us\/cradletocradle\" target=\"_blank\">Cradle to Cradle<\/a><\/em>, which proposes that designers think as much about what happens at the end of a product&#39;s life cycle as they do about its beginning. (The book itself is printed on recyclable plastic.) From this, he is developing the <a href=\"http:\/\/inhabitat.com\/inhabitat-interview-green-architect-cradle-to-cradle-founder-william-mcdonough\/\" target=\"_blank\">Cradle to Cradle community<\/a>, where like-minded designers and businesspeople can grow the idea. In 2012, McDonough began collaborating with Stanford University Libraries on a &ldquo;living archive&rdquo; of his work and communications. He has been awarded three times by the US government, and in 2014, McDonough was appointed as Chair of the Meta-Council on the Circular Economy by the World Economic Forum.<\/p>","slug":"william_mcdonough","published_at":"2007-04-06 17:53:00","updated_at":"2015-07-10 21:46:53"}}