{"speaker":{"id":1004,"title":"","firstname":"Charles","middleinitial":"","lastname":"Hazlewood","description":"Conductor","whotheyare":"Charles Hazlewood dusts off and invigorates classical music, adding a youthful energy and modern twists to centuries-old masterworks. At TEDGlobal, he conducts the Scottish Ensemble.","whylisten":"<p>Charles Hazlewood&#39;s fresh presentations of classical music shake up the traditional settings of the form -- in one performance he&rsquo;ll engage in a conversation with the audience, while in another he&rsquo;ll blend film or sculpture into a piece -- but his goal is always the same: exposing the deep, always-modern joy of the classics. He&#39;s a familiar face on British TV, notably in the 2009 series The Birth of British Music on BBC2. He conducts the BBC Orchestras and guest-conducts orchestras around the world.<br \/><br \/>Together with Mark Dornford-May, he founded a lyric-theatre company in South Africa called Dimpho Di Kopane (which means &quot;combined talents&quot;) after auditioning in the townships and villages of South Africa. Of the 40 members, only three had professional training. They debuted with Bizet&#39;s <em>Carmen<\/em>, which was later transposed into a movie version called <a href=\"http:\/\/www.youtube.com\/watch?v=JGNmxQJd3AI\" target=\"_blank\"><em>U-Carmen eKhayelitsha<\/em><\/a>, spoken and sung in Xhosa, that was honored at the Berlin Flim Festival. He regularly involves children in his projects and curates his own music festival, Play the Field, on his farm in Somerset. His latest project: the <a href=\"http:\/\/www.paraorchestra.co.uk\/\" target=\"_blank\">ParaOrchestra<\/a>.<\/p><p>He says: &quot;I have loads of issues with the way classical music is presented. It has been too reverential, too &#39;high art&#39; -- if you&#39;re not in the club, they&#39;re not going to let you join. It&#39;s like The Turin Shroud: don&#39;t touch it because it might fall apart.&quot; <\/p>","slug":"charles_hazlewood","published_at":"2011-05-20 14:25:00","updated_at":"2011-10-07 15:37:01"}}