{"speaker":{"id":101,"title":"","firstname":"Jeff","middleinitial":"","lastname":"Bezos","description":"Online commerce pioneer","whotheyare":"As founder and CEO of Amazon.com, Jeff Bezos defined online shopping and rewrote the rules of commerce, ushering in a new era in business. <em>Time<\/em> magazine named him Man of the Year in 1999.","whylisten":"<p>Jeff Bezos didn&#39;t invent online shopping, but he almost single-handedly turned it into a multi-billion-dollar enterprise. His <a href=\"http:\/\/www.amazon.com\" target=\"_blank\">Amazon.com<\/a>  began as a bookstore in 1994, and quickly expanded into dozens of product categories, forcing the world&#39;s biggest retailers to rethink their business models, and ultimately <strong>changing the way people shop<\/strong>. <br \/><br \/>But Amazon.com isn&#39;t just an internet success story. It&#39;s the standard by which all web businesses are now judged -- if not by their shareholders, then by their customers. Amazon set a high bar for reliability and customer service, and also <strong>introduced a wide range of online retail conventions -- from user reviews and one-click shopping to the tab interface and shopping cart icon<\/strong> -- so commonplace we no longer think of them as once having been innovations.<br \/><br \/>When the Internet bubble burst, Amazon.com took a hit with the other e-commerce pioneers, but the fundamentally sound company hung tough.<strong> It now sells more than $10 billion a year of goods, profitably<\/strong>, and its technology will influence the changes to business and media that will come next. Amazon recently released Kindle, a wireless digital reading device, giving the term &quot;page turning&quot; a completely new definition. Bezos, meanwhile, is one of the few early Web CEOs who still run the companies they founded. Outside of his work with Amazon, he recently founded <a href=\"http:\/\/public.blueorigin.com\/index.html\" target=\"_blank\">Blue Origin<\/a>,  a space-flight startup.<\/p>","slug":"jeff_bezos","published_at":"2007-04-09 08:35:00","updated_at":"2020-10-12 18:35:44"}}