{"speaker":{"id":1011,"title":"","firstname":"Mike","middleinitial":"","lastname":"Biddle","description":"Plastics recycler","whotheyare":"Discarded plastic, too often, ends up buried or burned, not recycled (it's just too complicated). But Mike Biddle has found a way to close the loop.","whylisten":"<p>Throwing water bottles into the recycling bin doesn&rsquo;t begin to address the massive quantity of postconsumer plastic that ends up in landfills and the ocean. Because it&rsquo;s so difficult to separate the various kinds of plastics &ndash; up to 20 kinds per product &ndash; that make up our computers, cell phones, cars and home appliances, only a small fraction of plastics from complex waste streams are recycled, while the rest is tossed. In 1992, Mike Biddle, a plastics engineer, set out to find a solution. He set up a lab in his garage in Pittsburg, California, and began experimenting with complex-plastics recycling, borrowing ideas from such industries as mining and grain processing. <br \/><br \/>Since then, Biddle has developed a patented 30-step plastics recycling system that includes magnetically extracting metals, shredding the plastics, sorting them by polymer type and producing graded pellets to be reused in industry &ndash;&nbsp;a process that takes less than a tenth of the energy required to make virgin plastic from crude oil. Today, the company he cofounded, <a href=\"http:\/\/mbapolymers.com\/\" target=\"_blank\">MBA Polymers<\/a>, has plants in China and Austria, and plans to build more in Europe, where electronics-waste regulation (which doesn&rsquo;t yet have an equivalent in the US) already ensures a stream of materials to exploit &ndash; a process Biddle calls &ldquo;above-ground mining.&rdquo;<\/p><p>He says: &quot;I consider myself an environmentalist. I hate to see plastics wasted. I hate to see any natural resource &ndash; even human time &ndash; wasted.&rdquo; <\/p>","slug":"michael_biddle","published_at":"2011-05-21 09:57:00","updated_at":"2013-07-22 21:53:51"}}