{"speaker":{"id":1015,"title":"","firstname":"Lee","middleinitial":"","lastname":"Cronin","description":"Chemist","whotheyare":"A professor of chemistry, nanoscience and chemical complexity, Lee Cronin and his research group investigate how chemistry can revolutionize modern technology and even create life.","whylisten":"<p>Lee Cronin&#39;s lab at the University of Glasgow does cutting-edge research into how complex chemical systems, created from non-biological building blocks, can have real-world applications with wide impact. At TEDGlobal 2012, Cronin shared some of the lab&#39;s latest work: creating a 3D printer for molecules. This device -- which has been prototyped -- can download plans for molecules and print them, in the same way that a 3D printer creates objects. In the future, Cronin says this technology could potentially be used to print medicine -- cheaply and wherever it is needed. As Cronin says: &quot;What Apple did for music, I&#39;d like to do for the discovery and distribution of prescription drugs.&quot;<\/p> <p>At TEDGlobal 2011, Cronin shared his lab&#39;s bold plan to create life. At the moment, bacteria is the minimum unit of life -- the smallest chemical unit that can undergo evolution. But in Cronin&#39;s emerging field, he&#39;s thinking about forms of life that won&#39;t be biological. To explore this, and to try to understand how life itself originated from chemicals, Cronin and others are attempting to create truly artificial life from completely non-biological chemistries that mimic the behavior of natural cells. They call these chemical cells, or Chells.&nbsp;<\/p> <p>Cronin&#39;s research interests also encompass self-assembly and self-growing structures -- the better to assemble life at nanoscale. At the University of Glasgow, this work on crystal structures is producing a raft of papers from his research group. He says: &quot;Basically one of my longstanding research goals is to understand how life emerged on planet Earth and re-create the process.&quot;<\/p><p>Read the papers referenced in his TEDGlobal 2102 talk: <\/p><p><a href=\"http:\/\/www.nature.com\/nchem\/journal\/v4\/n5\/full\/nchem.1313.html\" target=\"_blank\">Integrated 3D-printed reactionware for chemical synthesis and analysis<\/a>, <em>Nature Chemistry<\/em><\/p><p><a href=\"http:\/\/pubs.rsc.org\/en\/Content\/ArticleLanding\/2012\/LC\/c2lc40761b\" target=\"_blank\">Configurable 3D-Printed millifluidic and microfluidic &lsquo;lab on a chip&rsquo; reactionware devices<\/a>, <em>Lab on a Chip<\/em><\/p>","slug":"lee_cronin","published_at":"2011-05-21 10:24:00","updated_at":"2014-01-14 20:18:33"}}