{"speaker":{"id":102,"title":"","firstname":"Natalie","middleinitial":"","lastname":"MacMaster","description":"Fiddler","whotheyare":"Natalie MacMaster is a star of Cape Breton fiddling, a Canadian tradition with Scottish roots. Her energetic style and virtuoso talent has brought her star billing on the international folk circuit.","whylisten":"<p>It&#39;s not easy to make traditional Irish-Scottish music sound sexy and yet still seem wholesome. But Natalie MacMaster manages this feat, <strong>drawing listeners in with her playful showmanship<\/strong>, and then holding them rapt with astounding technical flourishes.<br \/><br \/>The niece of renowned Canadian fiddler <a href=\"http:\/\/www.atlanticartists.com\/buddy\/buddybio.html\" target=\"_blank\">Buddy MacMaster<\/a>, she&#39;s taken up the mantle as standard-bearer for Cape Breton fiddling, a method of <strong>Scottish-style violin-playing that&#39;s evolved over the last century<\/strong> on this island neighbor to Nova Scotia. The tradition was on the wane when, in 1972, a CBS documentary provocatively titled <a href=\"http:\/\/www.capebretonfiddlers.com\/history.html\" target=\"_blank\"><em>The Vanishing Cape Breton Fiddler<\/em><\/a> jump-started preservation efforts in the fiddling community.<br \/><br \/>MacMaster&#39;s <strong>enthusiastic charm and extraordinary skill<\/strong> has landed her star billing on the international folk circuit and multiple Grammy nominations. She&#39;s released nine albums, including <a href=\"http:\/\/www.nataliemacmaster.com\/recordings\/yourstruly.htm\" target=\"_blank\"><em>Yours Truly<\/em><\/a>  (2006), <a href=\"http:\/\/www.nataliemacmaster.com\/recordings\/nataliebuddy.htm\" target=\"_blank\"><em>Natalie and Buddy MacMaster<\/em><\/a>  (2005) and <a href=\"http:\/\/www.nataliemacmaster.com\/recordings\/mras.htm\" target=\"_blank\"><em>My Roots Are Showing<\/em><\/a>  (1998). She&#39;s toured with countless performers, including the Chieftains, Faith Hill, Carlos Santana and Alison Krauss, and has been awarded two Juno Awards (Canada&#39;s equivalent to the Grammy).<\/p>","slug":"natalie_macmaster","published_at":"2007-04-09 22:47:00","updated_at":"2015-07-13 18:41:56"}}