{"speaker":{"id":1021,"title":"","firstname":"Pat","middleinitial":"","lastname":"Mitchell","description":"Dangerous woman","whotheyare":"Pat Mitchell is a lifelong advocate for women and girls.","whylisten":"<p>At every step of her career, Pat Mitchell has broken new ground for women, leveraging the power of media as a journalist, an Emmy award-winning and Oscar-nominated producer to tell women&#39;s stories and increase the representation of women onscreen and off. Transitioning to an executive role, she became the president of CNN Productions and the first woman president and CEO of PBS and the Paley Center for Media. Today, her commitment to connect and strengthen a global community of women leaders continues as a conference curator, advisor and mentor.<\/p><p>In partnership with TED, Mitchell launched&nbsp;<a href=\"https:\/\/www.ted.com\/attend\/conferences\/special-events\/tedwomen\" target=\"_blank\">TEDWomen<\/a> in 2010 and is its editorial director, curator and host. She is also a speaker and curator for the annual Women Working for the World forum in Bogota, Colombia, the Her Village conference in Beijing, and co-chairs the US board of&nbsp;<a href=\"https:\/\/www.southbankcentre.co.uk\/whats-on\/festivals-series\/women-of-the-world#overview\" target=\"_blank\">Women of the World (WOW)<\/a>. Along with Ronda Carnegie, she partners with the Rockefeller Foundation to curate, convene and host Connected Women Leaders (CWL) forums, focused on collective problem solving among women leaders in government and civil society.<\/p><p>In 2014, the Women&#39;s Media Center honored Mitchell with its first-annual&nbsp;<a href=\"http:\/\/www.womensmediacenter.com\/about\/press\/press-releases\/womens-media-center-announces-pat-mitchell-to-be-first-recipient-of-lifetim\" target=\"_blank\">Lifetime Achievement Award<\/a>, now named in her honor to commend other women whose media careers advance the representation of women. Recognized by Hollywood Reporter as one of the most powerful women in media, Fast Company&#39;s&nbsp;<a href=\"https:\/\/www.fastcompany.com\/section\/league-of-extraordinary-women-2012\" target=\"_blank\">&quot;League of Extraordinary Women&quot;<\/a> and Huffington Post&#39;s list of&nbsp;<a href=\"https:\/\/www.huffpost.com\/entry\/powerful-women-over-50_n_1674427?slideshow=true#gallery\/5bb652c0e4b052715307b298\/12\" target=\"_blank\">&quot;Powerful Women Over 50,&quot;<\/a> Mitchell also received the Sandra Day O&#39;Connor Award for Leadership. She was a contributor to&nbsp;<a href=\"https:\/\/www.amazon.com\/Enlightened-Power-Transforming-Practice-Leadership\/dp\/1118085876\" target=\"_blank\">Enlightened Power: How Women Are Transforming the Practice of Leadership<\/a>, and wrote the Preface to the book and museum exhibition,&nbsp;<a href=\"http:\/\/www.impactmania.com\/im\/\" target=\"_blank\">130 Women of Impact in 30 Countries.<\/a> In 2016, she received a Congressional appointment to&nbsp;<a href=\"http:\/\/amwh.us\/report\/\" target=\"_blank\">The American Museum of Women&rsquo;s History Advisory Council,<\/a> and in 2019 was named to the Gender Equality Top 100 list of women leaders by Apolitical.<\/p><p>Mitchell is active with many nonprofit organizations, serving as the chair of the boards of the&nbsp;<a href=\"https:\/\/www.sundance.org\/\" target=\"_blank\">Sundance Institute<\/a> and the&nbsp;<a href=\"http:\/\/www.womensmediacenter.com\/\" target=\"_blank\">Women&#39;s Media Center.<\/a>&nbsp;She is a founding member of the&nbsp;<a href=\"https:\/\/www.vday.org\/\" target=\"_blank\">VDAY movement<\/a>, serves on the boards of the&nbsp;<a href=\"http:\/\/skoll.org\/\" target=\"_blank\">Skoll Foundation<\/a>, Participant Media, the&nbsp;<a href=\"https:\/\/acumen.org\/\" target=\"_blank\">Acumen Fund<\/a>&nbsp;and is a member of the&nbsp;<a href=\"https:\/\/www.cfr.org\/\" target=\"_blank\">Council on Foreign Relations<\/a>.<\/p><p>Mitchell is a magna cum laude graduate of the University of Georgia and holds a master&#39;s degree in English literature and several honorary doctorate degrees. She is the author of&nbsp;<a href=\"https:\/\/www.amazon.com\/Becoming-Dangerous-Woman-Embracing-Change\/dp\/1580059295\" target=\"_blank\"><em>Becoming a Dangerous Woman: Embracing Risk to Change the World<\/em><\/a>. She and her husband, Scott Seydel, live in Atlanta and have six children and 13 grandchildren.<\/p>","slug":"pat_mitchell","published_at":"2011-05-21 10:39:00","updated_at":"2020-01-02 15:30:23"}}