{"speaker":{"id":1030,"title":"","firstname":"Yasheng","middleinitial":"","lastname":"Huang","description":"Political economist","whotheyare":"Yasheng Huang asks us to rethink our ideas about China and other large emerging economies. Lately he’s been asking, Does democracy hinder or promote economic growth?","whylisten":"<p>MIT and Fudan University professor Yasheng Huang is an authority on how to get ahead in emerging economies. The China and India Labs he founded at MIT&#39;s Sloan School of Management specialize in helping local startups improve their strategies. His book&nbsp;<a href=\"http:\/\/geni.us\/chinesecapitalism\" target=\"_blank\"><em>Capitalism with Chinese Characteristics<\/em><\/a>&nbsp;(2008) chronicles three decades of economic reform in China and documents the critical role that private entrepreneurship played in the Communist nation&rsquo;s &ldquo;economic miracle.&rdquo; <br \/><br \/>Huang believes that China is moving away from Marxism (public ownership) but not Leninism (ideology of state control) -- and that strong social fundamentals are the key reason for its growth. He is a vocal critic of US foreign policy in China, calling on American leaders to rethink their messages, which often do not resonate with the Chinese public, and to use technology to broaden their reach, overcome stereotypes and quash conspiracy theories. He says: &quot;For too long the US has not paid attention to an important force in the Chinese economy: the rise of indigenous entrepreneurs. This is in sharp contrast to the US approach in India.&quot; <\/p><p>In early 2013 Huang <a href=\"http:\/\/www.foreignaffairs.com\/articles\/138477\/yasheng-huang\/democratize-or-die\" target=\"_blank\">sparred with Eric X. Li<\/a>  in <em>Foreign Affairs<\/em> about the merits of China&#39;s one-party system. Li&#39;s article became the basis for his <a href=\"http:\/\/www.ted.com\/talks\/eric_x_li_a_tale_of_two_political_systems.html\" target=\"_blank\">TEDGlobal 2013 talk<\/a>, which Huang then <a href=\"http:\/\/blog.ted.com\/2013\/07\/01\/why-democracy-still-wins-a-critique-of-eric-x-lis-a-tale-of-two-political-systems\/\" target=\"_blank\">responded to on the TED Blog<\/a>.<\/p>","slug":"yasheng_huang","published_at":"2011-05-21 11:00:00","updated_at":"2015-09-28 16:19:35"}}