{"speaker":{"id":1041,"title":"","firstname":"Paul","middleinitial":"","lastname":"Bloom","description":"Psychologist","whotheyare":"Paul Bloom explores some of the most puzzling aspects of human nature, including pleasure, religion, and morality.","whylisten":"<p>In Paul Bloom&rsquo;s last book,&nbsp;<a href=\"http:\/\/geni.us\/howpleasureworks\" target=\"_blank\"><em>How Pleasure Works<\/em><\/a>, he explores the often-mysterious enjoyment that people get out of experiences such as sex, food, art, and stories. His latest book,&nbsp;<a href=\"http:\/\/geni.us\/justbabies\" target=\"_blank\"><em>Just Babies<\/em><\/a>, examines the nature and origins of good and evil. How do we decide what&#39;s fair and unfair? What is the relationship between emotion and rationality in our judgments of right and wrong? And how much of morality is present at birth? To answer these questions, he and his colleagues at Yale study how babies make moral decisions. (How do you present a moral quandary to a 6-month-old? Through simple, gamelike experiments that yield surprisingly adult-like results.)&nbsp;&nbsp; <\/p><p>Paul Bloom is a passionate teacher of undergraduates, and his popular Introduction to Psychology 110 class has been released to the world through the Open Yale Courses program. He has recently completed a second MOOC, &ldquo;Moralities of Everyday Life&rdquo;, that introduced moral psychology to tens of thousands of students. And he also presents his research to a popular audience though articles in <a href=\"http:\/\/www.theatlantic.com\/paul-bloom\/\" target=\"_blank\"><em>The Atlantic<\/em><\/a>, <a href=\"http:\/\/www.newyorker.com\/arts\/critics\/atlarge\/2013\/05\/20\/130520crat_atlarge_bloom?currentPage=all\" target=\"_blank\"><em>The New Yorker<\/em><\/a>, and <a href=\"http:\/\/www.nytimes.com\/2010\/05\/09\/magazine\/09babies-t.html?pagewanted=all&amp;_r=0\" target=\"_blank\"><em>The New York Times<\/em><\/a>. Many of the projects he works on are student-initiated, and all of them, he notes, are &quot;strongly interdisciplinary, bringing in theory and research from areas such as cognitive, social, and developmental psychology, evolutionary theory, linguistics, theology and philosophy.&quot;&nbsp; <\/p><p>He says: &quot;A growing body of evidence suggests that humans do have a rudimentary moral sense from the very start of life.&quot;<\/p>","slug":"paul_bloom","published_at":"2011-05-23 18:29:00","updated_at":"2015-07-10 21:22:51"}}