{"speaker":{"id":1049,"title":"","firstname":"Mikko","middleinitial":"","lastname":"Hypponen","description":"Cybersecurity expert","whotheyare":"As computer access expands, Mikko Hypponen asks: What's the next killer virus, and will the world be able to cope with it? And also: How can we protect digital privacy in the age of government surveillance?","whylisten":"<p>The chief research officer at F-Secure Corporation in Finland, Mikko Hypponen has led his team through some of the largest computer virus outbreaks in history. His team took down the world-wide network used by the Sobig.F worm. He was the first to warn the world about the Sasser outbreak, and he has done classified briefings on the operation of the&nbsp;Stuxnet worm -- a hugely complex worm designed to sabotage Iranian nuclear enrichment facilities.<br \/><br \/>As a few hundred million more Internet users join the web from India and China and elsewhere, and as governments and corporations become more sophisticated at using viruses as weapons, Hypponen asks, what&#39;s next? Who will be at the front defending the world&rsquo;s networks from malicious software? He says: &quot;It&#39;s more than unsettling to realize there are large companies out there developing backdoors, exploits and trojans.&quot;<\/p><p>Even more unsettling: revelations this year that the United States&#39; NSA is conducting widespread digital surveillance of both US citizens and anyone whose data passes through a US entity, and that it has actively sabotaged encryption algorithms. Hypponen has become one of the most outspoken critics of the agency&#39;s programs and asks us all: Why are we so willing to hand over digital privacy?<\/p><div>&nbsp;<\/div><p>&nbsp;<\/p><p>Read his open-season Q&amp;A on Reddit:&quot;My TED Talk was just posted. <a href=\"http:\/\/www.reddit.com\/r\/IAmA\/comments\/itvu5\/my_ted_talk_has_just_been_published_ama\/\" target=\"_blank\">Ask me anything<\/a>.<\/p><p>See the full documentary on <a href=\"http:\/\/www.youtube.com\/watch?v=lnedOWfPKT0\" target=\"_blank\">the search for the Brain virus<\/a>.&nbsp;<\/p>","slug":"mikko_hypponen","published_at":"2011-05-26 14:57:00","updated_at":"2013-11-11 20:07:02"}}