{"speaker":{"id":1057,"title":"","firstname":"Joshua","middleinitial":"","lastname":"Roman","description":"Cellist","whotheyare":"Joshua Roman is an internationally recognized cellist. ","whylisten":"<p>Dubbed a &ldquo;Classical Rock Star&rdquo; by the press, cellist Joshua Roman has earned a national reputation for performing a wide range of repertoire with an absolute commitment to communicating the essence of the music at its most organic level. Before embarking on a solo career, he was for two seasons principal cellist of the Seattle Symphony, a position he won in 2006 at the age of 22. For his ongoing creative initiatives on behalf of classical music, he has been selected as a 2011 TED Fellow, joining a select group of Next Generation innovators who have shown unusual accomplishments and the potential to positively affect the world.<br \/><br \/>Roman&rsquo;s 2009&ndash;10 season engagements include debuts as concerto soloist with the San Francisco Symphony, as well as the Albany, Arkansas, and Santa Barbara Symphonies, the New Philharmonic Orchestra in Illinois, Oklahoma&rsquo;s Signature Symphony, and Kentucky&rsquo;s Lexington Philharmonic. In recent seasons he has performed with the Seattle Symphony, where he gave the world premiere of David Stock&rsquo;s Cello Concerto, as well as with the Symphonies of Edmonton, Quad City, Spokane, and Stamford, and the Oklahoma City Philharmonic, among others. In 2008, Roman performed Britten&rsquo;s third Cello Suite during New York&rsquo;s Mostly Mozart Festival in a pre-concert recital at Avery Fisher Hall. In April 2009, he was the only guest artist invited to play an unaccompanied solo during the YouTube Symphony Orchestra&rsquo;s debut concert at Carnegie Hall.<br \/><br \/>In addition to his solo work, Roman is an avid chamber music performer. He has enjoyed collaborations with veterans like Earl Carlyss and Christian Zacharias, as well as the Seattle Chamber Music Society and the International Festival of Chamber Music in Lima, Peru. He often joins forces with other dynamic young soloists and performers from New York&rsquo;s contemporary music scene, including Alarm Will Sound, So Percussion, and artists from the Chamber Music Society of Lincoln Center&rsquo;s CMS Two. In spring 2007, he was named Artistic Director of TownMusic, an experimental chamber music series at Town Hall in Seattle, where he creates programs that feature new works and reflect the eclectic range of his musical influences and inspirations.<br \/><br \/>Committed to making music accessible to a wider audience, Roman may be found anywhere from a club to a classroom, whether performing jazz, rock, chamber music, or a solo sonata by Bach or Kod&aacute;ly. His versatility as a performer and his ongoing exploration of new concertos, chamber music, and solo cello works have spawned projects with composers such as Aaron Jay Kernis, Mason Bates, and Dan Visconti. One of Roman&rsquo;s current undertakings is an online video series calledThe Popper Project&mdash;wherever the cellist and his laptop find themselves, he performs an &eacute;tude from David Popper&rsquo;s &ldquo;High School of Cello Playing&rdquo; and uploads it, unedited, to his YouTube channel. Roman&rsquo;s outreach endeavors have taken him to Uganda with his violin-playing siblings, where they played chamber music in schools, HIV\/AIDS centers, and displacement camps, communicating a message of hope through music.<\/p>","slug":"joshua_roman","published_at":"2011-05-27 14:32:00","updated_at":"2018-03-06 19:08:36"}}