{"speaker":{"id":106,"title":"","firstname":"Tom","middleinitial":"","lastname":"Rielly","description":"Satirist","whotheyare":"Traditionally, Tom Rielly closes the TED Conference with a merciless 18-minute monologue, skewering all the speakers with his deadpan delivery, spot-on satire and boundary-less performance (complete with PowerPoint, pratfalls and partial nudity).\r\n","whylisten":"<p>Talk a walk back through the history of digital media, and you&#39;ll find our colleague Tom Rielly every step along the way. He entered the mediasphere with a memorable turn in the 1980 film <em><a href=\"http:\/\/www.imdb.com\/title\/tt0081207\/\" target=\"_blank\">My Bodyguard<\/a>.<\/em> A lifelong performer, he soon found a second love in personal computing. He recognized early on the incredible power of Macs, CD-ROMs and the Web, founding Yale&#39;s Macintosh User Group in 1984, then working at SuperMac, Farallon and Voyager, among other pioneering companies.<br \/><br \/>Rielly is perhaps best-known for co-founding <a href=\"http:\/\/www.planetout.com\/\" target=\"_blank\">PlanetOut<\/a>, the first digital home for gays and lesbians, which went public in 2004. He also co-founded the influential nonprofit Digital Queers. As TED&#39;s <a href=\"\/index.php\/profiles\/view\/id\/46\" target=\"_blank\">Director of Partnerships<\/a>, Tom now choreographs the wide range of collaborations that help bring TED to life, at the conference and online. But <strong>he&#39;s found his true vocation as TED&#39;s resident satirist<\/strong>, a role he&#39;s played for more than a decade. <\/p><p>Since 1995, Rielly has been <strong>hijacking the final session of the conference with his whip-smart satire of all the speakers who came before him<\/strong> -- skewering the egos, mocking the flights of fancy, parroting the doomsday predictions, and imagining a world where Al Gore tells him &quot;I can&#39;t quit you.&quot;<br \/><br \/>Fearless and unfailingly funny, Tom&#39;s lightning performances bring a flash of brilliance to the closing session and draw a standing ovation every time.<\/p>","slug":"tom_rielly","published_at":"2007-04-16 03:45:00","updated_at":"2009-06-10 02:11:50"}}