{"speaker":{"id":107,"title":"","firstname":"Thomas","middleinitial":"","lastname":"Dolby","description":"Electronic music pioneer","whotheyare":"Thomas Dolby has spent his career at the intersection of music and technology. He was an early star on MTV, then moved to Silicon Valley, then went back on the road with his album, \"A Map of the Floating City.\"","whylisten":"<p>Perhaps best known for blinding us with science, Thomas Dolby has always blurred the lines between composition and invention. As a London teenager, Tom Robertson was fascinated with the convergence of music and technology. His experiments with an assortment of keyboards, synthesizers and cassette players led his friends to dub him &ldquo;Dolby.&rdquo;&nbsp;That same fascination later drove him to become <strong>an electronic musician and multimedia artist whose groundbreaking work fused music with computer technology and video<\/strong>. Two decades, several film scores, five Grammy nominations and countless live-layered sound loops later, it&#39;s clear Dolby&#39;s innovations have changed the sound of popular music.<br \/><br \/>In the 1990s, Dolby re-created himself as a digital-musical entrepreneur, founding Beatnik, which developed the polyphonic ringtone software used in more than half a billion cell phones. From 2001 to 2012, <strong>Dolby served as&nbsp;TED&#39;s Music Director, <\/strong>programming great music for the TED stage, assembling a wide variety of house bands and collaborations to play between speakers. At TED2010, backed by the string quarter Ethel, he premiered the song &quot;Love Is a Loaded Pistol,&quot; from his sweeping,&nbsp;<a href=\"http:\/\/geni.us\/floatingcitymap\" target=\"_blank\"><em>A Map of the Floating City<\/em><\/a>. The album marked his return&nbsp;to recording<strong>&nbsp;<\/strong>and touring<strong>&nbsp;<\/strong>after a 15-year hiatus, and used seriously retro technology -- &#39;40s-era oscilloscopes and Royal Navy field-test equipment -- to control modern synthesizers, in shows at once&nbsp;<a href=\"http:\/\/www.buzzle.com\/showImage.asp?image=10637\" target=\"_blank\">nostalgic<\/a>&nbsp;and cutting edge. <\/p><p>In 2014, Dolby took on a new name: professor. He was named the Homewood Professor of the Arts at Johns Hopkins University, teaching the course &quot;Sound on Film.&quot;<\/p>","slug":"thomas_dolby","published_at":"2007-04-16 05:30:00","updated_at":"2015-10-04 18:25:49"}}