{"speaker":{"id":1084,"title":"","firstname":"Skylar","middleinitial":"","lastname":"Tibbits","description":"Designer, computer scientist","whotheyare":"Skylar Tibbits is the founder and codirector of the Self-Assembly Lab at MIT and assistant professor of design research in the department of architecture.","whylisten":"<p class=\"MsoNormal\">Skylar Tibbits&#39;s research focuses on developing self-assembly and programmable materials within the built environment. He is the founder and codirector of the&nbsp;<a href=\"https:\/\/selfassemblylab.mit.edu\" target=\"_blank\">Self-Assembly Lab<\/a>&nbsp;at MIT and an associate professor of design research in the department of architecture.&nbsp;<\/p><p class=\"MsoNormal\">Tibbits has designed and built large-scale installations and exhibited in galleries around the world, including the Centre Pompidou, Philadelphia Museum of Art, Cooper Hewitt Smithsonian Design Museum, Victoria and Albert Museum and others. He is the author of the book&nbsp;<a href=\"https:\/\/geni.us\/1MiA0mj\" target=\"_blank\"><em>Self-Assembly Lab: Experiments in Programming Matter<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/geni.us\/qA2FA\" target=\"_blank\"><em>Active Matter<\/em><\/a>, coeditor of&nbsp;<a href=\"https:\/\/geni.us\/4esXeI\" target=\"_blank\"><em>Being Material<\/em><\/a>&nbsp;and editor-in-chief of the journal <em>3D Printing and Additive Manufacturing<\/em>.<\/p><p class=\"MsoNormal\">Tibbits holds a professional degree in architecture and a minor in experimental computation from Philadelphia University, a masters degree in design computation and a masters in computer science from MIT. He has worked at a number of design offices, including Zaha Hadid Architects, Asymptote Architecture and Point b Design. He has been recognized by a number of awards, including LinkedIn&#39;s Next Wave Award for Top Professionals under 35 (2016), R and D Innovator of the Year (2015), National Geographic Emerging Explorer (2015), an Inaugural <em>WIRED<\/em> Fellowship (2014), the Architectural League Prize (2013), Ars Electronica Next Idea Award (2013), TED Senior Fellow (2012) and in 2008, he was named a Revolutionary Mind by <em>SEED<\/em> magazine.<\/p>","slug":"skylar_tibbits","published_at":"2011-09-01 15:16:00","updated_at":"2020-05-04 15:13:44"}}