{"speaker":{"id":110,"title":"","firstname":"David","middleinitial":"","lastname":"Kelley","description":"Designer, educator","whotheyare":"David Kelley’s company IDEO helped create many icons of the digital generation -- but what matters even more to him is unlocking the creative potential of people and organizations to innovate routinely.","whylisten":"<p>As founder of legendary design firm IDEO, David Kelley built the  company that created many icons of the digital generation -- the first  mouse, the first Treo, the thumbs up\/thumbs down button on your Tivo&#39;s  remote control, to name a few. But what matters even more to him is  unlocking the creative potential of people and organizations so they can  innovate routinely.<\/p><p>David Kelley&#39;s most enduring contributions to  the field of design are a methodology and culture of innovation. More  recently, he led the creation of the groundbreaking d.school at  Stanford, the Hasso Plattner Institute of Design, where students from  the business, engineering, medicine, law, and other diverse disciplines  develop the capacity to solve complex problems collaboratively and  creatively.<\/p><p>Kelley was working (unhappily) as an electrical  engineer when he heard about Stanford&#39;s cross-disciplinary Joint Program  in Design, which merged engineering and art. What he learned there -- a  human-centered, team-based approach to tackling sticky problems through  design -- propelled his professional life as a &quot;design thinker.&quot;<\/p><p>In  1978, he co-founded the design firm that ultimately became IDEO, now  emulated worldwide for its innovative, user-centered approach to design.  IDEO works with a range of clients -- from food and beverage  conglomerates to high tech startups, hospitals to universities, and  today even governments -- conceiving breakthrough innovations ranging  from a life-saving portable defibrillator to a new kind of residence for  wounded warriors, and helping organizations build their own innovation  culture.<\/p><p>Today, David serves as chair of IDEO and is the Donald  W. Whittier Professor at Stanford, where he has taught for more than 25  years. Preparing the design thinkers of tomorrow earned David the Sir  Misha Black Medal for his &ldquo;distinguished contribution to design  education.&rdquo; He has also won the Edison Achievement Award for Innovation,  as well as the Chrysler Design Award and National Design Award in  Product Design from the Smithsonian&rsquo;s Cooper-Hewitt National Design  Museum, and he is a member of the National Academy of Engineers.<\/p>","slug":"david_kelley","published_at":"2007-05-14 15:45:00","updated_at":"2012-05-16 14:28:42"}}