{"speaker":{"id":1110,"title":"","firstname":"Joe","middleinitial":"","lastname":"Sabia","description":"Storyteller","whotheyare":"Joe Sabia investigates new ways to tell stories -- meshing viral video and new display technologies with old-fashioned narrative.","whylisten":"<p>Joe Sabia is a NYC-based conceptual digital video artist who creates shareable videos and formats across a multitude of genres, amassing more than 1 billion views in total. As a creative consultant, Moth Programming Board member, and award-winning director\/editor, his current role has him creating franchise video formats across the Conde Nast Portfolio as VP of Creative Development.&nbsp;<\/p><p>You may recognize his voice as the guy on Vogue&#39;s &quot;<a href=\"https:\/\/video.vogue.com\/series\/73-questions\" target=\"_blank\">73 Questions<\/a>.&quot; Some of his work includes the &quot;<a href=\"https:\/\/www.youtube.com\/playlist?list=PLibNZv5Zd0dwjZFCTVZ8QdKq194CkwXjo\" target=\"_blank\">Wired Autocomplete Interview<\/a>&quot; series, &quot;<a href=\"https:\/\/video.glamour.com\/series\/you-sang-my-song\" target=\"_blank\">You Sang My Song<\/a>&quot; on Glamour, and &quot;<a href=\"https:\/\/video.vanityfair.com\/series\/lie-detector-test\" target=\"_blank\">Lie Detector<\/a>&quot; and &quot;<a href=\"https:\/\/video.vanityfair.com\/series\/tinder-takeover\" target=\"_blank\">Tinder Takeover<\/a>&quot; on Vanity Fair. Joe created &quot;<a href=\"https:\/\/www.youtube.com\/watch?v=qSElmEmEjb4\" target=\"_blank\">African Men, Hollywood Stereotypes<\/a>&quot; which launched the awareness campaign of Africa-based non-profit Mama Hope. He spent two years making an art project called &quot;<a href=\"http:\/\/theofficestaremachine.com\/\" target=\"_blank\">The Office Stare Machine<\/a>&quot; which takes 700 stares from The Office and catalogues them against hundreds of emotions. He also co-founded &quot;<a href=\"https:\/\/www.youtube.com\/channel\/UCzdbnf-pIJh-Qp6fdSb5ezw\" target=\"_blank\">CDZA<\/a>&quot;, a music channel featuring hundreds of conservatory-trained musicians in viral videos, including&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=7Q_8BGjVBGg\" target=\"_blank\">directing a set<\/a>&nbsp;with Spike Jonze at the first ever YouTube Music Awards.&nbsp;<\/p><p>Sabia&#39;s hobbies include being an amateur classical pianist, the 2007 international pun champion and proud co-owner of an Italian restaurant. He also documents management facility in the Republic of Georgia.<\/p>","slug":"joe_sabia","published_at":"2011-11-23 15:23:00","updated_at":"2018-08-30 13:01:23"}}