{"speaker":{"id":1116,"title":"","firstname":"Srdja","middleinitial":"","lastname":"Popovic","description":"Organizer","whotheyare":"Srdja Popovic was a founder and leader of the student movement that brought down the Milosovic regime. Now, he helps other nonviolent movements learn and grow.","whylisten":"<p>Srdja Popovic was one of the founders  and key organizers of the  Serbian nonviolent resistance group Otpor!  Otpor!&rsquo;s campaign to unseat  Serbian president Slobodan Milosovic found  success in October 2000 when  hundreds of thousands of protestors converged  upon and took over the  Serbian Parliament, effectively ending Milosevic&rsquo;s  rule. After the  revolution, Popovic served a term as a member of the  Serbian National  Assembly 2000-2003.<\/p> <p>In 2003, Popovic and other ex-Otpor!  activists started the  nonprofit educational institution the Centre  for Applied Nonviolent  Action and Strategies (CANVAS) (<a href=\"http:\/\/www.canvasopedia.org\/\" target=\"_blank\">www.canvasopedia.org<\/a>).   CANVAS has worked with people from 37 countries, including   Zimbabwe, Burma, Iran and Venezuela, spreading knowledge on  nonviolent  strategies and tactics that was used by the Serbian  pro-democracy movement  to other non-democratic countries. CANVAS has  worked with the activists  responsible for successful movements such as  the Georgian &ldquo;Rose Revolution&rdquo;  of 2003 and the Ukrainian &ldquo;Orange  Revolution&rdquo; of 2004-2005. It also  transferred knowledge to Lebanese  activists in 2004 to address the crisis  after the assassination of  Prime Minister Harriri, and assisted participants  in the Maldives&rsquo;  revolution in 2008. Recently CANVAS has worked with  April 6th, a key  group in the Egyptian nonviolent uprising, as well  as other groups from  the Middle East.<\/p> <p>CANVAS&rsquo; teachings are available in  a documentary, &quot;Bringing Down a  Dictator,&quot; featuring Otpor  strategies to topple Milosevic. Its manual  &quot;Nonviolent Struggle:  50 Crucial Points&quot; was translated into 16  languages, including  Farsi and Arabic, and was downloaded 17,000 times  from Iran during that  country&#39;s 2009 protests.<\/p> ","slug":"srdja_popovic","published_at":"2011-12-05 16:12:00","updated_at":"2015-10-09 23:10:15"}}