{"speaker":{"id":112,"title":"","firstname":"Jeff","middleinitial":"","lastname":"Hawkins","description":"Computer designer, brain researcher","whotheyare":"Jeff Hawkins pioneered the development of PDAs such as the Palm and Treo. Now he's trying to understand how the human brain really works, and adapt its method -- which he describes as a deep system for storing memory -- to create new kinds of computers and tools.","whylisten":"<p>Jeff Hawkins&#39; <a href=\"http:\/\/www.palm.com\" target=\"_blank\">Palm<\/a>  PDA became such a widely used productivity tool during the 1990s that some fanatical users claimed it replaced their brains. But Hawkins&#39; deepest interest was in the brain itself. So after the success of the Palm and Treo, which he brought to market at Handspring, <strong>Hawkins delved into brain research<\/strong> at the <a href=\"http:\/\/redwood.berkeley.edu\/\" target=\"_blank\">Redwood Center for Theoretical Neuroscience<\/a>  in Berkeley, Calif., and a new company called <a href=\"http:\/\/www.numenta.com\/\" target=\"_blank\">Numenta<\/a>. <\/p><p>Hawkins&#39; dual goal is to achieve an understanding of how the human brain actually works -- and then develop software to mimic its functionality, <strong>delivering true artificial intelligence<\/strong>. In his book <em><a href=\"http:\/\/www.onintelligence.org\/\" target=\"_blank\">On Intelligence<\/a><\/em> (2004) he lays out his compelling, controversial theory: Contrary to popular AI wisdom, the human neocortex doesn&#39;t work like a processor; rather, it relies on <strong>a memory system that stores and plays back experiences to help us predict, intelligently, what will happen next<\/strong>. He thinks that &quot;hierarchical temporal memory&quot; computer platforms, which mimic this functionality (and which Numenta might pioneer), could enable groundbreaking new applications that could powerfully extend human intelligence.<\/p>","slug":"jeff_hawkins","published_at":"2007-05-21 10:16:00","updated_at":"2008-06-22 02:30:24"}}