{"speaker":{"id":1122,"title":"","firstname":"Monika","middleinitial":"","lastname":"Bulaj","description":"Photographer","whotheyare":"Monika Bulaj’s stunning, painting-like photographs blur religious and cultural divisions, exploding stereotypes. She is a TED Fellow.","whylisten":"<p><a href=\"http:\/\/www.monikabulaj.com\/eng\/\" target=\"_blank\">Monika Bulaj<\/a>  is a photographer and writer who explores -- in  Asia, Africa, Latin America and Eastern Europe -- the dim areas of monotheism, where the sacred can transcend borders: Bonfires, dances,  cults of the dead, possession rites. She describes outskirts and deserts,  frontiers and megalopolis. And the world of the last ones: nomads,  farmers, immigrants, outcasts, untouchables and impure. <\/p><p>Her photos and reportaging have been published by GEO, National  Geographic (Italy), La Repubblica, periodicals by  Gruppo Espresso and  Rcs, Courrier International, Gazeta Wyborcza (Poland), Internazionale,  Freundin, Teatr (Poland) and other international magazines.<br \/> She has displayed more than 50 personal exibitions in Italy, Germany, Ungheria, Bulgaria, Egypt. <\/p><p>Her books include&nbsp;<em><a href=\"http:\/\/geni.us\/libyafelix\" target=\"_blank\">Libya felix<\/a>,<\/em>&nbsp;a travel into Sufism and the world of the Tuaregh; <em>Figli di No&egrave;<\/em>, on minorities and faiths in Azerbaijian;&nbsp;<em><a href=\"http:\/\/geni.us\/rebeccaelapioggia\" target=\"_blank\">Rebecca e la pioggia<\/a>,<\/em>&nbsp;on the nomadic tribe of the Dinka of South Sudan;&nbsp;<a href=\"http:\/\/geni.us\/gerusalemmeperduta\" target=\"_blank\"><em>Gerusalemme perduta<\/em><\/a>&nbsp;with Paolo Rumiz, the special correspondent of  La Repubblica, on the pellegrinage in the research of the  Eastern Christians;&nbsp;<em><a href=\"http:\/\/geni.us\/gentididio\" target=\"_blank\">Genti di Dio, viaggio nell&#39;Altra Europa<\/a>,<\/em>&nbsp;a synthesis of 20 years of research in East Europe and Israel, and her latest book,&nbsp;<em><a href=\"http:\/\/geni.us\/bozyludzie\" target=\"_blank\">Bozy ludzie<\/a>.<\/em>&nbsp;<br \/> <br \/> She has screenwritten  documentaries, among which is the movie <em>Romani  Rat<\/em> (2002) by M. Orlandi,  on the Holocaust of the Roms, with the  contribution of  the Shoah Visual History Foundation. She&#39;s the director,  photography director, and screenwriter of the documentary <em>Figli di  No&egrave;<\/em>, about the villages of Caucasus on the  border between Dagestan and Azerbaigian. <\/p><p>Bulaj is a TED Fellow. Read <a href=\"http:\/\/blog.ted.com\/2011\/11\/18\/fellows-friday-with-monika-bulaj\/\" target=\"_blank\">TED&#39;s Q&amp;A with Monika Bulaj &gt;&gt;<\/a>  <\/p>","slug":"monika_bulaj","published_at":"2011-12-11 17:28:00","updated_at":"2015-10-05 15:29:41"}}