{"speaker":{"id":1131,"title":"","firstname":"Jane","middleinitial":"","lastname":"Fonda","description":"Actor, activist","whotheyare":"Jane Fonda has had four extraordinary careers (so far): Oscar-winning actor, author, fitness guru and impassioned activist.","whylisten":"<p>Jane Fonda is a two-time Academy Award-winning actress (Best Actress in 1971 for <em>Klute<\/em> and in 1978 for <em>Coming Home<\/em>) and activist. Her career has spanned over 50 years, accumulating a body of film work that includes over 45 films and crucial work on political issues such as women&#39;s rights, Native American rights and the environment. She is a seven-time Golden Globe winner, Honorary Palme d&#39;Or honoree, 2014 AFI Life Achievement Award winner and the 2019 recipient of the Stanley Kubrick Excellence in Film Award as part of BAFTA&#39;s Britannia Awards. Fonda is currently in production for the seventh and final season of <em>Grace and Frankie<\/em>, which will be Netflix&#39;s longest running original series. For her work on the series, she received an Emmy nomination for Outstanding Lead Actress in a Comedy Series in 2017. She was last seen on the big screen in Paramount&#39;s comedy, <em>Book Club,<\/em> in which she starred alongside Diane Keaton, Mary Steenburgen and Candice Bergen. She also premiered <em>Jane Fonda in Five Acts<\/em>, a documentary for HBO chronicling her life and activism, at the 2018 Sundance Film Festival. The documentary received an Emmy nomination for Outstanding Documentary or Nonfiction Special in 2019.<\/p><p>Fonda celebrated her 80th birthday by raising 1 million dollars for each of her nonprofits,&nbsp;<a href=\"https:\/\/www.gcapp.org\/\" target=\"_blank\">Georgia Campaign for Adolescent Power and Potential<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.womensmediacenter.com\/\" target=\"_blank\">The Women&#39;s Media Center<\/a>. Currently, she is leading the charge on&nbsp;<a href=\"https:\/\/firedrillfridays.com\/\" target=\"_blank\">Fire Drill Fridays<\/a>, a national movement to protest government inaction on climate change. Her latest book, <a href=\"https:\/\/geni.us\/ZgRSy\" target=\"_blank\"><em>What Can I Do? My Path From Climate Despair To Action<\/em><\/a>, details her personal journey with the movement and provides solutions for communities to combat the climate crisis.<\/p>","slug":"jane_fonda","published_at":"2012-01-04 15:49:00","updated_at":"2020-10-12 00:14:18"}}