{"speaker":{"id":1164,"title":"","firstname":"Sarah","middleinitial":"","lastname":"Parcak","description":"Satellite archaeologist + TED Prize winner","whotheyare":"Like a modern-day Indiana Jones, Sarah Parcak uses satellite images to locate lost ancient sites. The winner of the 2016 TED Prize, her wish is to protect the world’s shared cultural heritage.","whylisten":"<p>There may be hundreds of thousands, if not millions, of undiscovered ancient sites across the globe. Sarah Parcak wants to locate them. As a space archaeologist, she analyzes high-resolution imagery collected by satellites in order to identify subtle changes to the Earth&rsquo;s surface that might signal man-made features hidden from view. A TED Senior Fellow and a <a href=\"http:\/\/www.nationalgeographic.com\/explorers\/bios\/sarah-parcak\/\" target=\"_blank\" onclick=\"window.open('','','');return false;\">National Geographic Explorer<\/a>, Parcak wrote the <a href=\"http:\/\/target.georiot.com\/Proxy.ashx?TSID=12033&amp;GR_URL=https%3A%2F%2Fwww.amazon.com\/Satellite-Remote-Sensing-Archaeology-Parcak\/dp\/0415448786\" onclick=\"window.open('','','');return false;\">textbook on satellite archaeology<\/a> and founded the Laboratory for Global Observation at the University of Alabama at Birmingham. Her goal: to make the world&#39;s invisible history visible once again.<\/p><p>In Egypt, Parcak&#39;s techniques have helped locate 17 potential pyramids, and more than 3,100 potential forgotten settlements. She&#39;s also made discoveries in the Viking world (as seen in the PBS Nova special,&nbsp;<em><a href=\"http:\/\/www.pbs.org\/wgbh\/nova\/ancient\/vikings-unearthed.html\" target=\"_blank\" onclick=\"window.open('','','');return false;\">Vikings Unearthed<\/a>)<\/em>&nbsp;and across the Roman Empire (as shown in the BBC documentary,&nbsp;<em><a href=\"http:\/\/www.bbc.co.uk\/programmes\/b01pc063\" target=\"_blank\" onclick=\"window.open('','','');return false;\">Rome&rsquo;s Lost Empire<\/a>).<\/em>&nbsp;Her methods also offer a new way to understand how ancient sites are being affected by looting and urban development. By satellite-mapping Egypt and comparing sites over time, Parcak has noted a 1,000 percent increase in looting since 2009. It&rsquo;s likely that millions of dollars worth of artifacts are stolen each year. Parcak hopes that, through her work, unknown sites can be protected to preserve our rich, vibrant history.<\/p><p>As the winner of the 2016 TED Prize, Parcak asked the world to help in this important work. By building a citizen science platform for archaeology,&nbsp;<a href=\"http:\/\/www.globalxplorer.org\/\" target=\"_blank\">GlobalXplorer.org<\/a>, Parcak invites anyone with an internet connection to help find the next potential looting pit or unknown tomb. GlobalXplorer launched on January 30, 2017, with volunteers working together to map Peru. Other countries will follow, as the platform democratizes discovery and makes satellite-mapping rapid and cost-effective.&nbsp;<\/p><p>&nbsp;<\/p>","slug":"sarah_parcak","published_at":"2012-01-05 17:04:00","updated_at":"2017-01-30 15:23:24"}}