{"speaker":{"id":1166,"title":"","firstname":"Sherry","middleinitial":"","lastname":"Turkle","description":"Cultural analyst","whotheyare":"Sherry Turkle studies how technology is shaping our modern relationships: with others, with ourselves, with it.","whylisten":"        <p class=\"p1\">Since her path breaking&nbsp;<a href=\"http:\/\/geni.us\/secondself\" target=\"_blank\"><em>The Second Self: Computers and The Human Spirit<\/em><\/a>&nbsp;in 1984 psychologist and sociologist Sherry Turkle has been studying how technology changes not only what we do but also whom we are. In 1995&#39;s&nbsp;<a href=\"http:\/\/geni.us\/lifeonscreen\" target=\"_blank\"><em>Life on the Screen: Identity in the Age of the Internet<\/em><\/a>, Turkle explored how the Internet provided new possibilities for exploring identity. In her book,&nbsp;<a href=\"http:\/\/geni.us\/AloneTogether\" target=\"_blank\"><em>Alone Together: Why We Expect More From Technology and Less From Each Other<\/em><\/a>, Turkle argues that the social media we encounter on a daily basis confront us with moments of temptation. Drawn by the illusion of companionship without the demands of intimacy, we confuse postings and online sharing with authentic communication. In her most&nbsp;recent bestselling book,&nbsp;<a href=\"http:\/\/geni.us\/ReclaimingConvo\" target=\"_blank\"><em>Reclaiming Conversation: The Power of Talk in a Digital Age<\/em><\/a>, Turkle argues that now, with a deeper understanding of our vulnerability to technology, we must reclaim conversation, the most human&mdash;and humanizing&mdash;thing that we do. The virtues of person-to-person conversation are timeless; to the disconnections of our modern age, it is the talking cure.<\/p> <p class=\"p1\">Described as &quot;the Margaret Mead of digital cuture,&quot; Turkle&#39;s work focuses on the world of social media, the digital workplace, and the rise of chatbots and sociable robots. As she puts it, these are technologies that propose themselves &quot;as the architect of our intimacies.&quot; We are drawn to sacrifice conversation for mere connection. Turkle suggests that just because we grew up with the Internet, we tend to see it as all grown up, but it is not: Digital technology is still in its infancy, and there is ample time for us to reshape how we build it and use it.<\/p> <p class=\"p1\">Turkle is a professor in the Program in Science, Technology and Society at MIT and the founder and director of the MIT Initiative on Technology and Self.<\/p>","slug":"sherry_turkle","published_at":"2012-01-05 17:09:00","updated_at":"2016-03-23 00:55:25"}}