{"speaker":{"id":117,"title":"","firstname":"Blaise","middleinitial":"","lastname":"Agüera y Arcas","description":"Software architect","whotheyare":"Blaise Agüera y Arcas works on machine learning at Google. Previously a Distinguished Engineer at Microsoft, he has worked on augmented reality, mapping, wearable computing and natural user interfaces.","whylisten":"<p>Blaise Ag&uuml;era y Arcas is principal scientist at Google, where he leads a team working on machine intelligence for mobile devices. His group works extensively with deep neural nets for machine perception and distributed learning, and it also investigates so-called &quot;connectomics&quot; research, assessing maps of connections within the brain.<\/p><p>Ag&uuml;era y Arcas&#39; background is as multidimensional as the visions he helps create. In the 1990s, he authored patents on both video compression and 3D visualization techniques, and in 2001, he made an influential computational discovery that <a href=\"http:\/\/www.open2.net\/historyandthearts\/discover_science\/gutenberg_discovery.html\" target=\"_blank\">cast doubt<\/a>  on Gutenberg&#39;s role as the father of movable type.<\/p><p>He also created <a href=\"http:\/\/labs.live.com\/Seadragon.aspx\" target=\"_blank\">Seadragon<\/a>  (acquired by Microsoft in 2006), the visualization technology that gives Photosynth its amazingly smooth digital rendering and zoom capabilities. Photosynth itself is a vastly powerful piece of software capable of taking a wide variety of images, analyzing them for similarities, and grafting them together into an interactive three-dimensional space. This seamless patchwork of images can be viewed via multiple angles and magnifications, allowing us to look around corners or &ldquo;fly&rdquo; in for a (much) closer look. Simply put, it could utterly transform the way we experience digital images.<\/p><p>He joined Microsoft when Seadragon was acquired by Live Labs in 2006. Shortly after the acquisition of Seadragon,&nbsp;Ag&uuml;era y Arcas&nbsp;directed his team in a collaboration with Microsoft Research and the University of Washington, leading to the first public previews of Photosynth several months later. <a href=\"\/talks\/blaise_aguera_y_arcas_demos_photosynth.html\" target=\"_blank\">His TED Talk on Seadragon and Photosynth<\/a>  in 2007 is rated one of TED&#39;s &quot;most jaw-dropping.&quot; He returned to TED in 2010 to demo <a href=\"http:\/\/www.ted.com\/talks\/blaise_aguera.html\" target=\"_blank\">Bing&rsquo;s augmented reality maps<\/a>.<\/p><p>Fun fact: <a href=\"http:\/\/blog.ted.com\/2012\/08\/14\/ted-gets-hilariously-fictionalized-a-qa-with-author-maria-semple\/\" target=\"_blank\">According to the author<\/a>,&nbsp;Ag&uuml;era y Arcas&nbsp;is the inspiration for the character Elgin in the 2012 best-selling novel&nbsp;<em><a href=\"http:\/\/geni.us\/bernadette\" target=\"_blank\">Where&#39;d You Go, Bernadette?<\/a><\/em><\/p>","slug":"blaise_aguera_y_arcas","published_at":"2007-05-27 12:09:00","updated_at":"2016-06-28 14:32:23"}}