{"speaker":{"id":1177,"title":"","firstname":"Paul","middleinitial":"","lastname":"Gilding","description":"Writer","whotheyare":"Paul Gilding is an independent writer, activist and adviser on a sustainable economy. Click through to watch the onstage debate that followed this talk.","whylisten":"<p><a href=\"http:\/\/blog.ted.com\/2012\/03\/14\/exclusive-qa-from-the-ted-stage-paul-gilding-and-peter-diamandis-debate\/\" target=\"_blank\"><strong>Watch the debate with Peter Diamandis that followed this talk &gt;&gt;<\/strong><\/a><\/p><p>Paul Gilding has spent 35 years trying to change the world. He&rsquo;s served in the Australian military, chased nuclear armed aircraft carriers in small inflatable boats, plugged up industrial waste discharge pipes, been global CEO of Greenpeace, taught at Cambridge University, started two successful businesses and advised the CEOs of some the world&rsquo;s largest companies. <\/p><p>Despite his clear lack of progress, the unstoppable and flexible optimist is now a writer and advocate, travelling the world with his book&nbsp;<a href=\"http:\/\/geni.us\/greatdisruption\" target=\"_blank\"><em>The Great Disruption<\/em><\/a>&nbsp;alerting people to the global economic and ecological crisis unfolding around us, as the world economy reaches and passes the limits to growth. He is confident we can get through what&rsquo;s coming and says rather than the end of civilization, this could be the beginning! He argues we will rise to the occasion and see change at a scale and speed incomprehensible today, but need to urgently prepare for The Great Disruption and &ldquo;the end of shopping&rdquo;, as we reinvent the global economy and our model of social progress. <\/p><p>Read his reaction to attending TED2012: &quot;<a rel=\"bookmark\" href=\"http:\/\/paulgilding.com\/cockatoo-chronicles\/will-the-techno-optimists-save-the-world.html\" title=\"Permalink to Will the techno-optimists save the world?\">Will the techno-optimists save the world?<\/a>&quot;&nbsp; <\/p>","slug":"paul_gilding","published_at":"2012-01-06 20:39:00","updated_at":"2015-10-04 19:25:45"}}