{"speaker":{"id":1186,"title":"","firstname":"Tyler","middleinitial":"","lastname":"Cowen","description":"Economist","whotheyare":"In his work, economist Tyler Cowen looks at clues from pop culture, art, food, to gather data and make observations on the world's globalizing culture and commerce. ","whylisten":"<p>Tyler Cowen is a professor of economics at George Mason University, and partners with Alex Tabarrok to write the economics blog <a href=\"http:\/\/marginalrevolution.com\/\" target=\"_blank\">Marginal Revolution<\/a>, where he hunts for clues to whatever is coming next, in the space where economics and culture entwine. His outlook is fairly libertarian, but it&#39;s not ivory-tower -- in fact, he&#39;s been accused of &quot;<a href=\"http:\/\/www.economist.com\/blogs\/freeexchange\/2007\/07\/whats_wrong_with_cuteonomics\" target=\"_blank\">cute-o-nomics<\/a>&quot; for daring to use economic models to explain real-world problems instead of theoretical abstractions.<br \/><br \/>His latest book is a short ebook called <a href=\"http:\/\/geni.us\/greatstagnation\" target=\"_blank\"><em>The Great Stagnation: How America Ate All the Low-Hanging Fruit of Modern History, Got Sick, and Will (Eventually) Feel Better<\/em><\/a>. In it, he suggests that while the days of easy growth are probably over for the US, it&#39;s probably not in a death spiral just yet. <br \/><br \/>Cowen is also a passionate foodie (check out his blog <a href=\"http:\/\/tylercowensethnicdiningguide.com\/\" target=\"_blank\">Tyler Cowen&#39;s Ethnic Dining Guide<\/a>); in fact, his next book is<a href=\"http:\/\/geni.us\/economistgetslunch\" target=\"_blank\"> <em>An Economist Gets Lunch: New Rules for Everyday Foodies<\/em><\/a><em>. <\/em><\/p><p>Find a <a href=\"http:\/\/lesswrong.com\/r\/discussion\/lw\/8w1\/transc%C2%ADript_tyler_cowen_on_stories\/\" target=\"_blank\">transcript for Tyler Cowen&#39;s TEDxMidAtlantic talk on lesswrong.com &gt;&gt;<\/a> <\/p>","slug":"tyler_cowen","published_at":"2012-01-09 15:55:00","updated_at":"2015-07-13 17:40:53"}}