{"speaker":{"id":1193,"title":"","firstname":"Karen","middleinitial":"","lastname":"Bass","description":"Natural history filmmaker ","whotheyare":"Karen Bass has traveled the world to explore and capture footage from every environment across the Earth.","whylisten":"<p>Karen Bass is a director and producer with a passion for travel and natural history. In 20 years at the BBC&rsquo;s Natural History Unit, Bass made wildlife films in almost every environment across the Earth, from the rainforests of the Congo (where she produced the first-ever film of our closest relative, the bonobo), to the deserts of Libya, Syria and Jordan, from the icy peaks of the Andes to the swamps of the Amazon, from erupting volcanoes in the Caribbean to the nocturnal world of raccoons in downtown Manhattan. Her series include <em>Andes to Amazon<\/em>, exploring the wildlife and extreme landscapes of South America; <em>Jungle<\/em>, an investigation of the world&rsquo;s rainforests; <em>Wild<\/em> <em>Caribbean<\/em>, about the varied nature, weather and landscapes of the Caribbean; and <em>Nature&rsquo;s Great Events<\/em>, a dramatic portrayal of six of the planet&rsquo;s most spectacular wildlife events. <\/p><p>Bass is now producing <a href=\"http:\/\/newswatch.nationalgeographic.com\/2012\/05\/05\/untamed-americas-sneak-peek\/\" target=\"_blank\"><em>Untamed Americas<\/em><\/a>, an epic series on the natural history of North, South and Central America, for National Geographic Television. The series is set to premiere in June 2012.<\/p><p>Her passion for travel and natural history were evident from an early age, and she has travelled widely on all the continents -- on scientific expeditions, for pleasure and to make films. In recent years she has sought out dragons on Komodo, dived the remote coral reefs of New Guinea, hang-glided over the cliffs of Byron Bay in Australia, climbed active volcanoes in Ethiopia, rafted the length of the Grand Canyon, sailed a traditional dhow in the Indian Ocean and trekked with camels through the Sahara.<\/p><p>&nbsp;<\/p>","slug":"karen_bass","published_at":"2012-01-11 16:32:00","updated_at":"2019-08-13 14:52:31"}}