{"speaker":{"id":1217,"title":"","firstname":"Thomas P.","middleinitial":"","lastname":"Campbell","description":"Museum director","whotheyare":"During his term as director of the Metropolitan Museum of Art, and now at San Francisco's Fine Arts Museums, Thomas P. Campbell aims to make museum offerings both narrative-driven and accessible.  ","whylisten":"<p>Thomas P. Campbell became the ninth Director of&nbsp;<a href=\"http:\/\/www.metmuseum.org\/\" target=\"_blank\">The Metropolitan Museum of Art<\/a>&nbsp;in January 2009, with an agenda that focuses on scholarship and accessibility across exhibitions, publications, acquisitions and permanent collections, while encouraging new thinking about the visitor experience. Campbell led the Met through the fiscal setbacks caused by the 2008 recession without reducing hours, gallery openings or programs. During his tenure, the Met opened new galleries for its Islamic Art Department and American Wing, launched an innovative TEDx program, and pioneered a collaboration with the Whitney Museum&#39;s landmark Breuer Building on Madison Avenue. He resigned from the Met in 2017, and in 2018 became the director of the Fine Arts Museums of San Francisco, overseeing the deYoung and Legion of Honor collections.<\/p><p>Campbell had worked in the Metropolitan&#39;s Department of European Sculpture and Decorative Arts for fourteen years, rising steadily through the curatorial ranks from Assistant Curator, while conceiving and organizing major exhibitions &quot;Tapestry in the Renaissance: Art and Magnificence&quot; (2002) and &quot;Tapestry in the Baroque: Threads of Splendor&quot; (New York, 2007; Palacio Real, Madrid, spring 2008). He also served as Supervising Curator of The Antonio Ratti Textile Center, which houses the Museum&#39;s encyclopedic collection of 36,000 textiles and is one of the preeminent centers of textile studies in the world.<\/p><p>&nbsp;<\/p>","slug":"thomas_p_campbell","published_at":"2012-02-02 21:19:00","updated_at":"2018-11-05 22:24:24"}}