{"speaker":{"id":1221,"title":"","firstname":"John","middleinitial":"","lastname":"Hockenberry","description":"Journalist","whotheyare":"Journalist and commentator John Hockenberry has reported from all over the world in virtually every medium. He's the author of \"Moving Violations: War Zones, Wheelchairs and Declarations of Independence.\"","whylisten":"<p>Three-time Peabody Award winner, four-time Emmy award winner and <em>Dateline NBC<\/em> correspondent, John Hockenberry has broad experience as a journalist and commentator for more than two decades. He is the co-anchor of the public radio morning show &ldquo;<a href=\"http:\/\/www.thetakeaway.org\/people\/john-hockenberry\/\" target=\"_blank\">The Takeaway<\/a>&rdquo; on WNYC and PRI. He has reported from all over the world, in virtually every medium, having anchored programs for network, cable and radio. Hockenberry joined NBC as a correspondent for <em>Dateline NBC<\/em> in January 1996 after a fifteen-year career in broadcast news at both National Public Radio and ABC News. Hockenberry&#39;s reporting for Dateline NBC earned him three Emmys, an Edward R Murrow award and a Casey Medal. <\/p><p>His most prominent <em>Dateline NBC<\/em> reports include an hour-long documentary on the often-fatal tragedy of the medically uninsured, an emotionally gripping portrait of a young schizophrenic trying to live on his own, and extensive reporting in the aftermath of September 11th.&nbsp;In 2009 Hockenberry was appointed to the White House Fellows Commission by President Barack Obama where he participates in the selection of the annual Fellows for this most prestigious of Federal programs. Hockenberry is also the author of&nbsp;<em><a href=\"http:\/\/geni.us\/riveroutofeden\" target=\"_blank\">A River out of Eden<\/a>,<\/em>&nbsp;a novel based in the Pacific Northwest, and&nbsp;<em><a href=\"http:\/\/geni.us\/movingviolations\" target=\"_blank\">Moving Violations: War Zones, Wheelchairs and Declarations of Independence<\/a>,<\/em>&nbsp;a memoir of life as a foreign correspondent, which was a finalist for the National Book Critics Circle Award in 1996. He has also written for <em>The New York Times, The New Yorker, I.D., Wired, The Columbia Journalism Review, Details, <\/em>and<em> The Washington Post<\/em>. <\/p><p>Hockenberry spent more than a decade with NPR as a general assignment reporter, Middle East correspondent and host of several programs. During the Persian Gulf War (1990-91), Hockenberry was assigned to the Middle East, where he filed reports from Israel, Tunisia, Morocco, Jordan, Turkey, Iraq and Iran. He was one of the first Western broadcast journalists to report from Kurdish refugee camps in Northern Iraq and Southern Turkey. Hockenberry also spent two years (1988-90) as a correspondent based in Jerusalem during the most intensive conflict of the Palestinian uprising. Hockenberry received the Columbia Dupont Award for Foreign News Coverage for reporting on the Gulf War.<\/p><div><p>&nbsp;<\/p><\/div>","slug":"john_hockenberry","published_at":"2012-02-06 20:47:00","updated_at":"2015-10-09 18:42:48"}}