{"speaker":{"id":124,"title":"","firstname":"Alan","middleinitial":"","lastname":"Russell","description":"Medical futurist","whotheyare":"In the fight against disease, defect and injury, Alan Russell has a novel argument: Why not engineer new tissue and organs to replace sick ones?","whylisten":"<p>Alan Russell is a professor of surgery -- and of chemical engineering. In crossing the two fields, he is expanding our palette of treatments for disease, injury and congenital defects. We can treat symptoms, he says, or <strong>we can replace our damaged parts with bioengineered tissue<\/strong>. As he puts it:  &quot;If newts can regenerate a lost limb, why can&#39;t we?&quot;  <\/p><p>The founding director of the <a href=\"http:\/\/www.mirm.pitt.edu\/\" target=\"_blank\">McGowan Institute for Regenerative Medicine<\/a>, at the University of Pittsburgh, Russell leads an ambitious biomedicine program that explores tissue engineering, stem cell research, biosurgery and artificial and biohybrid organs. They&#39;ve also started testing a new kind of <a href=\"http:\/\/www.mcgowan.pitt.edu\/news\/article.asp?qEmpID=178\" target=\"_blank\">heart pump<\/a>, figured out that <strong>Botox can help with enlarged <a href=\"http:\/\/www.mirm.pitt.edu\/news\/article.asp?qEmpID=177\" target=\"_blank\">prostate<\/a><\/strong>, and identified human adipose cells  as having the possibility to <a href=\"http:\/\/www.mirm.pitt.edu\/news\/article.asp?qEmpID=169\" target=\"_blank\">repair skeletal muscle<\/a>. In his own <a href=\"http:\/\/www.mirm.pitt.edu\/russell\/projects.asp\" target=\"_blank\">Russell Lab<\/a>, his team has studied antimicrobial surfaces and helping to develop a therapy to <strong>reduce scarring on muscle after injury<\/strong>. Lately, his lab is involved in biotechnology studies in relation to chemical and biological weapons defense.&nbsp;<\/p><p>He&#39;s also co-founder of <a href=\"http:\/\/www.agentase.com\/\" target=\"_blank\">Agentase<\/a>, a company that makes an enzyme-based detector for chemical warfare agents. <\/p>","slug":"alan_russell","published_at":"2007-07-04 08:07:00","updated_at":"2017-04-14 18:30:52"}}