{"speaker":{"id":128,"title":"","firstname":"Will","middleinitial":"","lastname":"Wright","description":"Game designer","whotheyare":"Will Wright invented a genre of computer game that involves neither winning nor shooting, yet has generated colossal hits. Among them: SimCity (which earned its publisher $230 million), The Sims, and Spore.","whylisten":"<p>A technical virtuoso with boundless imagination, Will Wright has created a style of computer gaming unlike any that came before, emphasizing learning more than losing, invention more than sport. With his hit game <a href=\"http:\/\/simcity.ea.com\/\" target=\"_blank\">SimCity<\/a>, <strong>he spurred players to make predictions, take risks, and sometimes fail miserably<\/strong>, as they built their own virtual urban worlds. With his follow-up hit, <a href=\"http:\/\/thesims.ea.com\/\" target=\"_blank\">The Sims<\/a>, he encouraged the same creativity toward building a household, all the while preserving the addictive fun of ordinary video games. His next game, <a href=\"http:\/\/www.spore.com\/\" target=\"_blank\">Spore<\/a>, which he previewed at TED2007, evolves an entire universe from a single-celled creature.<\/p><p>Wright&#39;s genius is for presenting vital abstract principles -- like evolution, differences of scale, and environmental dynamics -- through a <strong>highly personalized, humorous kind of play<\/strong>. Users invest themselves passionately in characters they create (with Wright&#39;s mind-boggling CG tools), and then watch them encounter fundamentals of life and nature. If it all sounds suspiciously educational, well, it just might be. Wright has created not just an irresistible form of entertainment, but an ingenious, original pedagogy.<\/p><p>In 2009, he left publisher Electronic Arts to form his own think tank for the future of games, toys and entertainment, the <a href=\"http:\/\/www.thestupidfunclub.com\/home.html\" target=\"_blank\">Stupid Fun Club<\/a>. <\/p>","slug":"will_wright","published_at":"2007-07-10 12:39:00","updated_at":"2011-06-10 21:01:07"}}