{"speaker":{"id":132,"title":"","firstname":"Andrew","middleinitial":"","lastname":"Mwenda","description":"Journalist","whotheyare":"Journalist Andrew Mwenda has spent his career fighting for free speech and economic empowerment throughout Africa. He argues that aid makes objects of the poor -- they become passive recipients of charity rather than active participants in their own economic betterment.","whylisten":"<p>Andrew Mwenda is a print, radio and television journalist, and <strong>an active critic of many forms of Western aid to Africa<\/strong>. Too much of the aid from rich nations, he says, goes to the worst African countries to fuel war and government abuse. Such money not only never gets to its intended recipients, Africa&#39;s truly needy -- it actively plays a part in making their lives worse.<br \/><br \/>Mwenda worked at the <a href=\"http:\/\/www.monitor.co.ug\/\" target=\"_blank\"><em>Daily Monitor<\/em><\/a>  newspaper in Kampala starting in the mid-1990s, and hosted a radio show, <em>Andrew Mwenda Live<\/em>, since 2001; in 2005, <strong>he was <a href=\"http:\/\/www.rsf.org\/article.php3?id_article=14741\" target=\"_blank\">charged with sedition<\/a>  by the Ugandan government for criticizing the president of Uganda on his radio show<\/strong>, in the wake of the helicopter crash that killed the vice president of Sudan. He has produced documentaries and commentary for the BBC on the dangers of aid and debt relief to Africa, and consulted for the World Bank and Transparency international, and was a Knight Fellow at Stanford in 2007. <\/p><p>In December 2007, he launched a new newspaper in Kampala, <em>The Independent<\/em>, a leading source of uncensored news in the country. The following spring, he was arrested and accused of publishing inflammatory articles about the Ugandan government. Since being released, he has gone on to be recognized by the World Economic Forum as a Young Global Leader and to win the CPJ International Press Freedom Award. &nbsp;&nbsp;&nbsp; <br \/><\/p>","slug":"andrew_mwenda","published_at":"2007-07-30 09:39:00","updated_at":"2013-09-06 21:20:45"}}