{"speaker":{"id":1323,"title":"","firstname":"Keith","middleinitial":"","lastname":"Chen","description":"Behavioral economist","whotheyare":"Keith Chen's research suggests that the language you speak may impact the way you think about your future.","whylisten":"<p>Does the future look like a different world to you, or more like an extension of the present? In an intriguing piece of research, Keith Chen suggests that your attitude about the future has a strong relationship to the language you speak. In a nutshell, some languages refer to the future using verb helpers like &quot;will&quot; and &quot;shall,&quot; while others don&#39;t have specific verbs to refer to future actions. Chen correlated these two different language types with remarkably different rates of saving for the future (guess who saves more?). He calls this connection the &quot;futurity&quot; of languages.&nbsp;<a href=\"https:\/\/www.anderson.ucla.edu\/faculty_pages\/keith.chen\/papers\/Final_AER13.pdf\" target=\"_blank\">The paper<\/a>&nbsp;is published in the <em>American Economic Review<\/em>, and has spurred a slew of research investigating this unexpected connection between language structure and basic economic behavior. Chen says: &quot;While the data I analyze don&rsquo;t allow me to completely understand what role language plays in these relationships, they suggest that there is something really remarkable to be explained about the interaction of language and economic decision-making. These correlations are so strong and survive such an aggressive set of controls, that the chances they arise by random lies somewhere between one in 10,000 and one in 10^32.&quot;<\/p>   <p>Chen excels in asking unusual questions to yield original results. Another work (with Yale colleague and TEDGlobal 2009 speaker&nbsp;<a href=\"http:\/\/faculty.som.yale.edu\/keithchen\/papers\/Final_JESP11.pdf\" target=\"_blank\">Laurie Santos<\/a>) examined how monkeys view economic risk--with surprisingly humanlike irrationality. While a working paper asks a surprising, if rhetorical, question: Does it make economic sense for a woman to become a physician?<\/p><p>&quot;Chen was formerly Uber&#39;s Head of Economic Research and is a professor of economics at&nbsp;<a href=\"http:\/\/www.anderson.ucla.edu\/faculty\/keith.chen\/\" target=\"_blank\">UCLA<\/a>.<\/p><p><a href=\"http:\/\/blog.ted.com\/2013\/02\/19\/saving-for-a-rainy-day-keith-chen-on-language-that-forecasts-weather-and-behavior\/\" target=\"_blank\">Read more about Chen&#39;s explorations &raquo;<\/a><\/p>","slug":"keith_chen","published_at":"2012-05-01 14:09:00","updated_at":"2021-08-04 15:33:16"}}