{"speaker":{"id":1324,"title":"","firstname":"John","middleinitial":"","lastname":"Wilbanks","description":"Data Commons Advocate","whotheyare":"Imagine the discoveries that could result from a giant pool of freely available health and genomic data. John Wilbanks is working to build it.","whylisten":"<p>Performing a medical or genomic experiment on a human requires informed consent and careful boundaries around privacy. But what if the data that results, once scrubbed of identifying marks, was released into the wild? At&nbsp;<a href=\"http:\/\/weconsent.us\/about\" target=\"_blank\">WeConsent.us<\/a>, John Wilbanks thinks through the ethical and procedural steps to create an open, massive, mine-able database of  data about health and genomics from many sources. One step: the Portable Legal Consent for Common Genomics Research (PLC-CGR), an experimental bioethics protocol that would allow any test subject to say, &quot;Yes, once this experiment is over, you can use my data, anonymously, to answer any other questions you can think of.&quot;&nbsp;Compiling piles of test results in one place, Wilbanks suggests, would turn genetic info into big data--giving researchers the potential to spot patterns that simply aren&#39;t viewable up close.&nbsp;<\/p><p>A campaigner for the wide adoption of data sharing in science, Wilbanks is also a Senior Fellow with the&nbsp;<a href=\"http:\/\/www.kauffman.org\/KauffmanMultimedia.aspx?VideoId=1804003748&amp;type=R\" target=\"_blank\">Kauffman Foundation<\/a>, a Research Fellow at&nbsp;<a href=\"http:\/\/www.lybba.org\/\" target=\"_blank\">Lybba<\/a>&nbsp;and supported by&nbsp;<a href=\"http:\/\/sagebase.org\/\" target=\"_blank\">Sage Bionetworks<\/a>.&nbsp;<\/p><p>In <a href=\"http:\/\/del-fi.org\/post\/43735198788\/white-house-public-access-policy-is-out\" target=\"_blank\">February 2013<\/a>, the US government responded to a <a href=\"https:\/\/petitions.whitehouse.gov\/petition\/require-free-access-over-internet-scientific-journal-articles-arising-taxpayer-funded-research\/wDX82FLQ\" target=\"_blank\">We the People petition<\/a>  spearheaded by Wilbanks and signed by 65,000 people, and announced a plan to open up taxpayer-funded research data and make it available for free. <\/p>","slug":"john_wilbanks","published_at":"2012-05-01 14:46:00","updated_at":"2013-02-22 19:21:46"}}