{"speaker":{"id":1325,"title":"","firstname":"Margaret","middleinitial":"","lastname":"Heffernan","description":"Writer, entrepreneur","whotheyare":"The former CEO of five businesses, Margaret Heffernan explores the all-too-human thought patterns that lead organizations and managers astray.","whylisten":"<p>Margaret Heffernan was born in Texas, grew up in the Netherlands and was educated at Cambridge University. She produced drama and documentary programs for the BBC for 13 years, then moved back to the US where she became a serial entrepreneur and CEO in the early days of the internet.<\/p><p>All of Heffernan&#39;s&nbsp;work challenges accepted wisdom about good lives and good work.&nbsp;<a href=\"https:\/\/geni.us\/qDzgL0\" target=\"_blank\"><em>Willful Blindness: Why We Ignore the Obvious at Our Peril<\/em><\/a>, named one of the most important business books of the decade by the <em>Financial Times<\/em>, looked at how our most cherished beliefs, behaviors and rules blind us to what matters most. In 2015, she was awarded the Transmission Prize for&nbsp;<a href=\"https:\/\/geni.us\/pB9xZP\" target=\"_blank\"><em>A Bigger Prize: How We Can Do Better than the Competition<\/em><\/a>, a book that upended the idea that competition forces the best to the top, arguing that it mostly proves wasteful and destructive where collaboration is more sustainable and creative. In 2015, TED published&nbsp;<a href=\"https:\/\/geni.us\/8QfvRT\" target=\"_blank\"><em>Beyond Measure: The Big Impact of Small Changes<\/em><\/a>&nbsp;which argued that organizational change can, and should, happen at all levels. Her forthcoming book, <em>Uncharted: How to Map the Future<\/em> will be published in February 2020 in the UK and May 2020 in the US. It addresses the fundamental unpredictability of life, challenges technological determinism and asks how we can find in ourselves the freedom and imagination to create the futures we want. An early reader called it &quot;Karl Popper for the 21st century.&quot;<\/p><p>As lead faculty for the Forward Institute&#39;s Responsible Leadership Programme, Heffernan mentors CEOs and senior executives of major global organizations.<\/p>      ","slug":"margaret_heffernan","published_at":"2012-05-01 15:24:00","updated_at":"2019-08-01 14:51:09"}}