{"speaker":{"id":1328,"title":"","firstname":"Ramesh","middleinitial":"","lastname":"Raskar","description":"Femto-photographer","whotheyare":"Photography is about creating images by recording light. At the MIT media lab, professor Ramesh Raskar and his team members have invented a camera that can photograph light itself as it moves at, well, the speed of light.","whylisten":"<p>In 1964 MIT professor Harold Edgerton, pioneer of stop-action photography, famously took a photo of a bullet piercing an apple using exposures as short as a few nanoseconds. Inspired by his work, Ramesh Raskar and his team set out to create a camera that could capture not just a bullet (traveling at 850 meters per second) but light itself (nearly 300 million meters per second).<\/p>  <p>Stop a moment to take that in: photographing light as it moves. For that, they built a camera and software that can visualize pictures as if they are recorded at 1 trillion frames per second. The same photon-imaging technology can also be used to create <a href=\"http:\/\/cornar.info\" target=\"_blank\">a camera that can peer &quot;around&quot; corners<\/a> , by exploiting specific properties of the photons when they bounce off surfaces and objects.<\/p>  <p>Among the other projects that Raskar is leading, with the MIT Media Lab&#39;s&nbsp;<a href=\"http:\/\/cameraculture.media.mit.edu\" target=\"_blank\">Camera Culture<\/a>&nbsp;research group, are low-cost eye care devices, a next generation CAT-Scan machine and human-computer interaction systems.<\/p><p>Papers:&nbsp;<\/p><p>Andreas Velten, Thomas Willwacher, Otkrist Gupta, Ashok Veeraraghavan, Moungi G. Bawendi and Ramesh Raskar, &ldquo;Recovering ThreeDimensional Shape around a Corner using Ultra-Fast Time-of-Flight Imaging.&rdquo;&nbsp;<a href=\"http:\/\/dx.doi.org\/10.1038\/ncomms1747\" target=\"_blank\">Nature Communications, March 2012<\/a><\/p><p>Andreas Velten, Adrian Jarabo, Belen Masia, Di Wu, Christopher Barsi,&nbsp;Everett Lawson, Chinmaya Joshi, Diego Gutierrez, Moungi G. Bawendi and Ramesh Raskar, &quot;Ultra-fast Imaging for Light in Motion&quot; (in progress).&nbsp;<a href=\"http:\/\/femtocamera.info\" target=\"_blank\">http:\/\/femtocamera.info<\/a> <\/p>","slug":"ramesh_raskar","published_at":"2012-05-01 20:34:00","updated_at":"2012-08-03 03:17:46"}}