{"speaker":{"id":135,"title":"","firstname":"William","middleinitial":"","lastname":"Kamkwamba","description":"Inventor","whotheyare":"To power his family's home, young William Kamkwamba built an electricity-producing windmill from spare parts and scrap -- starting him on a journey detailed in the book and film \"The Boy Who Harnessed the Wind.\"","whylisten":"<p>William Kamkwamba, from Malawi, is a born inventor. When he was 14, he built an electricity-producing windmill from spare parts and scrap, working from rough plans he found in a library book called <em>Using Energy<\/em> and modifying them to fit his needs. The windmill he built powers four lights and two radios in his family home.  <\/p><p>After reading about Kamkwamba on Mike McKay&#39;s blog <a href=\"http:\/\/www.vdomck.org\/2006\/11\/23\/malawian-windmill\/\" target=\"_blank\">Hactivate<\/a>   (which picked up the story from a local Malawi newspaper), TEDGlobal Conference Director Emeka Okafor spent several weeks tracking him down at his home in Masitala Village, Wimbe, and invited him to attend TEDGlobal on a fellowship. Onstage, Kamkwamba <a href=\"\/talks\/william_kamkwamba_on_building_a_windmill.html\" target=\"_blank\">talked about his invention<\/a> and shared his dreams: to build a larger windmill to help with irrigation for his entire village, and to go back to school.  <\/p><p>Following Kamkwamba&#39;s moving talk, there was an <a href=\"http:\/\/www.ethanzuckerman.com\/blog\/?p=1490\" target=\"_blank\">outpouring of support<\/a>  for him and his promising work. Members of the TED community got together to help him improve his power system (by incorporating solar energy), and further his education through school and mentorships. Subsequent projects have included clean water, malaria prevention, solar power and lighting for the six homes in his family compound; a deep-water well with a solar-powered pump for clean water; and a drip irrigation system. Kamkwamba himself returned to school, and is now attending the African Leadership Academy, a new pan-African prep school outside  Johannesburg, South Africa.<\/p><p>Kamkwamba&#39;s story is documented in his autobiography,  <em><a href=\"http:\/\/geni.us\/boywhoharnessedwind\" target=\"_blank\">The Boy Who Harnessed the Wind: Creating Currents of Electricity and Hope<\/a><em>.<\/em> <\/em>A&nbsp; documentary about Kamkwamba, called <a href=\"http:\/\/movingwindmills.org\/documentary\" target=\"_blank\"><em>William and the <\/em><\/a><a href=\"http:\/\/www.youtube.com\/watch?v=arD374MFk4w\" target=\"_blank\"><em>Windmill<\/em><\/a>, won the Documentary Feature Grand Jury award at SXSW in 2013 (<a href=\"http:\/\/www.youtube.com\/watch?v=arD374MFk4w\" target=\"_blank\">watch a trailer<\/a> ). You can support his work and other young inventors at <a href=\"http:\/\/www.movingwindmills.org\" target=\"_blank\">MovingWindmills.org<\/a>.<\/p><div style=\"margin: 0px\"><em><br \/><\/em><\/div>","slug":"william_kamkwamba","published_at":"2007-07-30 09:41:00","updated_at":"2015-07-09 20:28:27"}}