{"speaker":{"id":136,"title":"","firstname":"Vusi","middleinitial":"","lastname":"Mahlasela","description":"Musician, activist","whotheyare":"South African singer-songwriter Vusi Mahlasela was a crucial artistic voice during the fight against apartheid, and now in the new modern-day nation. Blending traditional African music with soul and blues, his music showcases powerful vocals and poetic lyrics.","whylisten":"<p><a href=\"http:\/\/www.vusimahlasela.com\/\" target=\"_blank\">Vusi Mahlasela<\/a>  has dedicated his life to using music and words to inspire change. As a young boy in South Africa, he was routinely watched by the police because of his anti-apartheid poetry and his open support of student protest. During the final fight against apartheid, <strong>his songs of protest and solidarity became anthems<\/strong> -- stirring the South African people to create their new nation.<\/p><p>His lyrics touch on themes of love, family, hope and pride. Working with his own band and an international crew of genre-bending musicians, including Ladysmith Black Mambazo and fellow South African Dave Matthews, Mahlasela crafts <strong>a rich, propulsive sound that helps his words reach directly into the heart.<\/strong><\/p><p>His latest album is <em><a href=\"http:\/\/www.amazon.com\/Guiding-Star-Vusi-Mahlasela\/dp\/B000MMLPA0\/ref=sr_1_1\/102-4083808-0333713?ie=UTF8&amp;s=music&amp;qid=1187195959&amp;sr=1-1\" target=\"_blank\">Guiding Star<\/a> <\/em>(2007), of which <em>Dirty Linen<\/em> magazine says: <\/p><p>&quot;Contributions by Dave Matthews, Australian didjeridu player Xavier Rudd, Welsh singer\/songwriter Jem, and slide guitarist Derek Trucks transforms <em>Guiding Star<\/em> into an Earth-spanning celebration, but they only enhance Mahlasela&#39;s Garfunkel-meets-Marley vocals, harp-like guitar fingerpicking, and mastery of his homeland&#39;s diverse musical traditions.&quot;<\/p>","slug":"vusi_mahlasela","published_at":"2007-07-30 09:41:00","updated_at":"2016-09-26 15:40:04"}}