{"speaker":{"id":1388,"title":"","firstname":"Gabriel","middleinitial":"","lastname":"Barcia-Colombo","description":"Video sculptor","whotheyare":"Gabe Barcia-Colombo creates madcap art inspired both by Renaissance era curiosity cabinets and the modern-day digital chronicling of everyday life. Think: miniature people projected in objects and a DNA Vending Machine.","whylisten":"<p>Gabe Barcia-Colombo is an American artist who creates installation pieces that both delight and point to the strangeness of our modern, digital world. His latest work is a DNA Vending Machine, which dispenses vials of DNA extracted from friends at dinner parties. He&#39;s also created video installations of &quot;miniature people&quot; encased inside ordinary objects like suitcases,  blenders and more. His work comments on the act of leaving one&#39;s imprint for the next generation.  Call it &quot;artwork with consequences.&quot;<\/p><p>As he explains it: &quot;While formally implemented by natural history museums and collections  (which find their roots in Renaissance-era &#39;cabinets of curiosity&#39;),  this process has grown more pointed and pervasive in the modern-day  obsession with personal digital archiving and the corresponding growth  of social media culture. My video sculptures play upon this exigency in  our culture to chronicle, preserve and wax nostalgic, an idea which I  render visually by &#39;collecting&#39; human beings (alongside cultural  archetypes) as scientific specimens. I repurpose everyday objects like blenders, suitcases and cans of Spam  into venues for projecting and inserting videos of people.&quot; <\/p><p>Barcia-Colombo is an alumnus and instructor at NYU&#39;s <a href=\"http:\/\/itp.nyu.edu\/itp\/\" target=\"_blank\">Interactive Telecommunications Program<\/a>. Read about his latest work on <a href=\"http:\/\/www.coolhunting.com\/design\/tube-gabriel-barcia-colombo.php\" target=\"_blank\">CoolHunting<\/a> and in his <a href=\"http:\/\/fellows.ted.com\/profiles\/gabe-barcia-colombo\" target=\"_blank\">TED Fellows profile<\/a>.<\/p>","slug":"gabriel_barcia_colombo","published_at":"2012-07-15 15:09:00","updated_at":"2014-03-06 15:59:22"}}