{"speaker":{"id":142,"title":"","firstname":"Ron","middleinitial":"","lastname":"Eglash","description":"Mathematician","whotheyare":"Ron Eglash is an ethno-mathematician: he studies the way math and cultures intersect. He has shown that many aspects of African design -- in architecture, art, even hair braiding -- are based on perfect fractal patterns.","whylisten":"<p>&quot;Ethno-mathematician&quot; Ron Eglash is the author of <em><a href=\"http:\/\/geni.us\/africanfractals\" target=\"_blank\">African Fractals<\/a>,<\/em> a book that examines the fractal patterns underpinning architecture, art and design in many parts of Africa. By looking at aerial-view photos -- and then following up with detailed research on the ground -- Eglash discovered that <strong>many African villages are purposely laid out to form perfect fractals<\/strong>, with self-similar shapes repeated in the rooms of the house, and the house itself, and the clusters of houses in the village, in mathematically predictable patterns. <br \/><br \/>As he puts it: &quot;When Europeans first came to Africa, they considered the architecture very disorganized and thus primitive. It never occurred to them that the <strong>Africans might have been using a form of mathematics that they hadn&#39;t even discovered yet<\/strong>.&quot; <br \/><br \/>His other areas of study are equally fascinating, including research into African and Native American cybernetics, teaching kids math through <a href=\"http:\/\/www.ccd.rpi.edu\/Eglash\/csdt\/index.html\" target=\"_blank\">culturally specific design tools<\/a> (such as the <a href=\"http:\/\/www.ccd.rpi.edu\/Eglash\/csdt\/subcult\/brdance\/index.html\" target=\"_blank\">Virtual Breakdancer<\/a>  applet, which explores rotation and sine functions), and <strong>race and ethnicity issues in science and technology<\/strong>. Eglash teaches in the Department of Science and Technology Studies at Rensselaer Polytechnic Institute in New York, and he recently co-edited the book <em><a href=\"http:\/\/geni.us\/appropriatingtech\" target=\"_blank\">Appropriating Technology<\/a><\/em>, about how we reinvent consumer tech for our own uses. <\/p><p>&nbsp;<\/p>","slug":"ron_eglash","published_at":"2007-08-02 15:03:00","updated_at":"2015-07-10 20:01:22"}}