{"speaker":{"id":1428,"title":"","firstname":"Matt","middleinitial":"","lastname":"Killingsworth","description":"Happiness researcher","whotheyare":"Researcher Matt Killingsworth designs studies that gather data on happiness. One takeaway? \"A Wandering Mind Is an Unhappy Mind.\"","whylisten":"<p>While doing his PhD research with Dan Gilbert at Harvard,  Matt Killingsworth invented a nifty tool for investigating happiness: an iPhone app called <a href=\"http:\/\/www.trackyourhappiness.org\/\" target=\"_blank\">Track Your Happiness<\/a> that captured feelings in real time. (Basically, it pings you at random times and asks: How are you feeling right now, and what are you doing?) Data captured from the study became the landmark paper &quot;A Wandering Mind Is an Unhappy Mind&quot; (<a href=\"http:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;ved=0CCYQFjAA&amp;url=http%3A%2F%2Fwww.wjh.harvard.edu%2F~dtg%2FKILLINGSWORTH%2520%26%2520GILBERT%2520%282010%29.pdf&amp;ei=weGXUNniLYWX0QGQvIDYAg&amp;usg=AFQjCNEUqwQWMPQu6h9fZCM9tjuR7-50OA\" target=\"_blank\">PDF<\/a>).&nbsp;<\/p><p>As an undergrad, Killingsworth studied economics and engineering, and worked for a few years as a software product manager -- an experience during which, he says, &quot;I began to question my assumptions about what defined success for an individual, an organization, or a society.&quot; He&#39;s now a <a href=\"http:\/\/www.healthandsocietyscholars.org\/1822\/16821\/284347\" target=\"_blank\">Robert Wood Johnson Health and Society Scholar<\/a> examining such topics as &quot;<font class=\"AWC-1352\">the relationship between happiness and the  content of everyday experiences, the percentage of everyday experiences  that are intrinsically valuable, and the degree of congruence between  the causes of momentary happiness and of one&rsquo;s overall satisfaction with  life<\/font>.&quot;<\/p>","slug":"matt_killingsworth","published_at":"2012-11-05 16:01:00","updated_at":"2012-11-05 16:08:35"}}