{"speaker":{"id":143,"title":"","firstname":"Erin","middleinitial":"","lastname":"McKean","description":"Dictionary editor","whotheyare":"As the co-founder of Reverb Technologies, the maker of the online dictionary Wordnik, Erin McKean is reshaping how we interact with language itself.","whylisten":"<p>Erin McKean&#39;s job as a lexicographer involves living in a constant state of research. She searches high and low -- from books to blogs, newspapers to cocktail parties -- for new words, new meanings for old words, or signs that old words have fallen out of use. In June of this year, she involved us all in the search by launching <a href=\"http:\/\/www.wordnik.com\/\">Wordnik<\/a>, an online dictionary that houses all the traditionally accepted words and definitions, but also asks users to contribute new words and new uses for old words. Wordnik pulls real-time examples of word usage from Twitter, image representations from Flickr along with many more non-traditional, and highly useful, features.&nbsp; <\/p><p>Before Wordnik, McKean was one of the youngest editors of the <a href=\"http:\/\/www.oed.com\/\" target=\"_blank\"><em>New Oxford American Dictionary<\/em><\/a>. She continues to serve as the editor of the language quarterly&nbsp; <a href=\"http:\/\/www.verbatimmag.com\/\" target=\"_blank\"><em>Verbatim<\/em><\/a> (&quot;language and linguistics for the layperson since 1974&quot;) and is the author of multiple books, including&nbsp;<a href=\"http:\/\/geni.us\/thatsamore\" target=\"_blank\"><em>That&#39;s Amore<\/em><\/a>&nbsp;and the entire&nbsp;<a href=\"http:\/\/geni.us\/weirdwonderful\" target=\"_blank\"><em>Weird and Wonderful Words<\/em><\/a>&nbsp;series. All that, and she maintains multiple blogs, too: McKean is the keen observationalist behind<a href=\"http:\/\/www.dressaday.com\/dressaday.html\" target=\"_blank\"> A Dress a Day<\/a>  and <a href=\"http:\/\/www.dictionaryevangelist.com\/\" target=\"_blank\">Dictionary Evangelist<\/a>. Is there anything she can&#39;t do? Surprisingly, she is notoriously bad at Scrabble. &nbsp; <\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>","slug":"erin_mckean","published_at":"2007-08-02 15:03:00","updated_at":"2016-04-16 18:36:06"}}