{"speaker":{"id":1439,"title":"","firstname":"","middleinitial":"","lastname":"Sleepy Man Banjo Boys","description":"Bluegrass musicians","whotheyare":"The Sleepy Man Banjo Boys is made up of 11-year-old banjo sensation Jonny Mizzone and his brothers Robbie, 14, on fiddle, and Tommy, 15, on guitar.","whylisten":"<p>These days your kid can get famous on YouTube for having water sprayed at him, for being duped about his Halloween candy, and for being high off laughing gas. But what if your 8-year-old gets famous on the Internet for being an absolute <em>genius<\/em> on the banjo? So goes the story of Jonny Mizzone, who first became a YouTube sensation in early 2011 for videos of <a href=\"http:\/\/www.youtube.com\/watch?v=I3qbB4Kq3Y0&amp;feature=plcp\" target=\"_blank\">him and his brothers tearing it up playing Earl Scruggs&#39;s <em>Flint Hill Special<\/em><\/a>. It wasn&#39;t long before the press started calling.<\/p>  <p>Now Jonny, Robbie (fiddle) and Tommy (guitar), known as the Sleepy Man Banjo Boys, are 11, 14 and 15 respectively. In 2011 alone they got calls from <em>The Ellen&nbsp;DeGeneres Show<\/em>, <em>Jimmy Kimmel Live<\/em> and <em>The Tonight Show with Jay  Leno<\/em>, and in the summer of 2011 they appeared as musical guests on  <em>The Late Show with David Letterman<\/em> and NBC&rsquo;s <em>Today Show<\/em>.<\/p> <p>While the trio grew up in New Jersey -- which is known more for rock music than for bluegrass -- they fell in love with the unique sounds of J.D. Crowe, Ralph Stanley, Clarence White and Earl Scruggs after some creative YouTube searching. Now, having become sensations on the platform themselves, the trio has accumulated more than 17 million video views. Their first album,&nbsp;<em>America&rsquo;s Music,<\/em> was released in September 2011 and charted top eight on the Billboard Bluegrass Album Chart. In October 2012 they released their second album,&nbsp;<em>The Farthest Horizon<\/em>, which cracked the top three. The group is already at work on their next album.<\/p>   ","slug":"sleepy_man_banjo_boys","published_at":"2012-11-20 21:18:00","updated_at":"2014-01-22 00:47:18"}}