{"speaker":{"id":1442,"title":"","firstname":"Janine","middleinitial":"","lastname":"Shepherd","description":"Pilot","whotheyare":"Aspiring Olympic skier Janine Shepherd was nearly killed when she was hit by a truck during a training bike ride. Paralysed and immobile for six months, she was given a grim picture for recovery. But not only did she teach herself to walk again— she learned to fly.","whylisten":"<p>Janine Shepherd is a &ldquo;walking paraplegic.&rdquo; Defying her disability, she has become a commercial pilot and aerobatics instructor, motivational speaker, best-selling author, and mother of three. A champion cross-country skier in training for the Calgary Olympics, Janine&rsquo;s life changed forever when she was hit by a truck during a bicycle ride in the Blue Mountains of Australia. Doctors did not expect her to survive.<\/p><p> After six months in hospital&mdash;nearly all of it on her back&mdash;Janine focused intently on healing both her broken body and crushed morale. A turning point in her recovery came when a small plane flying overhead gave her the most improbable idea.   &ldquo;That&rsquo;s it!&rdquo; she exclaimed from her wheelchair.  &ldquo;If I can&rsquo;t walk, I&rsquo;ll fly.&rdquo; <\/p><p> Still encased in a full body cast, Janine had to be lifted into an aircraft for her introductory flight lesson. But within a year she had defied the odds and earned her private pilot&rsquo;s license. Her talent and skill as a pilot earned Janine a commercial pilot license and ultimately, her flying instructor&rsquo;s rating.  Then she decided to learn to fly upside down, and finally, to teach acrobatic flight to other pilots.<\/p><p> Janine is an ambassador for Spinal Cure Australia and Red Bull Wings For Life, and is committed to helping find a cure for spinal cord injury in the near future. She was awarded the Order of Australia, the nation&rsquo;s highest honor. She is a contributor to Deepak Chopra&rsquo;s workshops, and has been featured on <em>60 Minutes<\/em> and <em>This Is Your Life.<\/em> <\/p><p> In the meantime, she seeks to inspire those coping with physical disability and life challenges. Janine is the author of six books, including the newly released memoir <a href=\"https:\/\/www.amazon.com\/gp\/product\/1622037103\/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;tag=teco06-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=1622037103&amp;linkId=cfe4651f72f79b4633d63c507d0fc52b\" target=\"_blank\"><em>Defiant: A Broken Body Is Not a Broken Person<\/em><\/a>. She regularly delivers inspirational keynotes to audiences of thousands in countries around the world.<\/p><p>&nbsp;<\/p>","slug":"janine_shepherd","published_at":"2012-11-28 15:19:00","updated_at":"2017-06-01 16:12:32"}}