{"speaker":{"id":1446,"title":"","firstname":"Jeff","middleinitial":"","lastname":"Smith","description":"Recovering politician","whotheyare":"Once an up-and-coming star in the Missouri State Senate, Jeff Smith went to prison for covering up an election law violation. Since his release, he's created a new space for himself as a professor, writer, political commentator and advocate for those he was locked up with. ","whylisten":"<p class=\"MsoNormal\">In 2004, Jeff Smith ran for the U.S. Congressional seat vacated by Dick Gephardt, and came this close to defeating Republican Russ Carnahan. His inspiring, but ultimately unsuccessful, campaign was documented in the award-winning documentary,&nbsp;<a href=\"http:\/\/www.pbs.org\/independentlens\/mrsmith\/film.html\" target=\"_blank\"><em>Can Mr. Smith Get to Washington Anymore<\/em>?<\/a>.&nbsp;<\/p>  <p class=\"MsoNormal\">A year later, Smith ran for the Missouri State Senate&nbsp;and won in a hotly contested election. He quickly became a rising star in the legislative body, focusing on education reform and tax credits among other things. However, in 2009, the FBI opened a criminal investigation into whether Smith had lied about a violation in his 2004 campaign. He ultimately plead guilty and spent a year in jail. It&rsquo;s a story he has told on&nbsp;<a href=\"http:\/\/www.thisamericanlife.org\/radio-archives\/episode\/463\/transcript\" target=\"_blank\"><em>This American Life<\/em><\/a>.&nbsp;<\/p>  <p class=\"MsoNormal\">Since being released from prison, Smith accepted a position as an assistant professor at The New School&#39;s Milano Graduate School of Management and Urban Policy in New York City.&nbsp;His research focuses on political campaigns, the role of race in urban politics and the legislative process. At the same time, he writes for <em>The Recovering Politician<\/em>, <em>City &amp; State NY<\/em> and&nbsp;<em>Politico&#39;s The Arena<\/em>, and is working on an memoir.&nbsp;<\/p>","slug":"jeff_smith","published_at":"2012-12-05 15:26:00","updated_at":"2012-12-05 15:33:03"}}