{"speaker":{"id":1452,"title":"","firstname":"Adam","middleinitial":"","lastname":"Davidson","description":"Journalist","whotheyare":"Adam Davidson is the co-host and co-creator of \"Planet Money,\" a weekly podcast and radio feature about the economy.","whylisten":"<p>Adam Davidson is co-founder and co-host of <em>Planet Money<\/em>, a co-production of NPR and <em>This American Life.<\/em> He also writes the weekly &quot;It&#39;s the Economy&quot; column for the <em>New York Times Magazine.<\/em>  In two weekly podcasts, a blog, and regular features on <em>Morning Edition, All Things Considered<\/em> and <em>This American Life, Planet Money<\/em>  helps listeners understand how dramatic economic change is impacting  their lives. Planet Money also proves, every day, that substantive,  intelligent economic reporting can be funny, engaging, and accessible to  the non-expert.<br \/><br \/>His radio documentary on the housing crisis, &quot;The Giant Pool of Money,&quot; which he co-reported and produced with Alex Blumberg, was named one of the top ten works of journalism of the decade by the Arthur L. Carter Journalism Institute at New York University. It was widely recognized as the clearest and most entertaining explanation of the roots of the financial crisis in any media. Davidson and Blumberg took the lessons they learned crafting &quot;The Giant Pool of Money&quot; to create <em>Planet Money.<\/em><br \/><br \/>Before <em>Planet Money,<\/em> Davidson was International Business and Economics Correspondent for NPR. He traveled around the world to cover the global economy and pitched in during crises, such as reporting from Indonesia&#39;s Banda Aceh just after the tsunami, New Orleans post-Katrina, and Paris during the youth riots. Prior to coming to NPR, Davidson was Middle East correspondent for PRI&#39;s Marketplace. He spent a year in Baghdad, Iraq, from 2003 to 2004, producing award-winning reports on corruption in the US occupation.<\/p>","slug":"adam_davidson","published_at":"2012-12-20 14:41:00","updated_at":"2012-12-20 16:08:29"}}