{"speaker":{"id":1459,"title":"","firstname":"Rose","middleinitial":"","lastname":"George","description":"Curious journalist","whotheyare":"Rose George looks deeply into topics that are unseen but fundamental, whether that's sewers or latrines or massive container ships or pirate hostages or menstrual hygiene.","whylisten":"<p>Rose George thinks, researches, writes and talks about the hidden, the undiscussed. Among the everyone-does-it-no-one-talks-about-it issues she&#39;s explored in books and articles: sanitation (and poop in general). Diarrhea is a weapon of mass destruction, says the UK-based journalist and author, and a lack of access to toilets is at the root of our biggest public health crisis. In 2012, two out of five of the world&rsquo;s population had nowhere sanitary to go.<\/p><p class=\"MsoNormal\">The key to turning around this problem, says George: Let&rsquo;s drop the pretense of &ldquo;water-related diseases&rdquo; and call out the cause of myriad afflictions around the world as what they are -- &ldquo;poop-related diseases&rdquo; that are preventable with a basic toilet. George explores the problem in her book <a href=\"http:\/\/geni.us\/bignecessity\" target=\"_blank\"><em>The Big Necessity: The Unmentionable World of Human Waste and Why It Matters<\/em><\/a>  and in a fabulous special issue of <em>Colors<\/em> magazine called &quot;<a href=\"http:\/\/www.colorsmagazine.com\/magazine\/82\" target=\"_blank\">Shit: A Survival Guide<\/a>.&quot; Read a sample <a href=\"http:\/\/blog.longreads.com\/post\/a-brief-history-of-class-and-waste-in-india\/\" target=\"_blank\">chapter of <em>The Big Necessity<\/em> &gt;&gt;<\/a> <\/p><p class=\"MsoNormal\">Her latest book, on an equally hidden world that touches almost everything we do, is <em><a href=\"http:\/\/rosegeorge.com\/site\/books\/ninety-percent-of-everything\" target=\"_blank\">Ninety Percent of Everything<\/a>: Inside Shipping, the Invisible Industry That Puts Clothes on Your Back, Gas in Your Car, Food on Your Plate<\/em>. <a href=\"http:\/\/www.theguardian.com\/books\/2013\/sep\/13\/deep-sea-rose-george-review\" target=\"_blank\">Read a review &gt;&gt;&nbsp; <\/a><\/p><p class=\"MsoNormal\">&nbsp;In the UK and elsewhere, you&#39;ll find the book titled <a href=\"http:\/\/rosegeorge.com\/site\/books\/deep-sea-and-foreign-going\" target=\"_blank\"><em>Deep Sea and Foreign Going: Inside Shipping, the Invisible Industry the Brings You 90% of Everything.<\/em><\/a> <\/p>","slug":"rose_george","published_at":"2013-01-06 02:28:00","updated_at":"2017-11-30 17:50:09"}}