{"speaker":{"id":1462,"title":"","firstname":"Peter","middleinitial":"","lastname":"Singer","description":"Philosopher, ethicist","whotheyare":"Sometimes controversial, always practical ethicist Peter Singer stirs public debate about morality, from animal welfare to global poverty.","whylisten":"<p>Peter Singer may be, as <em>The New Yorker<\/em> calls him, the planet&rsquo;s &ldquo;most influential living philosopher.&rdquo; The Australian academic specializes in applied ethics, to which he takes a secular, utilitarian approach -- minimize suffering, maximize well-being. He gained recognition in the 1970s with his groundbreaking book <a href=\"http:\/\/geni.us\/animalliberation\" target=\"_blank\"><em>Animal Liberation: A New Ethics for Our Treatment of Animals<\/em><\/a>, which questions society&rsquo;s tendency to put human needs above those of members of other species. And he draws fire from critics who object to his fascinating argument in favor of an obligation to help the global poor that sets the bar so high that it means we are almost all living unethically. His defense of euthanasia and infanticide, in some circumstances, has led to protests against his lectures and to teaching position at Princeton.<\/p><p>But Singer&rsquo;s collective body of work is more acclaimed than controversial. He has written the classic text&nbsp;<a href=\"http:\/\/geni.us\/practicalethics\" target=\"_blank\"><em>Practical Ethics<\/em><\/a>&nbsp;and many other books, with more in progress. He lectures at Princeton, where he is professor of bioethics, and the University of Melbourne, where he is a laureate professor. You can find dozens of brief, brilliant essays at <a href=\"http:\/\/www.project-syndicate.org\/contributor\/peter-singer\" target=\"_blank\">Project Syndicate<\/a>, where Singer examines the philosophical questions surrounding current topics like Obamacare, computer piracy and obesity.<\/p>","slug":"peter_singer","published_at":"2013-01-06 02:46:00","updated_at":"2015-09-22 18:48:44"}}