{"speaker":{"id":1483,"title":"","firstname":"Amanda","middleinitial":"","lastname":"Palmer","description":"Musician, blogger","whotheyare":"Alt-rock icon Amanda Fucking Palmer believes we shouldn't fight the fact that digital content is freely shareable -- and suggests that artists can and should be directly supported by fans.","whylisten":"<p>Amanda Palmer commands attention. The singer-songwriter-blogger-provocateur, known for pushing boundaries in both her <a href=\"http:\/\/www.amandapalmer.net\/products\/the-grand-theft-art-companion\/\" target=\"_blank\">art<\/a>   and her <a href=\"http:\/\/www.amandapalmer.net\/news\/rockstar-video\/\" target=\"_blank\">lifestyle<\/a>, made international headlines this year when she raised nearly $1.2 million via Kickstarter (she&rsquo;d asked for $100k) from nearly 25,000 fans who pre-ordered her new album, <em><a href=\"http:\/\/www.amandapalmer.net\/products\/theatre-is-evil-digital\/\" target=\"_blank\">Theatre Is Evil<\/a>.<\/em><a href=\"http:\/\/amandapalmer.spinshop.com\/store\/amandapalmer.spinshop.com\/Digital\" target=\"_blank\"><em><br \/><\/em><\/a> &nbsp;<br \/>But the former street performer, then Dresden Dolls frontwoman, now solo artist hit a bump the week her world tour kicked off. She revealed plans to crowdsource additional local backup musicians in each tour stop, offering to pay them in hugs, merchandise and beer per her custom. Bitter and angry criticism ensued (she eventually promised to pay her local collaborators in cash). And it&#39;s interesting to consider why. As Laurie Coots suggests: &quot;The idea was heckled because we didn&#39;t understand the value exchange -- the whole idea of asking the crowd for what you need when you need it and not asking for more or less.&quot;<\/p><p>Summing up <a href=\"http:\/\/www.amandapalmer.net\/producttypes\/featured\/\" target=\"_blank\">her business model<\/a>, in which she views her recorded music as the digital equivalent of street performing, she says: &ldquo;I firmly believe in music being as free as possible. Unlocked. Shared and spread. In order for artists to survive and create, their audiences need to step up and directly support them.&rdquo;<\/p><p>Amanda&#39;s non-fiction book,&nbsp;<a href=\"http:\/\/geni.us\/artofasking\" target=\"_blank\"><em>The Art of Asking<\/em><\/a>, digs deeply into the topics she addressed in her TED Talk.&nbsp;<\/p>","slug":"amanda_palmer","published_at":"2013-01-07 03:05:00","updated_at":"2015-09-22 17:52:28"}}