{"speaker":{"id":1493,"title":"","firstname":"Martin","middleinitial":"","lastname":"Villeneuve","description":"Graphic artist, director","whotheyare":"In his film \"Mars et Avril,\" Martin Villeneuve brings his sci-fi romance graphic novel to glorious life.","whylisten":"<p>The musician who plays otherworldly music on one-of-a-kind instruments, the genius who designs the instruments inspired by a woman&#39;s body, and the photographer they both love. An old-fashioned love triangle is at the heart of <a href=\"http:\/\/facebook.com\/MarsEtAvril\" target=\"_blank\"><em>Mars et Avril<\/em><\/a>, a bold and dreamy sci-fi story set in a future Montreal where the Champ-de-Mars subway line takes you right out to Mars. While many sci-fi films have budgets exceeding $100 million, this incredible arthouse version was made for just $2 million thanks to the bold creativity of filmmaker Martin Villeneuve.&nbsp;<\/p><p>By taking his time on the project, asking the best creatives for favors and approaching problems as exciting challenges, Villeneuve has made a movie that seemed impossible. The film has shown at festivals, and is available on&nbsp;<a href=\"http:\/\/www.amazon.ca\/Mars-Avril-Jacques-Languirand\/dp\/B00AWDXCRS\" target=\"_blank\">DVD<\/a>. Villeneuve is currently working on securing international distribution for the work.<\/p><p>Villeneuve made the film based on his two graphic novels, also titled&nbsp;<a href=\"http:\/\/geni.us\/MarsetAvrilbook\" target=\"_blank\"><em>Mars et Avril<\/em><\/a><em>.<\/em> Villeneuve is the former artistic director for the ad agency Sid Lee that works with Cirque du Soleil. Among other projects, he&#39;s now working with comic book masters Beno&icirc;t Sokal and Fran&ccedil;ois Schuiten&nbsp;on an animated fantasy feature film, <a href=\"https:\/\/www.bulbapp.com\/u\/aquarica~i5297e676e4b06b04ceb364b0\" target=\"_blank\">Aquarica<\/a>, and on a sci-fi movie with Pressman Film, tentatively titled <a href=\"https:\/\/www.bulbapp.com\/u\/the-other-world-working-title\" target=\"_blank\"><em>The Other World<\/em><\/a>.<\/p>","slug":"martin_villeneuve","published_at":"2013-01-07 20:10:00","updated_at":"2015-06-19 19:59:13"}}