{"speaker":{"id":1494,"title":"","firstname":"Kees","middleinitial":"","lastname":"Moeliker","description":"Ornithologist","whotheyare":"Kees Moeliker writes and speaks about natural history, especially birds and remarkable animal behavior, as well as improbable research and science-communication-with-a-laugh.","whylisten":"<p>In Kees Moeliker&#39;s career (he&#39;s now curator of the <a href=\"http:\/\/www.hetnatuurhistorisch.nl\/nmr\/locale\/select.do?scope=ui&amp;localeid=en_GB\" target=\"_blank\">Natural History Museum Rotterdam<\/a>) he&#39;s rediscovered long-lost birds, such as the black-chinned monarch (<em>Monarcha boanensis<\/em>) on the remote Moluccan island of Boano in 1991. On the tiny West Papuan island of Boo he collected and named a new subspecies of fruit bat (<em>Macroglossus minimus booensis<\/em>).<\/p><p>Aaaaand he&#39;s the guy who observed and published the first scientifically documented case of homosexual necrophilia in ducks. For this, he was awarded the 2003 Ig Nobel biology prize, and that much-coveted award led him to appreciate that curiosity and humour can be powerful tools for scientists and science communicators. <\/p><p>Moeliker later used these tools to tell the world about two other notorious, complicated subjects: the brutally murdered &lsquo;Domino&rsquo; sparrow and the feared disappearance of the once-ubiquitous pubic louse. He has pioneered unusual ways to engage international audience &mdash; to make people think about remarkable animal behaviour, biodiversity and habitat destruction.<\/p><p>His writings include two books, in Dutch: <a href=\"http:\/\/www.nieuwamsterdam.nl\/boekUitgave.aspx?ID=1176\" target=\"_blank\">&#39;<em>De eendenman<\/em><\/a>&#39; (<em>The Duck Guy<\/em>, 2009) and &#39;<a href=\"http:\/\/www.nieuwamsterdam.nl\/boekUitgave.aspx?ID=2333\" target=\"_blank\"><em>De bilnaad van de teek<\/em><\/a>&#39; (<em>The Butt Crack of the Tick<\/em>, 2012). <\/p><p>Each year, on June 5, he organizes <a href=\"http:\/\/www.deadduckday.com\" target=\"_blank\">Dead Duck Day<\/a>, an event that commemorates the first known case of homosexual necrophilia in the mallard duck. The event also raises awareness for the tremendous number of bird deaths caused, worldwide, by glass buildings. <\/p>","slug":"kees_moeliker","published_at":"2013-01-07 20:51:00","updated_at":"2019-08-14 13:46:50"}}