{"speaker":{"id":1496,"title":"","firstname":"Robert J.","middleinitial":"","lastname":"Gordon","description":"Economist","whotheyare":"Robert J. Gordon is among the most influential macroeconomists in the world. And the big picture he sees is not altogether rosy.","whylisten":"<p>Robert J. Gordon has written prolifically about the problems facing contemporary economic growth, casting a sobering doubt on the ability of our current innovations (what he calls the &quot;third industrial revolution,&quot; including all our fancy gadgets) to power the economy the way previous waves of invention. In a recent paper, he suggests that the repeated doubling of economic growth that characterized the 20th century and was arguably the bedrock for modern society may be decelerating at an alarming rate -- especially for the bottom 99 percent of the income distribution. While innovation is continuing apace, he sees the economy buffeted by six headwinds, and a different mix of obstacles for the US economy than for Canada and Europe.<\/p><p>Over the past four decades, he&#39;s also done fascinating work on the economics of the airline industry. He&#39;s authored hundreds of scholarly articles and five books, including his most recent,&nbsp;<em><a href=\"http:\/\/geni.us\/robertjgordonessays\" target=\"_blank\">Productivity Growth, Inflation, and Unemployment: The Collected Essays of Robert J. Gordon<\/a>,<\/em>&nbsp;as well as the textbook&nbsp;<em><a href=\"http:\/\/geni.us\/macroeconomics\" target=\"_blank\">Macroeconomics<\/a>,<\/em>&nbsp;now in its 12th edition. Two key papers to start: &quot;<a href=\"http:\/\/www.nber.org\/papers\/w18315\" target=\"_blank\">Is US economic growth over? Faltering innovation confronts the six headwinds<\/a>,&quot; NBER Working Paper 18315; and &ldquo;<a href=\"http:\/\/online.wsj.com\/article\/SB10001424127887324461604578191781756437940.html\" target=\"_blank\">Why Innovation Won&rsquo;t Save Us<\/a>,&rdquo; from the <em>Wall Street Journal<\/em>.<\/p>","slug":"robert_j_gordon","published_at":"2013-01-07 21:10:00","updated_at":"2015-09-28 16:01:08"}}