{"speaker":{"id":150,"title":"","firstname":"Deborah","middleinitial":"","lastname":"Scranton","description":"Filmmaker","whotheyare":"The director of the award-winning documentary <em>The War Tapes,<\/em> Deborah Scranton is committed to using new technology to give people power to tell their own stories. ","whylisten":"Deborah Scranton made her feature film directorial debut with the award-winning documentary <a href=\"http:\/\/www.deborahscranton.com\/the-war-tapes-film\/\" target=\"_blank\">THE WAR TAPES<\/a>, which premiered and won Best Documentary Feature at the 2006 Tribeca Film Festival. Hailed by the New York Times as &quot;raw, honest and moving &hellip; one of the formally most radical films of 2006&quot; and described as &quot;the first indispensable Iraq documentary&quot;, THE WAR TAPES went on to win Best International Documentary at the 2006 BritDoc Festival, and was shortlisted for an Academy Award in 2007. In 2008, Scranton reprised her &lsquo;virtual embed&rsquo; directorial technique in <a href=\"http:\/\/www.deborahscranton.com\/bad-voodoos-war-film\/\" target=\"_blank\">BAD VOODOO&rsquo;S WAR<\/a>  which was commissioned and broadcast by WGBH\/FRONTLINE on PBS during the height of the Iraq War troop surge.<br \/><br \/>Her second feature <a href=\"https:\/\/www.youtube.com\/watch?v=RJU-zBKe4uI\" target=\"_blank\">EARTH MADE OF GLASS<\/a>, a political thriller set in post-genocide Rwanda and France, premiered at the 2010 Tribeca Film Festival in Documentary Competition. Broadcast on HBO in April 2011, EARTH MADE OF GLASS  was one of six films nominated for Best Documentary Feature of the Year by the Producer&rsquo;s Guild of America in 2011 and won a Peabody Award the same year.<br \/><br \/>Scranton was commissioned by HBO for her third feature, <a href=\"https:\/\/www.youtube.com\/watch?v=VTKQyl33N5w\" target=\"_blank\">WAR DOG: A SOLDIER&rsquo;S BEST FRIEND<\/a>  which reveals the intimate relationship between U.S. Army Special Operations Command dog handlers and the multi-purpose canines that serve together as human\/animal teams in combat around the world. The film had its worldwide HBO broadcast premiere Veteran&rsquo;s Day weekend November 2017.<br \/><br \/>Scranton is currently in pre-production on a hybrid documentary film series tracing the history of American and Soviet\/Russian military from the American Revolutionary War through the Global War on Terror still underway in Afghanistan.<br \/><br \/>In 2007, she was a visiting fellow at The Watson Institute for International Studies at Brown University working with the Global Media Project in the Global Security Program. During her fellowship, Scranton created and co-taught a senior seminar on documentary filmmaking and social change. She also created and organized a two day conference, &ldquo;Front Line, First Person: Iraq War Stories&rdquo;, which featured speakers representing the direct experience of war.<br \/>","slug":"deborah_scranton","published_at":"2007-09-12 02:47:00","updated_at":"2018-03-21 19:50:22"}}