{"speaker":{"id":1510,"title":"","firstname":"Diana","middleinitial":"","lastname":"Reiss","description":"Cognitive psychologist","whotheyare":"Diana Reiss studies animal cognition, and has found that bottlenose dolphins (and Asian elephants) can recognize themselves in the mirror.","whylisten":"<p>Diana Reiss&rsquo;s research focuses on the cognition and communication of marine animals, with an emphasis on comparative animal cognition. Essentially, she studies the evolution of intelligence. Reiss pioneered the use of underwater keyboards with dolphins to investigate  their communicative abilities and provide them with more  degrees of choice and control. Reiss and her  colleagues demonstrated that bottlenose dolphins and an Asian elephants  possess the rare ability for mirror self-recognition previously thought  to be restricted to humans and great apes. She wrote about this work in her recent book,&nbsp;<a href=\"http:\/\/www.hmhbooks.com\/dolphinintelligence\/\" target=\"_blank\"><em>The Dolphin in the Mirror<\/em><\/a>.     <\/p><p>Reiss&#39; efforts also involve the  rescue and rehabilitation of stranded marine mammals, including the  successful rescue of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Humphrey_the_Whale\" target=\"_blank\">Humphrey, the humpback whale<\/a>, from  San Francisco Bay waters. Her advocacy work in conservation and animal  welfare includes the protection of dolphins in the tuna-fishing industry  and efforts to bring an end to the killing of dolphins in the drive  hunts in Japan.&nbsp;<\/p><p>Reiss is a cognitive psychologist and professor in the Department of Psychology at Hunter College and the Biopsychology and Behavioral Neuroscience subprogram at the Graduate Center, CUNY. She directs a dolphin cognitive research program at the National Aquarium in Baltimore and is a research associate at the Smithsonian&rsquo;s National Zoo in DC, where she investigates elephant cognition.<\/p>","slug":"diana_reiss","published_at":"2013-01-08 20:34:00","updated_at":"2013-07-10 13:53:55"}}