{"speaker":{"id":1520,"title":"","firstname":"Angela","middleinitial":"","lastname":"Patton","description":"Activist","whotheyare":"Angela Patton is an ambassador for who she calls \"at-promise\" (as opposed to \"at-risk\") girls and a serial innovator.","whylisten":"<p>As the leader and CEO of&nbsp;<a href=\"http:\/\/www.girlsforachange.org\/\" target=\"_blank\">Girls For A Change<\/a>&nbsp;(GFAC), Angela Patton is committed to &quot;preparing black girls for the world ... and the world for black Girls. Patton founded Camp Diva in Richmond, Virginia in 2004, to honor Diva Mstadi Smith-Roan, a five-year-old who died in a firearm accident earlier that year. That summer, Patton planned a two-week experience that gave Diva&#39;s mother an opportunity to share her motherly love with girls in need of a support system. The program grew and went national in October 2013, when Camp Diva merged with California-based Girls For A Change, a nonprofit through which 100 girls&#39; groups throughout nation work together to envision and execute lasting change in their neighborhoods, cities or schools. In the summer of 2016, Patton lead her board and staff to retool the organization&#39;s focus and build a program structure to more accurately reflect GFAC&#39;s goal to work with black girls and to disseminate our programs using a specific, replicable approach.<\/p><p>Following the release of Patton&#39;s&nbsp;TED Talk describing a father-daughter dance for incarcerated dads and their &quot;at-promise&quot; girls, her work was featured on ABC World News, Inside Edition, NPR and This is Life Lisa Ling. She has spoken for corporations, at conferences on girls as well as colleges and universities throughout the country. When she isn&#39;t inspiring change, advocating gender equality and empowering girls, she enjoys festivals and concerts with her husband and motivator, Raymond Patton, and their loving children, Imhotep and Asani.<\/p>","slug":"angela_patton","published_at":"2013-01-14 14:39:00","updated_at":"2017-10-23 19:12:26"}}