{"speaker":{"id":1535,"title":"","firstname":"Jennifer","middleinitial":"","lastname":"Granholm","description":"Former governor of Michigan","whotheyare":"A former two-term governor of Michigan, Jennifer M. Granholm makes the case for empowering states to create jobs through a Clean Energy Jobs Race to the Top.\r\n","whylisten":"<p>Jennifer M. Granholm was elected governor of Michigan in 2002, and in 2006, she was re-elected with the largest number of votes ever cast for governor in Michigan. As governor, Granholm led the state through a brutal economic downturn that resulted from a meltdown in the automotive and manufacturing sectors. She worked relentlessly to diversify the state&rsquo;s economy, strengthen its auto industry, preserve the advancedmanufacturing sector, and add new, emerging sectors, such as clean energy, to Michigan&rsquo;s economic portfolio.&nbsp;<\/p><p>During her tenure, she pioneered clean energy policies, working with business and labor, Republicans and Democrats to create new economic opportunities in Michigan. In 2005, the Granholm economic development team put together an aggressive strategy to make Michigan the hub of clean-energy development in North America by developing entire supply chains in Michigan, fostering critical partnerships between industry, government and researchers and by creating economic incentives that made Michigan the place to locate. Granholm&rsquo;s plan included specific clustering strategies targeted at battery manufacturing, bio-energy, solar and wind power. Her leadership attracted to Michigan more than 89,000clean energy jobs and $9.4 billion in investments in that sector. &nbsp;By the time she left office at the start of 2011, Michigan&rsquo;s economy was rebounding and Gallup listed Michigan as state with the most improved jobs climate.&nbsp;<\/p><p>Her book&nbsp;<a href=\"http:\/\/geni.us\/3ZRq\" target=\"_blank\"><em>A Governor&rsquo;s Story: The Fight for Jobs and America&rsquo;s Economic Future<\/em><\/a>&nbsp;tells how Michigan pioneered ways out of an economic storm and offers&nbsp; advice for a nation desperate to create jobs.&nbsp;&nbsp;<\/p><p>&nbsp;<\/p>","slug":"jennifer_granholm","published_at":"2013-02-04 21:43:00","updated_at":"2015-10-10 01:53:38"}}