{"speaker":{"id":1536,"title":"","firstname":"Tyler","middleinitial":"","lastname":"DeWitt","description":"Technology-driven science educator","whotheyare":"Tyler DeWitt recognizes that textbooks are not the way to get young people interested in science. Instead, he teaches science by making it fun and fantastical.","whylisten":"       <p>Tyler DeWitt works at the intersection of science, technology and education. It&rsquo;s always frustrated him that education -- particularly science education -- is incredibly painful and disengaging for so many learners. He&#39;s a fervent believer that new technologies and digital content, meticulously built and thoughtfully deployed, are our best bets for creating accessible educational experiences that scale.<\/p><p>He&#39;s particularly passionate about bringing the highest quality education to students outside of the selective &ldquo;ivory towers.&quot; In academia, that&rsquo;s about considering the often-forgotten needs of, say, a struggling single dad returning to community college part-time to start a nursing degree. And in the business world, it&rsquo;s about seeing how brilliant workforce education, instead of mind-numbing training, can change careers and industries.<\/p><p>DeWitt&#39;s projects are varied, but all focus on tech. His&nbsp;<a href=\"https:\/\/www.youtube.com\/channel\/UCj3EXpr5v35g3peVWnVLoew\" target=\"_blank\">YouTube channel<\/a>, where he&#39;s created lessons on chemistry and biology, helps hundreds of thousands of students with their courses every day. He created a virtual reality experience, funded by Google, that takes learners inside a human cell. And he was the video author for a new digital chemistry textbook published by Macmillan, bringing the newest ways that students learn to an older, more traditional medium. Most recently, he&#39;s created VR learning content that teaches the skills needed to manufacture advanced cell and gene therapies in the biotech space.&nbsp;<\/p><p>He spends a lot of time speaking about the need to rethink and disrupt traditional educational approaches and institutions so that we can meet the needs of more students. And for someone who really wants to see academia get its act together, he also loves it and respect it, and it&rsquo;s been a big part of his life.<\/p><p>DeWitt grew up in a small college town with a professor father, has a bachelor&rsquo;s degree from Brown and a doctorate from MIT.&nbsp;<\/p>  ","slug":"tyler_dewitt","published_at":"2013-02-05 15:26:00","updated_at":"2021-03-18 21:00:47"}}