{"speaker":{"id":154,"title":"","firstname":"Steven","middleinitial":"","lastname":"Pinker","description":"Psychologist","whotheyare":"Steven Pinker is a professor of cognitive science (the study of the human mind) who writes about language, mind and human nature. ","whylisten":"<p>Steven Pinker grew up in the English-speaking community of Montreal&nbsp;but has spent his adult life bouncing back and forth between Harvard and MIT. He is interested in all aspects of human nature: how we see, hear, think, speak, remember, feel and interact.<\/p><p>Pinker developed the first comprehensive theory of language acquisition in children, used verb meaning as a window into cognition, probed the limits of neural networks and showed how the interaction between memory and computation shapes language. He has used evolution to illuminate innuendo, emotional expression and social coordination. He has documented historical declines in violence and explained them in terms of the ways that the violent and peaceable components of human nature interact in different eras. He has written books on the language instinct, how the mind works, the stuff of thought and the doctrine of the blank slate, together with a guide to stylish writing that is rooted in psychology.<\/p><p>In his book,&nbsp;<a href=\"http:\/\/geni.us\/ZgcXi\" target=\"_blank\"><em>Enlightenment Now: The Case for Reason, Science, Humanism, and Progress<\/em><\/a>, Pinker writes about progress -- why people are healthier, richer, safer, happier and better educated than ever. His other books include <em><a href=\"http:\/\/geni.us\/languageinstinct\" target=\"_blank\">The Language Instinct<\/a>,&nbsp;<\/em><em><a href=\"http:\/\/geni.us\/howmindworks\" target=\"_blank\">How the Mind Works<\/a>,<\/em>&nbsp;<em><a href=\"http:\/\/geni.us\/blankslate\" target=\"_blank\">The Blank Slate: The Modern Denial of Human Nature<\/a>,&nbsp;<\/em><em><a href=\"http:\/\/geni.us\/stuffofthought\" target=\"_blank\">The Stuff of Thought<\/a><\/em>&nbsp;and <a href=\"http:\/\/geni.us\/betterangels\" target=\"_blank\"><em>The Better Angels of Our Nature<\/em><\/a>.<\/p>","slug":"steven_pinker","published_at":"2007-08-20 14:54:00","updated_at":"2021-08-03 18:26:02"}}