{"speaker":{"id":1543,"title":"","firstname":"Young-ha","middleinitial":"","lastname":"Kim","description":"Writer","whotheyare":"One of the premiere writers of his generation, Korean novelist Young-ha Kim weaves tales that speak to the thrills and challenges of young Koreans in our increasingly globalized and ever-changing world. ","whylisten":"            <p>Young-ha Kim wishes that his eighth grade teacher, rather than chiding him for a poorly-executed drawing with a sweeping backstory, had told him, &ldquo;Well, Young-ha, you may not be good at drawing but you have a talent for storytelling.&rdquo; Without encouragement, he took the long road toward becoming a writer.<\/p>   <p>Young-ha Kim published his debut novel, <em><a href=\"http:\/\/geni.us\/righttodestroy\">I Have the Right to Destroy Myself<\/a><\/em>, in 1996. It won the esteemed Munhak-dongne prize, and was translated into French two years later. Followed by English and German translations, the book garnered Kim international recognition. Kim has since published five novels -- including <em>The Empire of Light <\/em>and <em><a href=\"http:\/\/geni.us\/republiciscalling\">Your Republic Is Calling You<\/a><\/em> -- plus four collections of short stories.<\/p>   <p>Kim&rsquo;s latest book, <a href=\"http:\/\/geni.us\/blackflower\" target=\"_blank\"><em>Black Flower<\/em><\/a>, was sparked by a random conversation on a trans-Pacific flight. It tells the story of 1,033 Korean immigrants who found themselves sold into indentured servitude in Mexico&rsquo;s Yucatan Peninsula in 1905. <em>Publisher&#39;s Weekly<\/em> wrote of the novel in October of 2012, &ldquo;Spare and beautiful, Kim&rsquo;s novel offers a look at the roots of the little-known tribulations of the Korean diaspora in Mexico.&rdquo;<\/p>  <p>Kim&rsquo;s work mixes high and low genres and focuses on the issue of: what does it mean to be Korean in a globalized, quickly-changing world? His novels have served as a source of inspiration for Korean filmmakers -- two have already been adapted for the big screen with the film version of a third on its way.<\/p><p>Until 2008, Kim was a professor in the Drama School at Korean National University of Arts -- a post he left in 2008 to focus exclusively on writing.<\/p>","slug":"young_ha_kim","published_at":"2013-02-15 14:21:00","updated_at":"2015-07-10 22:03:32"}}