{"speaker":{"id":155,"title":"","firstname":"John","middleinitial":"","lastname":"Maeda","description":"Artist","whotheyare":"John Maeda, the former president of the Rhode Island School of Design, is dedicated to linking design and technology. Through the software tools, web pages and books he creates, he spreads his philosophy of elegant simplicity.","whylisten":"<p>When John Maeda became president of the legendary Rhode Island School of Design (RISD) in 2008, he told the <em>Wall Street Journal<\/em>, &quot;Everyone asks me, &#39;Are you bringing technology to RISD?&#39; I tell them, no, I&#39;m bringing RISD to technology.&quot;<\/p> <p class=\"p1\">In his fascinating career as a programmer and an artist, he&#39;s always been committed to blurring the lines between the two disciplines. As a student at MIT, studying computer programming, the legendary&nbsp;<a href=\"http:\/\/www.nytimes.com\/2007\/10\/07\/style\/tmagazine\/07rawsthorn.html\" target=\"_blank\">Muriel Cooper<\/a>&nbsp;persuaded him to follow his parallel passion for fine art and design. And when computer-aided design began to explode in the mid-1990s, Maeda was in a perfect position at the MIT Media Lab to influence and shape the form, helping typographers and page designers explore the freedom of the web.<\/p> <p>Maeda is leading the &quot;<a href=\"http:\/\/stemtosteam.org\/\" target=\"_blank\">STEAM<\/a>&quot; movement--adding an &quot;A&quot; for Art to the education acronym&nbsp;<a href=\"http:\/\/www.risd.edu\/About\/STEM_to_STEAM\/\" target=\"_blank\">STEM<\/a>&nbsp;(Science, Technology, Engineering, and Math)--and experiencing firsthand the transformation brought by social media. After leaving his post as RISD&#39;s president, Maeda is turning his attention to Silicon Valley, where is is working as a Design Partner for <a href=\"https:\/\/kpcb.com\/news\/john-maeda-joins-kleiner-perkins-caufield-byers-as-design-partner\" target=\"_blank\">Kleiner, Perkins, Caulfield and Byers.<\/a>  He is also consulting for eBay, where he is the chair of the Design Advisory Board. <\/p>","slug":"john_maeda","published_at":"2007-09-20 10:00:00","updated_at":"2014-01-06 18:31:43"}}