{"speaker":{"id":1560,"title":"","firstname":"Alexa","middleinitial":"","lastname":"Meade","description":"Visual artist","whotheyare":"Alexa Meade paints mesmerizing, illusionistic portraits directly on living subjects, subverting familiar visual cues with perspective and color.","whylisten":"<p>Alexa Meade creates paintings in 3D space that make the real world appear to be a 2D painting. What may look like a traditional painted portrait is actually a photograph of a living, breathing person whose face, clothes and surroundings are all covered in acrylic paint. The 3D paintings can be photographed from any angle and maintain the illusion of flatness without the need for digital effects.<\/p><p>Alexa stumbled upon this technique by accident. While she was studying political science in college, she had an idea for an art project: what would it look like if she covered up shadows in the landscape with black paint? This question led her down a rabbit hole of experiments with painitng in 3D space that led to her discovery of this new style of optical illusion. She paints on people around the world who become part of the urban landscape as living street art. The photographs of the ephemeral painting performances hang on the walls of galleries and museums.<\/p><p>She recieved critical acclaim from <em>CNN<\/em>, <em>Wired<\/em>, <em>NPR<\/em>, the <em>Wall Street Journal<\/em>, and more. She has lectured at the CalArts, UC-Berkeley, Apple, Adobe and <em>National Geographic London<\/em>.&nbsp;<\/p><p>Alexa travels the world creating live painting performances, art installations and commisioned portraits. Currently, Alexa is collaborating with scientists and researching spacetime at the Perimeter Institute for Theoretical Physics. Alexa is making a series of magical paintings with David Blaine, transforming her home into a &quot;Fun House&quot; with Chris Hughes, developing a line of toys and volunteering in the art program at the Braille Institute.&nbsp;<\/p>","slug":"alexa_meade","published_at":"2013-03-27 23:46:00","updated_at":"2015-09-01 16:12:37"}}