{"speaker":{"id":1569,"title":"","firstname":"Charmian","middleinitial":"","lastname":"Gooch","description":"Anti-corruption activist","whotheyare":"Charmian Gooch is the 2014 TED Prize winner. At Global Witness, she exposes how a global architecture of corruption is woven into the extraction and exploitation of natural resources.","whylisten":"<p>Charmian Gooch co-founded the watchdog NGO <a href=\"http:\/\/www.globalwitness.org\/\" target=\"_blank\" onclick=\"window.open('','','');return false;\">Global Witness<\/a>  with colleagues Simon Taylor and Patrick Alley, in response to growing concerns over covert warfare funded by illicit trade in 1993.&nbsp;Since then, Global Witness has captured headlines for their expos&eacute; of &quot;blood diamonds&quot; in Uganda, of mineral exploitation in the Congo, of illegal timber trade between Cambodia and Thailand, and more. With unique expertise on the shadowy threads connecting corrupt businesses and governments, Global Witness continues its quest to uncover and root out the sources of exploitation.<\/p><p>In 2014, Gooch and Global Witness were&nbsp;<a href=\"http:\/\/www.ted.com\/participate\/ted-prize\/prize-winning-wishes\/global-witness\" target=\"_blank\" onclick=\"window.open('','','');return false;\">awarded the $1 million TED Prize<\/a>, along with&nbsp;the&nbsp;Skoll Award for Social Entrepreneurship, for their campaign to end anonymous companies. Gooch&#39;s TED Prize wish:&nbsp;for us to know who ultimately owns and controls companies and launch a new era of openness in business. Global Witness highlighted the importance of this issue in an investigation, aired on&nbsp;<a href=\"http:\/\/blog.ted.com\/ted-prize-winner-charmian-gooch-on-60-minutes\/\" target=\"_blank\" onclick=\"window.open('','','');return false;\"><em>60 Minutes<\/em><\/a>, where they sent an undercover investigator into 13 New York law firms. The investigator posed as an adviser to a government minister in Africa and asked for thoughts on how to move money into the United States for a plane, a yacht and a brownstone. All but one firm offered advice.&nbsp;<\/p><p><a href=\"http:\/\/www.ted.com\/talks\/robert_palmer_the_panama_papers_exposed_a_huge_global_problem_what_s_next\" target=\"_blank\" onclick=\"window.open('','','');return false;\">The Panama Papers<\/a>, released in April of 2016, further demonstrate the need for transparency. The papers paint a picture of how the rich and powerful around the world use offshore accounts and anonymous companies to move money. &quot;This secretive world is being opened up to global public scrutiny,&quot; said Gooch, on the day the papers were released.<\/p>  <p>&nbsp;<\/p>","slug":"charmian_gooch","published_at":"2013-03-28 20:31:00","updated_at":"2017-06-13 14:11:56"}}