{"speaker":{"id":158,"title":"","firstname":"Sugata","middleinitial":"","lastname":"Mitra","description":"Education researcher","whotheyare":"Educational researcher Sugata Mitra is the winner of the 2013 TED Prize. His wish: Build a School in the Cloud, where children can explore and learn from one another.","whylisten":"<p>In 1999, Sugata Mitra and his colleagues dug a hole in a wall bordering an urban slum in New Delhi, installed an Internet-connected PC and left it there, with a hidden camera filming the area. What they saw: kids from the slum playing with the computer and, in the process, learning how to use it -- then teaching each other. These famed &ldquo;Hole in the Wall&rdquo; experiments demonstrated that, in the absence of supervision and formal teaching, children can teach themselves and each other -- if they&rsquo;re motivated by curiosity. Mitra, now a professor of educational technology at <a href=\"http:\/\/egwestcentre.com\/research\/holeinthewall\/\" target=\"_blank\">Newcastle University<\/a>, called it &quot;minimally invasive education.&quot;<\/p><p>Mitra thinks self-organized learning will shape the future of education. At TED2013, he made a bold TED Prize wish: Help me build a&nbsp;<a href=\"http:\/\/www.ted.com\/participate\/ted-prize\/prize-winning-wishes\/school-in-the-cloud\" target=\"_blank\">School in the Cloud<\/a>&nbsp;where children can explore and learn on their own -- and teach one another -- using resouces from the worldwide cloud. <\/p><p>The School in the Cloud now includes seven physical locations -- five in India and two in the UK. At the same time, the&nbsp;<a href=\"https:\/\/www.theschoolinthecloud.org\/\" target=\"_blank\">School in the Cloud online platform<\/a>&nbsp;lets students participate anywhere, with partner learning labs and programs&nbsp;in countries <a href=\"http:\/\/blog.ted.com\/self-organized-learners-around-the-world-team-up-to-raise-money\/\" target=\"_blank\">like Colombia, Pakistan and Greece<\/a>. In 2016, Mitra held the first School in the Cloud conference in India. He shared that more than 16,000 SOLE sessions had taken place so far, with kids all around the world dipping their toes in this new education model.<\/p>","slug":"sugata_mitra","published_at":"2008-08-20 01:00:00","updated_at":"2018-01-12 22:47:23"}}