{"speaker":{"id":1580,"title":"","firstname":"Holly","middleinitial":"","lastname":"Morris","description":"Explorer and filmmaker","whotheyare":"Holly Morris tells the stories of women around the world through documentary, television, print and the web.","whylisten":"<p>Holly Morris is a director, producer, writer and storyteller whose work spans media and continents. She is the author of <em>Adventure Divas: Searching the Globe for a New Kind of Heroine<\/em> (Random House) and writer\/director and executuve producer of its companion PBS documentary series, &quot;Adventure Divas&quot;. A former National Geographic Adventure columnist and widely anthologized essayist, Morris is also a regular contributor to <em>The New York Times<\/em>, among other publications. She presents the PBS televisin series &quot;Globe Trekker,&quot; and &quot;Treks in a Wild World,&quot; and also hosted &quot;Outdoor Investigations&quot; -- a series in which she investigates the scientific side of today&#39;s environmental and natural world mysteries.&nbsp;<\/p><p>Morris has reported on the illegal caviar trade from Iran&#39;s Caspian Sea, sex trafficking from the brothels of India, and the global diaspora of Black Panthers from Cuba. Whether she&#39;s exploring underground Soviet missile silos, or the ship breaking yards of Bangladesh, Morris goes to the grassroots to tell a global story.<\/p><p>Her new film, The Babushkas of Chernobyl is about a surprising group of survivors living in the shadow of Chernobyl. Based on her award-winning essay of the same name (also published as &quot;Ukraine: A Country of Women&quot;), it won the Meredith Editorial Excellence Award, was reprinted in London&#39;s <em>Daily Telegraph<\/em>, and <em>The Week<\/em>&nbsp;and was selected for the book <em>The Best Travel Writing<\/em> (2012). The film, which has won numerous awards, including the Los Angeles Film Festival Jury Award for Directing, is being widely released in Spring 2016 for the 30th anniversary of the Chernobyl disaster.<\/p><p>&nbsp;<\/p>","slug":"holly_morris","published_at":"2013-03-29 16:00:00","updated_at":"2016-04-19 17:17:48"}}