{"speaker":{"id":159,"title":"","firstname":"Paul","middleinitial":"","lastname":"MacCready","description":"Engineer","whotheyare":"Paul MacCready, an aircraft designer and environmentalist, is a pioneer of human-powered flight, alternative energy for transportation, and environmentally responsible design.","whylisten":"<p>Through his life, Paul MacCready turned his mind, energy and heart toward his two passions: flight and the Earth. His early training as a fighter and glider pilot (glider pilots still use the &quot;MacCready speed ring&quot; he developed after World War II) led him to <strong>explore nontraditional flight and nontraditional energy sources<\/strong>.  <\/p><p>In the 1970s, <strong>he and his company, AeroVironment, designed and built two record-breaking human-powered planes<\/strong>: the <a href=\"http:\/\/www.donaldmonroe.com\/gossamer_condor_photography\" target=\"_blank\"><em>Gossamer Condor<\/em><\/a>, the first human-powered aircraft to complete a one-mile course set by the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Kremer_prize\" target=\"_blank\">Kremer Prize<\/a>, and the <a href=\"http:\/\/www.donaldmonroe.com\/gossamer_albatross_photography\" target=\"_blank\"><em>Gossamer Albatross<\/em><\/a>, the first to cross the English Channel. The planes&#39; avian names reveal the deep insight that MacCready brought to the challenge -- that large birds, in their wing shape and flying style, possess an elegant secret of flight.<\/p><p>He then turned his wide-ranging mind toward environmentally responsible design, <strong>informed by his belief that human expansion poses a grave threat to the natural world<\/strong>. His team at AeroVironment prototyped an electric car that became General Motors&#39; pioneering EV-1. They explored alternative energy sources, including <a href=\"http:\/\/www.avinc.com\/Energy_Lab_Details.asp?Prodid=52\" target=\"_blank\">building-top wind turbines<\/a>. And they developed <a href=\"http:\/\/www.aerovironment.com\/ADC_Projects.asp\" target=\"_blank\">a fleet of fascinating aircraft<\/a> -- including his <a href=\"http:\/\/www.avinc.com\/pr_detail.asp?ID=29\" target=\"_blank\"><em>Helios<\/em> <\/a> solar-powered glider, built to fly in the very top 2 percent of Earth&#39;s atmosphere, and the 2005 <a href=\"http:\/\/www.popsci.com\/popsci\/bown2005\/aviationspace\/4eb21d15cc827010vgnvcm1000004eecbccdrcrd.html\" target=\"_blank\"><em>Global Observer<\/em><\/a>, the first unmanned plane powered by hydrogen cells. <\/p><p>&nbsp;<\/p>","slug":"paul_maccready","published_at":"2007-09-27 01:20:00","updated_at":"2009-04-08 14:30:23"}}