{"speaker":{"id":1615,"title":"","firstname":"Uri","middleinitial":"","lastname":"Alon","description":"Biologist","whotheyare":"Uri Alon studies how cells work, using an array of tools (including improv theater) to understand the biological circuits that perform the functions of life.","whylisten":"<p>Trained as a physicist, Uri Alon is a pioneer in the field of systems biology. He combines experiment and theory to understand general principles in biology. His work defined the small set of recurring circuits in biological systems called network motifs. In his lab at the Weizmann Institute of Science in Israel, students use tools from physics, neurobiology, computer science and concepts from improv theatre to study basic principles of interactions. They investigate the protein circuits within a cell and look for basic interaction patterns that recur throughout biological networks.<\/p><p>Alon has published over 120 highly cited papers, including the classic paper on lab behavior called &quot;<a href=\"https:\/\/www.weizmann.ac.il\/mcb\/UriAlon\/sites\/mcb.UriAlon\/files\/uploads\/nurturing\/howtochoosegoodproblem.pdf\" target=\"_blank\">How to Choose a Good Scientiﬁc Problem<\/a>,&quot; which takes a step back from the rush to get grants and publish papers to ask: How can a good lab foster growth and self-motivated research? He writes, advocates and even sings about the importance of human relationships in science.<\/p><p>Born in Tel Aviv, Israel, Alon earned his BSc degree in physics and mathematics, his MSc degree in physics from the Hebrew University of Jerusalem and his PhD in theoretical physics at the Weizmann Institute of Science. After conducting postdoctoral studies in the Departments of Physics and Molecular Biology at Princeton University for three years, he joined the Department of Molecular Cell Biology at the Weizmann Institute as a senior scientist in 1999. He was promoted to associate professor in 2004 and full professor in 2008. His prizes and honors include the Moore Fellowship, California Institute of Technology (2000), EMBO Young Investigator Award (2001), Minerva Junior Research Group on Biological Computation (2003), Morris L. Levinson Award in Biology, Weizmann Institute Scientific Council (2003), IBM Faculty Award (2003), Teva Founders Prize (2005), EMBO membership (2007), Michael Bruno Memorial Award (2009) and Radcliffe Fellowship (2009).<\/p>","slug":"uri_alon","published_at":"2013-04-01 03:25:00","updated_at":"2020-05-21 22:07:08"}}