{"speaker":{"id":1639,"title":"","firstname":"Geoffrey","middleinitial":"","lastname":"Canada","description":"Education reformer","whotheyare":"Geoffrey Canada has spent decades as head of the Harlem Children’s Zone, which supports kids from birth through college in order to break the cycle of poverty.","whylisten":"<p class=\"MsoNormal\">Geoffrey Canada grew up in an impoverished neighborhood in the South Bronx, with a mother who believed deeply in education. So upon getting his degree from Bowdoin College and continuing on to a masters in education from Harvard, Canada dedicated himself to working with kids in poor neighborhoods. In 1983, he accepted a position at the Rheedlen Institute in Harlem as education director. Seven years later, he became president and renamed it the Harlem Children&#39;s Zone.&nbsp;<\/p>  <p class=\"MsoNormal\">While the Harlem Children&rsquo;s Zone started out focusing on a single block -- West 119th Street -- it has since expanded exponentially. It now encompasses more than 100 square blocks and serves an estimated 10,000 children, providing pre-kindergarten care, after-school programs, health care, college planning and classes for soon-to-be-parents. <\/p><p class=\"MsoNormal\">Meanwhile, Canada has become known nationally for his work, appearing on shows as diverse as <em>Oprah <\/em>and <em>This American Life<\/em>. The recipient of the first Heinz Award in 1994, Canada was named one of &quot;America&#39;s Best Leaders&quot; by <em>U.S. News and World Report<\/em> in 2005 and, in 2011, he was listed as one of TIME magazine&rsquo;s 100 most influential people in the world. Both Canada and Harlem Children&rsquo;s Zone figured prominently in the 2010 documentary <em>Waiting for Superman<\/em>. And President Barack Obama&rsquo;s Promise Neighborhoods program was modeled after HCZ, offering grants to programs in 21 cities across the country to try and emulate its success.<\/p>  <p class=\"MsoNormal\">An avid fan and teacher of Tae Kwon Do, Canada has authored two books:&nbsp;<a href=\"http:\/\/geni.us\/fiststickknifegun\" target=\"_blank\"><em>Fist Stick Knife Gun: A Personal History of Violence in America<\/em><\/a>&nbsp;and&nbsp;<a href=\"http:\/\/geni.us\/reachingup\" target=\"_blank\"><em>Reaching Up for Manhood: Transforming the Lives of Boys in America<\/em><\/a>.<\/p>","slug":"geoffrey_canada","published_at":"2013-05-02 01:32:00","updated_at":"2015-07-10 19:56:12"}}