{"speaker":{"id":1643,"title":"","firstname":"ShaoLan","middleinitial":"","lastname":"Hsueh","description":"Technologist, entrepreneur","whotheyare":"ShaoLan want to help people understand China's culture and language, and to bridge the gap between East and West.","whylisten":"<p class=\"p1\"><span class=\"s1\">ShaoLan is an entrepreneur, angel investor, geek, writer, traveller and dreamer. She is the founder and creator of Chineasy, which she launched after her TED Talk in Long Beach, California in 2013.<\/span><\/p><p class=\"p1\">In just over three years, she has built Chineasy into one of the most popular methods of learning Chinese across the Internet with several hundred thousand fellow learners. Her first book,&nbsp;<a href=\"http:\/\/geni.us\/ChineasyTED\" target=\"_blank\"><em>Chineasy, The New Way to Read Chinese<\/em><\/a><em>,<\/em> was launched in March 2014 and has been translated into 18 languages. Her next book,&nbsp;<a href=\"http:\/\/geni.us\/ChineasyEveryTED\" target=\"_blank\"><em>Chineasy Everyday<\/em><\/a>, was launched in March 2016.<\/p><p class=\"p1\">ShaoLan is a tech entrepreneur with extensive business experience. At the age of 22, while studying for her MBA, she wrote four best-selling books on software in Taiwan, and her books were bundled by Microsoft. She co-founded pAsia, one of the major players on Internet in Asia in 1990&rsquo;s. After a second masters degree at the University of Cambridge, she began Caravel Capital in 2005 to advise young tech companies.<\/p><p class=\"p1\">Chineasy represents a return for ShaoLan to her artistic upbringing and in many ways a design project. This project is the culmination of her life&rsquo;s journey through the East and West. Her aim is to help people to understand China, Chinese culture, its language and to bridge the gap between East and West. Her next step is to help Chinese children to enjoy and appreciate the beauty of their own language.&nbsp;<\/p><p class=\"p2\">&nbsp;<\/p>","slug":"shaolan_hsueh","published_at":"2013-05-07 14:15:00","updated_at":"2016-06-17 20:33:09"}}