{"speaker":{"id":1644,"title":"","firstname":"Malcolm","middleinitial":"","lastname":"London","description":"Poet, performer, activist","whotheyare":"Young spoken-word poet Malcolm London has been called the \"Gil Scott-Heron of this generation\" (by Cornel West). His feisty, passionate performances take on the issues of the day, including the Chicago education system in which he grew up.","whylisten":"<p>This poet wields a dynamic spirit for speaking engagements  utilizing his feisty and passionate performances as words of encourage  for next generations to tell their stories. In 2011, Malcolm London won the <a href=\"http:\/\/www.louderthanabombfilm.com\/\" target=\"_blank\">Louder than a Bomb<\/a>  youth poetry slam in his native Chicago, scooping the top award as both individual performer and with a team. The poet, performer and activist has performed on stages throughout his home city as well as across the United States. A member of the Young Adult Council of the prestigious Steppenwolf Theater, London brings vim and vigor to his energetic performances tackling tough contemporary issues head-on. He wrote &amp; directed a spoken word0infused play responding to the Zimmerman verdict called <em>Two Years Later,<\/em> and&nbsp; <\/p><p>London attends University of Illinois at Chicago &amp; is a member &amp; co-chair of BYP100 Chicago Chapter, a national organization of black activists &amp; organizers. Deeply interested in working on ways to improve the national education system, London regularly visits high schools, youth jails, colleges and communities to work with students on writing workshops and performances. London is currently devoted to being a youth advocate &amp; coordinator of The Know Your Rights Project out of Northwestern Law School, a project dedicated to educating young people on their rights within the juvenile justice system, &amp; continuing his work as teaching artist on staff at Young Chicago Authors, a program working to transform the lives of young people by cultivating their voices through writing, publication and performance education. His work has been featured on national outlets including CBS, NPR, <em>The Huffington Post<\/em>, The Root, and the <em>Chicago Tribune.<\/em><\/p>","slug":"malcolm_london","published_at":"2013-05-07 22:26:00","updated_at":"2014-08-05 20:51:56"}}