{"speaker":{"id":1645,"title":"","firstname":"Pearl","middleinitial":"","lastname":"Arredondo","description":"Teacher","whotheyare":"Pearl Arredondo helped establish a pilot middle school that teaches students to be good communicators in the 21st century.","whylisten":"       <p>Pearl Arredondo grew up in the impoverished East Los Angeles neighborhood of Boyle Heights. She was raised by a single-mother, a long time Los Angeles Unified School District office secretary, who saw firsthand the challenges facing students in public schools. To ensure that she got the best education in the district, Arredondo was bussed to schools almost an hour away from home.<\/p>  <p>Arredondo graduated and moved on to Pepperdine University, where she received both a Bachelor of Arts and a Master of Arts in Education and Instructional Leadership. She was the first in her family to graduate from college and began her teaching career at San Fernando Middle School (SFMS) -- the very middle school she attended eight years prior.<\/p>  <p>At SFMS, she embraced the mission of enhancing educational opportunities for historically underserved students. To do so, she launched the school&rsquo;s Multimedia Academy, which serviced 350 low-income students. After three successful years, the Multimedia Academy faculty decided it was time to make a full split and become a separate school. In 2010, she helped lead an ambitious reform agenda, through a pilot reform model, that focused on technology development, improving outcomes for children and strengthening families. The team founded San Fernando Institute for Applied Media (SFiAM), the first pilot school established in the Los Angeles Unified School District at the middle school level.<\/p>  <p>Arredondo is passionate about increasing student access to technology and closing the digital divide, and is a tireless advocate for technology-based curriculum that prepare students to enter a global economy. Her goal is to make SFiAM a model of educational reform.<\/p><p>Currently, Arredondo is pursuing a Master of Science in Educational Administration and is a 2013 National Board Certified Teacher candidate. She is also part of the 2013 Teach Plus Teaching Policy Fellowship and serves as the Vice President of SFiAM&rsquo;s Governing Council. She is featured in the short documentary film&nbsp;<a href=\"http:\/\/www.teached.org\/the-blame-game\/\" target=\"_blank\">TEACHED Vol.1: &ldquo;The Blame Game,&rdquo;<\/a>&nbsp;and is a role model for young Latinas seeking to make a difference in their communities.<\/p>  ","slug":"pearl_arredondo","published_at":"2013-05-08 13:57:00","updated_at":"2013-05-08 14:03:02"}}