{"speaker":{"id":1655,"title":"","firstname":"Andrew","middleinitial":"","lastname":"Solomon","description":"Writer","whotheyare":"Andrew Solomon writes about politics, culture and psychology. ","whylisten":"<p>Andrew Solomon is a writer, lecturer and Professor of Clinical Psychology at Columbia University. He is president of PEN American Center. He writes regularly for <em>The New Yorker<\/em> and the <em>New York Times<\/em>.<\/p><p>Solomon&#39;s newest book,&nbsp;<a href=\"http:\/\/geni.us\/farandaway\" target=\"_blank\"><em>Far and Away: Reporting from the Brink of Change, Seven Continents, Twenty-Five Years<\/em><\/a>&nbsp;was published in April, 2016. His previous book,&nbsp;<a href=\"http:\/\/geni.us\/farfromthetree\" target=\"_blank\"><em>Far From the Tree: Parents, Children, and the Search for Identity<\/em><\/a>&nbsp;won the National Book Critics Circle award for nonfiction, the Wellcome Prize and 22 other national awards. It tells the stories of parents who not only learn to deal with their exceptional children but also find profound meaning in doing so. It was a <em>New York Times<\/em> bestseller in both hardcover and paperback editions. Solomon&#39;s previous book,&nbsp;<a href=\"http:\/\/geni.us\/thenoondaydemon\" target=\"_blank\"><em>The Noonday Demon: An Atlas of Depression<\/em><\/a>, won the 2001 National Book Award for Nonfiction, was a finalist for the 2002 Pulitzer Prize and was included in <em>The Times of London<\/em>&#39;s list of one hundred best books of the decade. It has been published in twenty-four languages. Solomon is also the author of the novel&nbsp;<a href=\"http:\/\/geni.us\/iSSBBwW\" target=\"_blank\"><em>A Stone Boat<\/em><\/a><em>&nbsp;<\/em>and of <em>The Irony Tower: Soviet Artists in a Time of Glasnost<\/em>.<\/p><p>Solomon is an activist in LGBT rights, mental health, education and the arts. He is a member of the boards of directors of the National LGBTQ Force and Trans Youth Family Allies. He is a member of the Board of Visitors of Columbia University Medical Center, serves on the National Advisory Board of the Depression Center at the University of Michigan, is a director of Columbia Psychiatry and is a member of the Advisory Board of the Depression and Bipolar Support Alliance. Solomon also serves on the boards of the Metropolitan Museum of Art, Yaddo and The Alex Fund, which supports the education of Romani children. He is also a fellow of Berkeley College at Yale University and a member of the New York Institute for the Humanities and the Council on Foreign Relations.<\/p><p>Solomon lives with his husband and son in New York and London and is a dual national. He also has a daughter with a college friend; mother and daughter live in Texas but visit often.<\/p><div><br \/><\/div>","slug":"andrew_solomon","published_at":"2013-06-03 15:06:00","updated_at":"2016-08-15 17:27:00"}}