{"speaker":{"id":1658,"title":"","firstname":"Paul","middleinitial":"","lastname":"Pholeros","description":"Architect","whotheyare":"Paul Pholeros was a director of Healthabitat, a longstanding effort to improve the health of indigenous people by improving their living housing.","whylisten":"<p>&quot;Change comes slowly,&quot; said architect Paul Pholeros. Which is why he spent more than 30 years committedly working on urban, rural, and remote architectural projects throughout his native Australia and beyond. In particular, he focused on improving the living environments of poor people, understanding that environment plays a key and often overlooked role in health.<\/p> <p>An architect himself, Pholeros met his two co-directors in the organization <a href=\"http:\/\/www.healthabitat.com\/\" target=\"_blank\">Healthabitat<\/a> in 1985, when the three were challenged by Yami Lester, the director of an Aboriginal-controlled health service in the Anangu Pitjatjantjara Lands in northwest South Australia, to &quot;stop people getting sick.&quot; The findings from that project guided their thinking, as Pholeros and his partners worked to improve sanitation, connect electricity, and provide washing and water facilities to indigenous communities. Above all, the team focused on engaging these local communities to help themselves--and to pass on their skills to others. In this way, a virtuous circle of fighting poverty was born.<\/p><p>Since 2007, Healthabitat has expanded its work beyond Australia, working on similar projects in the Kathmandu Valley in Nepal. In 2011, the firm was awarded the international UN Habitat and Building and Social Housing Foundation&#39;s World Habitat Award, and a Leadership in Sustainability prize from the Australian Institute of Architects. In 2012, Healthabitat was one of the six Australian representatives at the Venice International Architectural Biennale.<\/p><p>Paul Pholeros&nbsp;<a href=\"http:\/\/www.theguardian.com\/australia-news\/2016\/feb\/02\/paul-pholeros-architect-who-helped-reduce-indigenous-poverty-dies-at-63\" target=\"_blank\">passed away<\/a>&nbsp;on February 1, 2016.&nbsp;<\/p>","slug":"paul_pholeros","published_at":"2013-06-19 16:45:00","updated_at":"2016-02-02 17:43:39"}}