{"speaker":{"id":1659,"title":"","firstname":"Peter","middleinitial":"","lastname":"Attia","description":"Surgeon","whotheyare":"Both a surgeon and a self-experimenter, Peter Attia hopes to ease the diabetes epidemic by challenging what we think we know and improving the scientific rigor in nutrition and obesity research. ","whylisten":"        <p class=\"p1\">Peter Attia has dedicated his medical career to investigating the relationship between nutrition, obesity and diabetes. A surgeon who developed metabolic syndrome himself despite the fact that he ate well and exercised often, Attia realized that our understanding of these important health issues may not actually be correct. From 2012-2015, he devoted himself to using vigorous scientific inquiry to test both our assumptions and new hypotheses through the&nbsp;<a href=\"http:\/\/nusi.org\/\" target=\"_blank\">Nutrition Science Initiative<\/a>, the nonprofit he co-founded with journalist Gary Taubes. Now in private practice, Attia writes the blog&nbsp;<a href=\"http:\/\/eatingacademy.com\/\" target=\"_blank\">Eating Academy<\/a>, which charts his own adventures in nutrition and examines scientific evidence surrounding food, weight loss and disease risk. Overall, he hopes to convince others that sharp increases in the rates of obesity and diabetes -- despite the fact that we are more culturally aware of these problems than ever -- might be a result of people being given the wrong information.<\/p> <p class=\"p1\">Attia came to this calling through an unusual path. While he was studying mechanical engineering as an undergrad, a personal experience led him to discover his passion for medicine. He enrolled at Stanford Medical School, and went on to a residency in general surgery at Johns Hopkins Hospital and a post-doctoral fellowship at the National Cancer Institute. After his residency, he joined the consulting firm McKinsey &amp; Company, where he worked on healthcare and financial system problems. The most valuable skill he learned along the way: to ask bold questions about medical assumptions.&nbsp;<\/p>","slug":"peter_attia","published_at":"2013-06-25 13:24:00","updated_at":"2017-01-23 13:25:14"}}