{"speaker":{"id":1666,"title":"","firstname":"Roberto D'Angelo + Francesca","middleinitial":"","lastname":"Fedeli","description":"Parents","whotheyare":"Roberto D'Angelo and Francesca Fedeli created the social enterprise FightTheStroke.org to open up a dialogue about the devastating effects of strokes at a young age. This issue is important to them for a simple reason: because they've been through it themselves with their son Mario.\r\n","whylisten":"<p>When Roberto D&#39;Angelo and Francesca Fedeli&rsquo;s son, Mario, was just 10 days old, he was diagnosed as having had a perinatal stroke in the right side of his brain, which left him unable to move the left side of his body. Through mirror neuron rehabilitation, Mario is now 5 years old and has greatly improved motion.<\/p><p>The tech-savvy couple founded FightTheStroke.org to gather and share the experiences of families who have been affected by all types of infant and childhood strokes. The social movement wants to open up a dialogue about the devastating effects of this traumatic event, advocating for young stroke survivors and using technology and open medicine as enablers for their better future. Together, as a family, they&rsquo;re promoting the awareness of this story as motivational speakers at events like TED, they&#39;re proud ambassaros of TEDMED in Italy and promoters of the first Medicine Hackathon in Italy, aimed to regroup the leading experts on Medicine and Innovation. Roberto is Director for Online Learning at Microsoft Italy, while Francesca currently focuses her management expertise in the&nbsp;<a href=\"http:\/\/fightthestroke.org\/\" target=\"_blank\">FightTheStroke.org<\/a> project, and they are developing an innovative rehabilitation platform based on Mirror Neurons. Francesca also acts as a member of various Board of Patients Associations, became an Eisenhower Fellow in 2014 and the first Ashoka Fellow in Italy in 2015.<\/p><p>&nbsp;<\/p>","slug":"roberto_and_francesca_d_angelo","published_at":"2013-07-24 13:32:00","updated_at":"2016-11-18 20:31:18"}}