{"speaker":{"id":167,"title":"","firstname":"Lawrence","middleinitial":"","lastname":"Lessig","description":"Legal activist","whotheyare":"Lawrence Lessig has already transformed intellectual-property law with his Creative Commons innovation. Now he's focused on an even bigger problem: The US' broken political system.","whylisten":"<p>Lawyer and activist Lawrence Lessig spent a decade arguing for sensible intellectual property law, updated for the digital age. He was a founding board member of <a href=\"http:\/\/creativecommons.org\/\" target=\"_blank\">Creative Commons<\/a>, an organization that builds better copyright practices through principles established first by the open-source software community.<\/p><p>In 2007, just after <a href=\"http:\/\/www.ted.com\/talks\/larry_lessig_says_the_law_is_strangling_creativity.html\" target=\"_blank\">his last TED Talk<\/a>, Lessig announced he was leaving the field of IP and Internet policy, and moving on to a more fundamental problem that blocks all types of sensible policy -- the corrupting influence of money in American politics.<\/p><p>In 2011, Lessig founded <a href=\"http:\/\/www.rootstrikers.org\/\" target=\"_blank\">Rootstrikers<\/a>, an organization dedicated to changing the influence of money in Congress. In his latest book, <em><a href=\"http:\/\/geni.us\/republiclost\" target=\"_blank\">Republic, Lost<\/a>, <\/em>he shows just how far the U.S. has spun off course -- and how citizens can regain control. As <em>The<\/em>&nbsp;<em>New York Times<\/em> wrote about him, &ldquo;Mr. Lessig&rsquo;s vision is at once profoundly pessimistic -- the integrity of the nation is collapsing under the best of intentions --and deeply optimistic. Simple legislative surgery, he says, can put the nation back on the path to greatness.&rdquo;<\/p><p>Read an excerpt of <a href=\"http:\/\/blog.ted.com\/2013\/04\/03\/how-we-can-make-elections-about-the-people-not-just-funders-an-excerpt-of-lawrence-lessigs-new-ted-book-lesterland\/\" target=\"_blank\">Lessig&#39;s new book, <em>Lesterland<\/em> &gt;&gt;<\/a> <\/p>","slug":"larry_lessig","published_at":"2007-11-06 01:56:00","updated_at":"2015-07-10 21:36:36"}}