{"speaker":{"id":1685,"title":"","firstname":"Amy","middleinitial":"","lastname":"Webb","description":"Founder and CEO, Future Today Institute","whotheyare":"Amy Webb is a futurist and founder of the Future Today Institute, and is the award-winning author of three books, including “Data: A Love Story” and “The Signals Are Talking: Why Today’s Fringe Is Tomorrow’s Mainstream.”","whylisten":"<p>Amy Webb uses data to understand the present and future of humanity, a practice she first developed as a journalist for the <em>Wall Street Journal<\/em> and <em>Newsweek<\/em> and has continued as a futurist. She is the head of the <a href=\"https:\/\/futuretodayinstitute.com\/\" target=\"_blank\">Future Today Institute<\/a>, which researches collisions between technology, society and business &mdash; and maps scenarios that are on the horizon. She was named to the Thinkers50 Radar list of the 30 management thinkers most likely to shape the future of how organizations are managed and led.  <\/p><p>Webb is on the adjunct faculty at the NYU Stern School of Business, where she teaches a popular MBA-level course on futures forecasting. She is the author of T<a href=\"https:\/\/www.amazon.com\/gp\/product\/1610396669\/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;tag=teco06-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=1610396669&amp;linkId=91ba90a27d7d1b706d33bd770852a5be\" target=\"_blank\"><em>he Signals Are Talking, Why Today&rsquo;s Fringe Is Tomorrow&rsquo;s Mainstream<\/em><\/a>, which has become the standard text on futures forecasting and explains how to predict and manage technological change. Her book <a href=\"https:\/\/www.amazon.com\/gp\/product\/0142180459\/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;tag=teco06-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=0142180459&amp;linkId=0a71a7928e0e946b29a9583b984425c6\" target=\"_blank\"><em>Data: A Love Story<\/em><\/a>  tells the tale of how she gamed the online dating system to figure out how to find the love of her life. <\/p>","slug":"amy_webb","published_at":"2013-10-02 15:14:00","updated_at":"2017-05-31 22:56:08"}}