{"speaker":{"id":1714,"title":"","firstname":"Meklit","middleinitial":"","lastname":"Hadero","description":"Singer-songwriter","whotheyare":"Meklit Hadero is an Ethiopian-American singer-songwriter living the cultural in-between, both in her own luminous compositions and as a co-founder of the Nile Project. ","whylisten":"<p>Meklit Hadero&#39;s music is imbued with poetry and multiplicity, from  hybridized sounds of Tizita (haunting and nostalgic music) drawing from  her Ethiopian heritage, to the annals of jazz, folk songs and rock &amp;  roll. Hadero describes her music as emanating from  &ldquo;in-between spaces,&rdquo; and the result is a smoky, evocative world peopled by strong bass, world instruments and her soothing voice.<\/p><p>In the Nile Project, founded along with Egyptian ethnomusicologist Mina Girgis, Hadero set out to explore the music of the Nile basin, pulling influences from countries along the river, from Uganda, Kenya, Tanzania, Ethiopia, South Sudan, Sudan, and finally to Egypt. The project brings together hip-hop, traditional and contemporary music, with instruments and traditions old and new. As she says, &quot;My work on a lot of levels is about multiplicity.&quot; Their new record is <a href=\"http:\/\/fellowsblog.ted.com\/2013\/10\/10\/the-nile-project-co-founded-by-ted-senior-fellow-meklit-hadero-releases-its-debut-album-aswan\" target=\"_blank\"><em>Aswan<\/em><\/a>.&nbsp; <\/p> <p>About her own music, here&#39;s what people say: <\/p><p>&ldquo;Soulful, tremulous and strangely cinematic, Meklit&rsquo;s voice will implant scenes in your mind &mdash; a softly lit supperclub, a Brooklyn stoop, a sun-baked road. Close your eyes, listen and dream.&quot; -- <em>Seattle Times<\/em><\/p><p>&quot;Meklit&hellip; combines N.Y. jazz with West Coast folk and African flourishes, all bound together by her beguiling voice, which is part sunshine and part cloudy day.&rdquo; -- <em>Filter Magazine<\/em><\/p>","slug":"meklit_hadero","published_at":"2013-11-13 10:57:00","updated_at":"2015-10-17 18:24:02"}}