{"speaker":{"id":1733,"title":"","firstname":"Diébédo Francis","middleinitial":"","lastname":"Kéré","description":"Community-minded architect","whotheyare":"Diébédo Francis Kéré and his architectural firm design buildings that are good for the environment -- and those who use them.","whylisten":"<p>Di&eacute;b&eacute;do Francis K&eacute;r&eacute; grew up in Gando, a small village in&nbsp;Burkina Faso. Having gone away to school, first within his country and then at the&nbsp;<a href=\"http:\/\/www.tu-berlin.de\/\" target=\"_blank\">Technische Universit&auml;t<\/a> in Berlin, Germany, he resolved to give back to the community that raised him. He does that through the power of architecture. <\/p> <p>Through his firm, <em>K&eacute;r&eacute; Architecture,<\/em> K&eacute;r&eacute; focuses on using local building materials and techniques in a modern way, to redefine and redesign the enviroment. In Burkina Faso, that means working predominantly with clay, and his innovative approach has seen the creation of remarkably beautiful, modern buildings that are entirely appropriate to the setting.<br \/> <br \/> His first building, a primary school in Gando, was completed in 2001 and received the&nbsp;<a href=\"http:\/\/www.akdn.org\/akaa_award9_awards_detail2.asp\" target=\"_blank\">Aga Khan Award for Architecture<\/a>. Since then, he has designed other structures for the village; his other work there has also won multiple awards, including the&nbsp;<a href=\"http:\/\/locus-foundation.org\/index2.htm\" target=\"_blank\">Global Award<\/a>, the&nbsp;<a href=\"http:\/\/www.bsi-swissarchitecturalaward.ch\/en\/Editions\/Seconda-edizione-2010\/Winner.html\" target=\"_blank\">BSI Swiss Architectural Award<\/a>, the&nbsp;<a href=\"http:\/\/www4.uwm.edu\/sarup\/school\/unique\/marcusprize\/\" target=\"_blank\">Marcus Prize<\/a>&nbsp;and the&nbsp;<a href=\"http:\/\/www.holcimfoundation.org\/T1586\/A12GLgoBFho-eng.htm\" target=\"_blank\">Global Holcim Award Gold 2012<\/a>.<\/p> <p>K&eacute;r&eacute; also teaches architecture; he has lectured at colleges including the University of Wisconsin Milwaukee, and Harvard. In 2013, he began teaching at the Accademia di Architettura in Mendrisio, Switzerland.<\/p>","slug":"diebedo_francis_kere","published_at":"2013-12-09 22:59:00","updated_at":"2013-12-10 15:31:29"}}