{"speaker":{"id":1774,"title":"","firstname":"Chris","middleinitial":"","lastname":"Hadfield","description":"Astronaut","whotheyare":"Tweeting (and covering Bowie) from the International Space Station last year, Colonel Chris Hadfield reminded the world how much we love space.","whylisten":"<p>&ldquo;Good morning, Earth.&rdquo; That is how Colonel Chris Hadfield, writing on Twitter, woke up the world every day while living aboard the International Space Station. In his five months on the ISS (including three as commander) Hadfield became a worldwide sensation, using social media to make outer space accessible and infusing a sense of wonder into the collective consciousness. Check out his cover version of <a href=\"http:\/\/www.youtube.com\/watch?v=KaOC9danxNo\" target=\"_blank\">David Bowie&#39;s &quot;Space Oddity,&quot;<\/a>  sung while floating in his tin can, far above the world ...<br \/>&nbsp;<br \/>Now back on our home planet, he continues to share the excitement of science and space travel. He&#39;s the author of the 2014 book&nbsp;<em><a href=\"http:\/\/geni.us\/astronautsguide\" target=\"_blank\">An Astronaut&#39;s Guide to Life on Earth<\/a><\/em>. As he says, &quot;There are no wishy-washy astronauts. You don&#39;t get up  there by being uncaring and blas&eacute;. And whatever gave you the sense of  tenacity and purpose to get that far in life is absolutely reaffirmed  and deepened by the experience itself.&quot;    A photography geek, in 2014 he also published an album of his photos from the shuttle: <em><a href=\"http:\/\/geni.us\/youarehere\" target=\"_blank\">You Are Here: Around the World in 92 Minutes<\/a><\/em>.<\/p><p>Hadfield is also a font of Canadian firsts: He was Canada&rsquo;s first shuttle mission specialist, and the first Canadian to board a Russian spacecraft (he helped build the <em>Mir<\/em>), do a spacewalk (he&#39;s done two), and of course, to command the International Space Station. <\/p><p>&nbsp;<\/p>","slug":"chris_hadfield","published_at":"2014-01-27 15:07:00","updated_at":"2015-07-10 20:30:34"}}