{"speaker":{"id":1784,"title":"","firstname":"Allan","middleinitial":"","lastname":"Adams","description":"Theoretical physicist","whotheyare":"Allan Adams is a theoretical physicist working at the intersection of fluid dynamics, quantum field theory and string theory. ","whylisten":"<p>Allan Adams is a theoretical physicist working at the intersection of fluid dynamics, quantum field theory and string theory. His research in theoretical physics focuses on string  theory both as a model of quantum gravity and as a strong-coupling  description of non-gravitational systems. <\/p><p>Like water, string theory enjoys many distinct phases in which the  low-energy phenomena take qualitatively different forms. In its most  familiar phases, string theory reduces to a perturbative theory of  quantum gravity. These phases are useful for studying, for example, the  resolution of singularities in classical gravity, or the set of  possibilities for the geometry and fields of spacetime. Along these  lines, Adams is particularly interested in microscopic quantization of  flux vacua, and in the search for constraints on low-energy physics  derived from consistency of the stringy UV completion.<\/p>In other phases, when the gravitational interactions become strong  and a smooth spacetime geometry ceases to be a good approximation, a  more convenient description of string theory may be given in terms of a  weakly-coupled non-gravitational quantum field theory. Remarkably, these  two descriptions&mdash;with and without gravity&mdash;appear to be completely  equivalent, with one remaining weakly-coupled when its dual is strongly  interacting. This equivalence, known as gauge-gravity duality, allows us  to study strongly-coupled string and quantum field theories by studying  perturbative features of their weakly-coupled duals. Gauge-gravity  duals have already led to interesting predictions for the quark-gluon  plasma studied at RHIC. A major focus of Adams&#39;s present research is to  use such dualities to find weakly-coupled descriptions of  strongly-interacting condensed matter systems which can be realized in  the lab.","slug":"allan_adams","published_at":"2014-01-27 18:38:00","updated_at":"2016-02-14 22:49:06"}}