{"speaker":{"id":1803,"title":"","firstname":"Shaka","middleinitial":"","lastname":"Senghor","description":"Author","whotheyare":"Using literature as a lifeline, Shaka Senghor escaped a cycle of prison and desperation. Now his story kindles hope in those who have little.","whylisten":"<p>At the age of 19, Shaka Senghor went to prison fuming with anger and despair. He was a drug dealer in Detroit, and one night, he shot and killed a man who showed up on his doorstep. While serving his sentence for second-degree murder, he discovered redemption and responsibility through literature -- starting with <em>The Autobiography of Malcolm X<\/em> -- and through his own writing.<\/p><p>Upon his release at the age of 38, Senghor reached out to young men following his same troubled path and&nbsp;was part of an outreach program bringing hope to kids in Detroit and across the Midwest. His memoir,&nbsp;<em><a href=\"http:\/\/geni.us\/writingmywrongs\" target=\"_blank\">Writing My Wrongs<\/a><\/em>, was published in 2016 and debuted on the <em>New York Times<\/em> and <em>Washington Post<\/em> bestseller lists.<\/p><p>Senghor is a former MIT Media Lab Director&#39;s Fellow and a former Fellow in the inaugural class of the W.K. Kellogg Foundation&rsquo;s Community Leadership Network. He&#39;s the recipient of numerous awards, including the 2012 Black Male Engagement Leadership Award, the 2015 Manchester University Innovator of the Year Award, the 2016 FORD Man of Courage Award and the 2016 NAACP Great Expectations Award. He was recognized by OWN (the Oprah Winfrey Network) as a &quot;Soul Igniter&quot; in the inaugural class of the SuperSoul 100. He has taught at the University of Michigan and shares his story of redemption around the world.<\/p><p>Today, Senghor&#39;s&nbsp;priority is shifting societal narratives through storytelling and developing workshops with high entertainment value and deep social impact. Transcending industries, he builds and executes global strategies, develops thought-focused leadership and cultural campaigns as a consultant for businesses and non-profits.<\/p>","slug":"shaka_senghor","published_at":"2014-02-21 14:37:00","updated_at":"2020-04-17 16:19:49"}}