{"speaker":{"id":1821,"title":"","firstname":"Aziza","middleinitial":"","lastname":"Chaouni","description":"Architect, ecotourism specialist","whotheyare":"Aziza Chaouni focuses on projects that integrate architecture and landscape, and that ultimately give back to their communities. For years, she has worked to revive the Fez River, which runs through her hometown of Fez, Morocco.","whylisten":"<p>Civil engineer and architect Aziza Chaouni creates sustainable, built environments in the developing world, focusing on the deserts of the Middle East. Chaouni&rsquo;s design philosophy holds that it is not enough for sustainable buildings to have zero impact&mdash;they must give back to the community on social, economic, infrastructural and environmental levels too.&nbsp;The founding principal of Aziza Chaouni Projects, she&nbsp;collaborates closely with local communities and experts from other disciplines to integrate architecture, landscape and infrastructure in innovative ways.<\/p><p>Born and raised in Fez, Morocco, Chaouni has long found herself fascinated with the Fez River, which winds through the city&#39;s ancient Medina. Once considered the city&#39;s soul, sending water to both public and private fountains, in the 1950s, the stream started to become a toxic sewer because of overcrowding, over-development and pollution. The city responded by covering the river over with concrete slabs, bit by bit, in the process destroying houses and creating dumping grounds. When Fez received a grant to divert and clean the river&#39;s water, Chaouni proposed the Fez River Project to uncover the river, restore its riverbanks and create pedestrian pathways. Her vision: to reclaim these areas as public spaces and reconnect them to the rest of the city.<\/p><p>A project that Chaouni has been working on for two decades, her mission to transform the Fez River began with her thesis in graduate school and has continued throughout her career. Over the course of years, the river is gradually being uncovered&mdash;illegal parking lots are being transformed into playgrounds, trees and vegetation are being planted to create public spaces. Overall, the project is revitalizing Fez as a living city.<\/p>        <p>&nbsp;<\/p>       ","slug":"aziza_chaouni","published_at":"2014-03-17 18:03:00","updated_at":"2022-03-02 19:29:02"}}