{"speaker":{"id":1826,"title":"","firstname":"Janet","middleinitial":"","lastname":"Iwasa","description":"Molecular animator","whotheyare":"Janet Iwasa's colorful, action-packed 3D animations bring scientific hypotheses to life.","whylisten":"<p>While we know a lot about molecular processes, they can&rsquo;t be observed directly, and scientists have to rely on simple, two-dimensional drawings to depict complex hypotheses. That is, they did until now. Janet Iwasa, a TED Senior Fellow, creates 3D animations that show how we think molecules look, move and interact. Molecular animation a powerful way to illustrate ideas, convey information to general audiences and inspire new research. Over the years, she has collaborated with numerous biologists to reveal the beauty and chaos of life at the molecular scale. In addition to producing animations and running a research lab, she develops software tools that will allow researchers to intuitively and quickly create animated molecular models. In 2014, her work resulted in the release of&nbsp;<a href=\"https:\/\/molecularflipbook.org\" target=\"_blank\">Molecular Flipbook<\/a>, a free, open-source animation software that allows biologists to create molecular animations of their own hypotheses in just 15 minutes.&nbsp;&nbsp;<\/p><p>Iwasa is an Assistant Professor of Biochemistry at the University of Utah. She received her PhD from the University of California, San Francisco in 2006. As a postdoctoral fellow, she created a multimedia exhibit with Nobel Laureate Jack Szostak (Harvard University) and the Museum of Science, Boston after which she worked on biological visualizations at Harvard Medical School. Her award-winning illustrations and animations have appeared in scientific journals including <em>Nature<\/em>, <em>Science and Cell<\/em>&nbsp;and&nbsp;<em>The&nbsp;New York Times<\/em>. She has been recognized as one of the &quot;100 Leading Global Thinkers&quot; of 2014 by <em>Foreign Policy<\/em> magazine and one of the &quot;100 Most Creative People&quot; of 2012 by <em>Fast Company<\/em> magazine.<\/p>","slug":"janet_iwasa","published_at":"2014-03-17 18:50:00","updated_at":"2020-04-13 14:22:16"}}