{"speaker":{"id":1832,"title":"","firstname":"Somi","middleinitial":"","lastname":"","description":"Vocalist, composer and culturist","whotheyare":"With her lustrous voice and wide-ranging musical curiosity, Somi spins elegant vocal jazz from African legacies.\r\n","whylisten":"<p>In late 2011, East African vocalist and songwriter Somi moved from New York City to Lagos, Nigeria, for 18 months in search of new inspiration. The result: her chart-topping 2014 major label debut,&nbsp;<a href=\"http:\/\/geni.us\/lagosmusicsalon\" target=\"_blank\"><em>The Lagos Music Salon<\/em><\/a>&nbsp;(Sony Music)<em>.<\/em> The album, with guests Angelique Kidjo, Common and Ambrose Akinmusire, draws its material from the tropical city&#39;s boastful cosmopolitanism, urgent inspiration and giant spirit, straddling the worlds of African jazz, soul and pop with a newfound ease and voice that&nbsp;<a href=\"http:\/\/www.vogue.com\/874103\/somi\/\" target=\"_blank\">Vogue Magazine<\/a> calls &quot;powerful.&quot;<\/p><p>Born in Illinois to immigrants from Rwanda and Uganga, African and Jazz legacies are crucial to Somi&#39;s sound. Referred to as a modern-day Miriam Makeba,&nbsp;<a href=\"http:\/\/jazztimes.com\/articles\/19461-red-soil-in-my-eyes-somi\" target=\"_blank\"><em>JazzTimes<\/em> magazine<\/a> describes her performance as &quot;the earthy gutsiness of Nina Simone blended with the fluid vocal beauty of Dianne Reeves,&quot; while <em>Billboard<\/em> remarks that she&#39;s &quot;all elegance and awe... utterly captivating.&quot;&nbsp;<\/p><p>In 2013, Somi was invited by Secretary General Ban Ki-Moon to perform at the United Nations&#39; General Assembly in commemoration of the International Day of Rememberance of the Victims of Slavery and the Transatlantic Slave Trade. &nbsp;<\/p><p>A TED Senior Fellow, inaugural Association of Performing Arts Presenters Fellow, founder of the non-profit New Africa Live, and a two-time recipient of the Doris Duke Foundation&#39;s French-American Jazz Exchange Composers&rsquo; Grant, Somi began an exploration of African and Arab jazz traditions alongside French-Lebanese trumpeter Ibrahim Maalouf, while investigating the role of the female voice during the Arab Spring protests. That body of work was premiered at the Kennedy Center&rsquo;s 2014 Mary Lou Williams Jazz Festival. Somi is a 2015 Artist-in-Residence at UCLA&#39;s Center for the Art of Performance and The Robert Rauschenberg Foundation.<\/p><p>She is currently working on a jazz opera about the life and legacy of South African singer and activist Miriam Makeba.<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>","slug":"somi_kakoma","published_at":"2014-03-17 20:45:00","updated_at":"2015-09-25 21:40:28"}}