{"speaker":{"id":1838,"title":"","firstname":"Andrew","middleinitial":"","lastname":"Bastawrous","description":"Eye surgeon, inventor","whotheyare":"TED Fellow Andrew Bastawrous studies eye health -- and builds accessible new tools to bring eye care to more people.","whylisten":"<p>Andrew Bastawrous is cofounder and CEO of&nbsp;<a href=\"https:\/\/www.peekvision.org\/\" target=\"_blank\">Peek Vision<\/a>, a social impact organization that uses smartphone technology to radically increase access to eye care in some of the most challenging places in the world. Bastawrous&nbsp;is also an ophthalmologist (eye surgeon) and Associate Professor in International Eye Health at the London School of Hygiene and Tropical Medicine.<\/p><p>Peek&#39;s vision app,&nbsp;<a href=\"https:\/\/www.peekvision.org\/en_GB\/peek-solutions\/peek-acuity\/\" target=\"_blank\">Peek Acuity<\/a>, is being used to transform eye health in more than 150 countries. The organization ran one of the top-ten all-time Indiegogo&nbsp;<a href=\"https:\/\/www.indiegogo.com\/projects\/peek-retina-help-fight-avoidable-blindness#\/\" target=\"_blank\">crowd-funding campaigns<\/a> in the health sector -- for Peek Retina, a smartphone ophthalmoscope -- and&nbsp;was voted &quot;best social-impact start-up in Europe&quot; by Google and McKinsey in 2016.&nbsp;All prize money has been re-invested in Peek.<\/p><p>Bastawrous is working with astrophysicists to&nbsp;<a href=\"https:\/\/www.zooniverse.org\/projects\/zooniverse\/field-of-vision\/\" target=\"_blank\">crowdsource retinal data<\/a>; with <em>National Geographic<\/em> explorers to reach isolated communities; and with artists and activists to advocate for eye care globally. He and his wife Madeleine have established a&nbsp;<a href=\"https:\/\/www.theguardian.com\/world\/2016\/aug\/10\/hackney-kenya-sourdough-bakeries-tackling-blindness\" target=\"_blank\">social enterprise healthy bakery<\/a> in Kenya that provides employment, with profits paying for eye care.<\/p><p>In 2018, Bastawrous&nbsp;was invited to deliver the&nbsp;<a href=\"https:\/\/www.peekvision.org\/en_GB\/news\/story\/commonwealth-service-2018-dr-andrew-bastawrous-reflection\" target=\"_blank\">Commonwealth Address<\/a> in the presence of the British Royal Family, where he announced the creation of a new one-billion-dollar Vision Catalyst Fund -- a new vision for international aid.<\/p>","slug":"andrew_bastawrous","published_at":"2014-03-17 21:15:00","updated_at":"2019-06-12 17:02:28"}}