{"speaker":{"id":1840,"title":"","firstname":"Will","middleinitial":"","lastname":"Potter","description":"Investigative journalist","whotheyare":"Award-winning journalist and author, Will Potter focuses on the animal rights and environmental movements, and civil liberties in the post-9\/11 era.","whylisten":"<p>Independent journalist and TED Fellow Will Potter is based in Washington, D.C.; his current work examines how whistleblowers and non-violent protesters are being treated as terrorists.   <\/p><p>The author of <em><a href=\"http:\/\/www.greenisthenewred.com\/blog\/book\">Green Is The New Red: An Insider&#39;s Account of a Social Movement Under Siege<\/a><\/em>, Potter has extensively documented how non-violent protest is slowly being criminalized.<em> <\/em>His reporting and commentary have been featured in the world&#39;s top media outlets, including the <em>Washington Post<\/em>, NPR, <em>Rolling Stone<\/em>, <em>El Pais<\/em>, and <em>Le Monde<\/em>. He has testified before the U.S. Congress about his reporting, as the <a href=\"http:\/\/www.greenisthenewred.com\/blog\/congressional-testimony\/\">only witness opposing the Animal Enterprise Terrorism Act<\/a> -- and he is a plaintiff in the first lawsuits challenging so-called &quot;ag-gag&quot; laws as unconstitutional.<\/p><p>Will has also lectured at many universities and public forums about his work, including Georgetown University, Harvard Law School, and the House of Democracy and Human Rights in Berlin. International speaking tours have included Germany, Austria, Switzerland, New Zealand, and Spain, and he was the international guest lecturer for Australia&#39;s 2014 animal law lecture series.<\/p><p>His reporting has <a href=\"http:\/\/www.greenisthenewred.com\/blog\/first-ag-gag-arrest-utah-amy-meyer\/6948\/\">overturned criminal prosecutions<\/a>, and it has both been praised in <a href=\"http:\/\/www.greenisthenewred.com\/blog\/domestic-terrorist-threat-congressional-report\/6418\/\">Congressional reports<\/a> and monitored by the <a href=\"http:\/\/www.greenisthenewred.com\/blog\/counter-terrorism-unit-keeps-files-on-journalists\/6247\/\">Counter-Terrorism Unit<\/a>.<\/p>","slug":"will_potter","published_at":"2014-03-17 21:27:00","updated_at":"2014-06-11 13:45:23"}}