{"speaker":{"id":1843,"title":"","firstname":"Edward","middleinitial":"","lastname":"Snowden","description":"Whistleblower","whotheyare":"In 2013 Edward Snowden leaked thousands of classified American National Security Agency documents, sparking a global conversation about citizens' rights to privacy on the Internet.","whylisten":"<p>Edward Snowden was just about to turn 28 when his face was suddenly splashed across every major newspaper in the US. In the summer of 2013 <em>The Guardian<\/em> published a series of leaked documents about the American National Security Agency (NSA), starting with <a href=\"http:\/\/www.theguardian.com\/world\/2013\/jun\/06\/nsa-phone-records-verizon-court-order\" target=\"_blank\">an article<\/a>  about a secret court order demanding American phone records from Verizon, followed by <a href=\"http:\/\/www.theguardian.com\/world\/2013\/jun\/06\/us-tech-giants-nsa-data\" target=\"_blank\">an article<\/a>  on the NSA&#39;s top-secret Prism program, said to be accessing user data from Google, Apple and Facebook. <\/p><p>It wasn&#39;t long before Snowden <a href=\"http:\/\/www.theguardian.com\/world\/2013\/jun\/09\/edward-snowden-nsa-whistleblower-surveillance\" target=\"_blank\">came forward<\/a>  as the source, revealing that he had carefully planned the leak, copying documents when he was working as a contractor for the NSA. &quot;I understand that I will be made to suffer for my actions,&quot; he <a href=\"http:\/\/www.theguardian.com\/world\/2013\/jun\/09\/edward-snowden-nsa-whistleblower-surveillance\" target=\"_blank\">said<\/a> at the time, but &quot;I will be satisfied if the federation of secret law, unequal pardon and irresistible executive powers that rule the world that I love are revealed even for an instant.&quot; Snowden&#39;s actions have led to a global debate on the relationship between national security and online privacy. His leaks continue to have a lasting impact on the American public&#39;s view of the government, and has encouraged media scrutiny on the NSA.<\/p><p>Snowden had coordinated the leak with journalist Glenn Greenwald and filmmaker Laura Poitras from Hong Kong; after he revealed his identity, he fled and ended up in Moscow. Under charges of espionage by the American government, Snowden remains in Russia in temporary asylum.<\/p>","slug":"edward_snowden","published_at":"2014-03-18 18:08:00","updated_at":"2014-03-18 23:27:41"}}