{"speaker":{"id":1845,"title":"","firstname":"Richard","middleinitial":"","lastname":"Ledgett","description":"Deputy director, NSA","whotheyare":"Richard Ledgett is deputy director and senior civilian leader of the National Security Agency. He acts as the agency’s chief operating officer, responsible for guiding and directing studies, operations and policy.","whylisten":"<p>Richard Ledgett began his NSA career in 1988 and has served in operational, management, and technical leadership positions at the branch, division, office, and group levels. Now, think of him as the COO of the NSA, guiding and directing studies, operations and policy. From 2012 to 2013 he was the Director of the NSA\/CSS Threat Operations Center, responsible for round-the-clock cryptologic activities to discover and counter adversary cyber efforts. Prior to NTOC he served in several positions from 2010 to 2012 in the Office of the Director of National Intelligence in both the collection and cyber mission areas. He was the first National Intelligence Manager for Cyber, serving as principal advisor to the Director of National Intelligence on all cyber matters, leading development of the Unified Intelligence Strategy for Cyber, and coordinating cyber activities across the Intelligence Community (IC). Previous positions at NSA include Deputy Director for Analysis and Production (2009-2010), Deputy Director for Data Acquisition (2006-2009), Assistant Deputy Director for Data Acquisition (2005-2006), and Chief, NSA\/CSS Pacific (2002-2005). He also served in a joint IC operational activity, and as an instructor and course developer at the National Cryptologic School. <\/p><p> He led the NSA Media Leaks Task Force from June 2013 to January 2014,  and was responsible for integrating and overseeing the totality of NSA&rsquo;s  efforts surrounding the unauthorized disclosures of classified  information by a former NSA affiliate. <\/p>","slug":"rick_ledgett","published_at":"2014-03-20 00:17:00","updated_at":"2014-03-21 00:40:21"}}