{"speaker":{"id":187,"title":"","firstname":"Chris","middleinitial":"","lastname":"Anderson","description":"Head of TED","whotheyare":"After a long career in journalism and publishing, Chris Anderson became the curator of the TED Conference in 2002 and has developed it as a platform for identifying and disseminating ideas worth spreading.","whylisten":"<p class=\"p1\">Chris Anderson is the Curator of TED, a nonprofit devoted to sharing valuable ideas, primarily through the medium of &#39;TED Talks&#39; -- short talks that are offered free online to a global audience.<\/p><p class=\"p1\">Chris was born in a remote village in Pakistan in 1957. He spent his early years in India, Pakistan and Afghanistan, where his parents worked as medical missionaries, and he attended an American school in the Himalayas for his early education. After boarding school in Bath, England, he went on to Oxford University, graduating in 1978 with a degree in philosophy, politics and economics.<\/p><p class=\"p1\">Chris then trained as a journalist, working in newspapers and radio, including two years producing a world news service in the Seychelles Islands.<\/p><p class=\"p1\"> Back in the UK in 1984, Chris was captivated by the personal computer revolution and became an editor at one of the UK&#39;s early computer magazines. A year later he founded Future Publishing with a $25,000 bank loan. The new company initially focused on specialist computer publications but eventually expanded into other areas such as cycling, music, video games, technology and design, doubling in size every year for seven years. In 1994, Chris moved to the United States where he built Imagine Media, publisher of <em>Business 2.0<\/em> magazine and creator of the popular video game users website IGN. Chris eventually merged Imagine and Future, taking the combined entity public in London in 1999, under the Future name. At its peak, it published 150 magazines and websites and employed 2,000 people.<\/p><p class=\"p1\">This success allowed Chris to create a private nonprofit organization, the Sapling Foundation, with the hope of finding new ways to tackle tough global issues through media, technology, entrepreneurship and, most of all, ideas. In 2001, the foundation acquired the TED Conference, then an annual meeting of luminaries in the fields of Technology, Entertainment and Design held in Monterey, California, and Chris left Future to work full time on TED.<\/p><p class=\"p1\">He expanded the conference&#39;s remit to cover all topics, including science, business and key global issues, while adding a Fellows program, which now has some 300 alumni, and the TED Prize, which grants its recipients &quot;one wish to change the world.&quot; The TED stage has become a place for thinkers and doers from all fields to share their ideas and their work, capturing imaginations, sparking conversation and encouraging discovery along the way.<\/p><p class=\"p1\">In 2006, TED experimented with posting some of its talks on the Internet. Their viral success encouraged Chris to begin positioning the organization as a global media initiative devoted to &#39;ideas worth spreading,&#39; part of a new era of information dissemination using the power of online video. In June 2015, the organization posted its 2,000th talk online. The talks are free to view, and they have been translated into more than 100 languages with the help of volunteers from around the world. Viewership has grown to approximately one billion views per year.<\/p><p class=\"p1\">Continuing a strategy of &#39;radical openness,&#39; in 2009 Chris introduced the TEDx initiative, allowing free licenses to local organizers who wished to organize their own TED-like events. More than 8,000 such events have been held, generating an archive of 60,000 TEDx talks. And three years later, the TED-Ed program was launched, offering free educational videos and tools to students and teachers.<\/p>","slug":"chris_anderson_ted","published_at":"2008-01-30 00:42:00","updated_at":"2020-07-20 19:09:41"}}