{"speaker":{"id":1900,"title":"","firstname":"Wes","middleinitial":"","lastname":"Moore","description":"Author, advocate","whotheyare":"Wes Moore's life transformed with these words out of his mother's mouth: \r\n\"I'm sending you to military school.\" The author of the book, \"The Other Wes Moore,\" he is now a vocal advocate for America's youth as well as for fellow veterans returning from Iraq and Afghanistan.","whylisten":"        <p class=\"p1\">Wes Moore grew up in Maryland in the early &#39;80s and, after his father passed away when he was three years old, he started acting up. Eventually, at age 13, his mother sent him away to military school. This turned out to be a life-changing experience. He adjusted well to the rigid order and took off academically, going on to study International Relations at Oxford University on a Rhodes Scholarship.&nbsp;<\/p> <p class=\"p1\">In his bestselling book&nbsp;<a href=\"https:\/\/www.amazon.com\/Other-Wes-Moore-Name-Fates\/dp\/0385528205\" target=\"_blank\"><em>The Other Wes Moore<\/em><\/a><em>,&nbsp;<\/em>he takes a hard look at how his life might have unfolded. He does this by interviewing a man who shares his name and had a similar upbringing, but who is serving life in prison for the murder of a Baltimore police officer. It&#39;s a beautifully-told tale that shows how lives pivot on circumstance. Moore donates a portion of the book&#39;s proceeds to charities focused on empowering America&#39;s youth.&nbsp;<\/p> <p class=\"p1\">A paratrooper and Captain in the United States Army who served a tour of duty in Afghanistan, Moore is also an advocate for veterans. In the PBS special&nbsp;<a href=\"http:\/\/www.pbs.org\/coming-back-with-wes-moore\/home\/\" target=\"_blank\"><em>Coming Back Home with Wes Moore<\/em><\/a>, he uses his interviewing chops to talk to other veterans about their experiences returning from Iraq and Afghanistan. Moore is also the host of <em>Beyond Belief<\/em> on the Oprah Winfrey Network.<\/p>","slug":"wes_moore","published_at":"2014-05-23 14:21:00","updated_at":"2018-05-28 15:41:04"}}