{"speaker":{"id":193,"title":"","firstname":"Pamelia","middleinitial":"","lastname":"Kurstin","description":"Theremin player","whotheyare":"Pamelia Kurstin excavates a dusty artifact from the prehistoric strata of electronic music -- and demonstrates how to squeeze soul from an instrument you can't even touch.","whylisten":"<p>The theremin, the first electronic instrument ever invented, was on the brink of historic oblivion when it was rescued from obscurity  by director Steven Martin&#39;s classic 1994 documentary <a href=\"http:\/\/www.imdb.com\/title\/tt0108323\/\" target=\"_blank\"><em>Theremin: An Electronic Odyssey<\/em><\/a> . And while a few brave souls have sought to master this temperamental instrument since then, none have done so with more sly effervescence than Pamelia Kurstin. <\/p><p>From the rock-steady composure she assumes behind the instrument (necessary lest her breathing drive the sensors out of tune), one might presume a shrinking conservatory personality, but a quick glance at the <a href=\"http:\/\/www.myspace.com\/pameliakurstin\" target=\"_blank\">MySpace page<\/a>&nbsp;of the self-described &quot;bird-punching rollerskating thereminist&quot; will quickly dash any of these quaint notions. Far from being a quirky curiosity, however, Kurstin is a sensitive, emotional stylist capable of coaxing sublime melodic content  out of an instrument usually doomed to B-movie sci-fi soundtracks. (And her walking bass imitation is pretty cool too.)<\/p><p>Born in Los Angeles, Kurstin currently resides in Vienna, and performs with her latest project <a href=\"http:\/\/www.blueblut.net\/\" target=\"_blank\">Blueblut<\/a>, among many others. Her latest solo CD, <em><a href=\"http:\/\/www.tzadik.com\/index.php?catalog=7717\" target=\"_blank\">Thinking Out Loud<\/a>,<\/em> was released in 2007 on John Zorn&#39;s legendary <a href=\"http:\/\/www.tzadik.com\/\" target=\"_blank\">Tzadik<\/a>  label. She&#39;ll bathe your dog and give you a haircut (&quot;if you&#39;re daring,&quot; she warns) in exchange for a six-pack.<\/p>","slug":"pamelia_kurstin","published_at":"2008-02-13 02:39:00","updated_at":"2014-12-15 17:14:13"}}