{"speaker":{"id":1940,"title":"","firstname":"Lorrie Faith","middleinitial":"","lastname":"Cranor","description":"Security researcher","whotheyare":"At Carnegie Mellon University, Lorrie Faith Cranor studies online privacy, usable security, phishing, spam and other research around keeping us safe online.","whylisten":"<p><a href=\"http:\/\/lorrie.cranor.org\/\">Lorrie Faith Cranor<\/a> is an Associate Professor of Computer Science and of Engineering and Public Policy at <a href=\"http:\/\/www.scs.cmu.edu\/\" target=\"_blank\">Carnegie Mellon University<\/a>, where she is director of the <a href=\"http:\/\/cups.cs.cmu.edu\/\" target=\"_blank\">CyLab Usable Privacy and Security Laboratory (CUPS)<\/a>  and co-director of the <a href=\"http:\/\/privacy.cs.cmu.edu\/\" target=\"_blank\">MSIT-Privacy Engineering<\/a>  masters program. She was a co-founder of Wombat Security Technologies, acquired in 2018 by&nbsp;<a href=\"https:\/\/www.cmu.edu\/news\/stories\/archives\/2018\/march\/wombat-security-acquired.html\" target=\"_blank\">Proofpoint<\/a>. She has authored over 100 research papers on online privacy, usable security, phishing, spam, electronic voting, anonymous publishing, and other topics. <\/p><p>Cranor plays a key role in building the usable privacy and security research community, having co-edited the seminal book&nbsp;<a href=\"http:\/\/geni.us\/securityusability\" target=\"_blank\"><em>Security and Usability<\/em><\/a>&nbsp;and founded the Symposium On Usable Privacy and Security (SOUPS). She also chaired the Platform for Privacy Preferences Project (P3P) Specification Working Group at the W3C and authored the book&nbsp;<a href=\"http:\/\/geni.us\/webprivacy\" target=\"_blank\"><em>Web Privacy with P3P<\/em><\/a>. She has served on a number of boards, including the Electronic Frontier Foundation Board of Directors, and on the editorial boards of several journals. In 2003 she was named one of the top 100 innovators 35 or younger by <em>Technology Review.<\/em> <\/p>","slug":"lorrie_faith_cranor","published_at":"2014-06-24 14:58:00","updated_at":"2018-10-23 19:46:59"}}