{"speaker":{"id":1945,"title":"","firstname":"Simon","middleinitial":"","lastname":"Anholt","description":"Policy advisor","whotheyare":"After 20 years working with the presidents and prime ministers of 54 countries, Simon Anholt has a plan to make the world work better.","whylisten":"<p>For 20 years, Simon Anholt has worked with the presidents, prime ministers and governments of more than fifty nations, devising strategies and policies to help them to engage more imaginatively and productively with the international community.&nbsp;<\/p><p>In 2014, impatient to do better, Anholt founded the&nbsp;<a href=\"http:\/\/www.goodcountry.org\" target=\"_blank\">Good Country<\/a>, a project aimed at helping countries work together to tackle global challenges like climate change, poverty, migration and terrorism, by mobilizing&nbsp;&quot;the only superpower left on the planet: global public opinion.&quot;<\/p><p>According to&nbsp;<a href=\"http:\/\/www.independent.co.uk\/news\/uk\/home-news\/ireland-is-the-best-country-in-the-world-according-to-good-country-index-9557358.html\" target=\"_blank\">The Independent<\/a>, Anholt&#39;s aim is to change the way countries, cities and companies work &quot;...by us all encouraging their leaders to think about the global impact of their actions, rather than cut-throat self-interest.&quot;<\/p><p>Measurement of Good Country progress is done through Anholt&#39;s&nbsp;<a href=\"https:\/\/goodcountry.org\/index\/overall-rankings\" target=\"_blank\">Good Country Index<\/a>, the only survey to rank countries according to their contribution to humanity and the planet rather than their domestic performance. According to&nbsp;<a href=\"https:\/\/www.theguardian.com\/politics\/2014\/nov\/30\/simon-anholt-good-country-party-global-superpower-public-opinion\" target=\"_blank\">The Guardian<\/a>,&nbsp;&quot;He has built his career in part as a formidable cruncher of data.&quot; Since 2005, his research into global perceptions of nations and cities has collected and analyzed over 300 billion data points.&nbsp;<\/p><p>In 2016, Anholt launched the&nbsp;<a href=\"http:\/\/www.globalvote.org\/\" target=\"_blank\">Global Vote<\/a>, a project that enables anybody in the world to vote in other countries&#39; elections, choosing the candidate who is likely to do most for humanity and the planet: three months later over 100,000 people from 130 countries took part in the Global Vote on the US Presidential Election. The Global Vote now covers an election somewhere in the world almost every month.<\/p><p>Anholt is an Honorary Professor of Political Science and the author of five books about countries, cultures and globalisation. He is the founder and Editor Emeritus of a leading academic journal focused on public diplomacy and perceptions of places.<\/p><p>&nbsp;<\/p>","slug":"simon_anholt","published_at":"2014-06-24 16:57:00","updated_at":"2017-03-22 20:23:39"}}