{"speaker":{"id":1949,"title":"","firstname":"Jeremy","middleinitial":"","lastname":"Heimans","description":"Activist","whotheyare":"At Purpose, Jeremy Heimans strategizes how to harness new social, economic and technological models to build movements with impact.","whylisten":"        <p>Jeremy Heimans has been building movements since childhood, when he ran precocious fax campaigns on issues such as environmental conservation and third world debt in his native Australia. A former McKinsey strategy consultant, he has co-founded several online campaign groups and citizen activism initiatives, including&nbsp;<a href=\"https:\/\/www.getup.org.au\/\" target=\"_blank\">GetUp<\/a>&nbsp;(an Australian political movement with more members than Australia&#39;s political parties combined),&nbsp;<a href=\"http:\/\/www.avaaz.org\/en\/\" target=\"_blank\">Avaaz<\/a>&nbsp;(an online political movement with more than 40 million members) and&nbsp;<a href=\"https:\/\/www.allout.org\/en\" target=\"_blank\">AllOut<\/a>&nbsp;(a global movement for LGBT people and their straight friends and family).&nbsp;<\/p>                          <p class=\"p1\">Now based in New York, Heimans is co-founder and CEO of&nbsp;<a href=\"http:\/\/www.purpose.com\/\" target=\"_blank\">Purpose<\/a>, a social business that builds movements and ventures that he says, &ldquo;uses the power of participation to bring change in the world.&rdquo; He and colleague Henry Timms, executive director of 92nd Street Y, a cultural and community center in New York, and founder of #GivingTuesday, are set to publish an essay in November 2014 examining new forms of power and their meaning. As Heimans puts it, &ldquo;Old power downloads and commands; new power uploads and shares.&rdquo;<\/p> <p class=\"p1\">The World Economic Forum at Davos named Heimans a Young Global Leader and in 2011 he was awarded the Ford Foundation&#39;s 75th Anniversary Visionary Award. In 2012, Fast Company named him one of the Most Creative People in Business, and in 2014, CNN picked his concept of &quot;new power&quot; as <a href=\"http:\/\/edition.cnn.com\/2014\/12\/31\/tech\/cnn-10-ideas-new-power\/index.html\" target=\"_blank\">one of 10 ideas to change the world<\/a>.&nbsp;<\/p>","slug":"jeremy_heimans","published_at":"2014-06-24 21:48:00","updated_at":"2015-01-05 19:23:34"}}