{"speaker":{"id":1993,"title":"","firstname":"","middleinitial":"","lastname":"Black Label Movement","description":"Dance troupe","whotheyare":"Black Label Movement is an explosively physical Minneapolis dance company.","whylisten":"<p>Black Label Movement  is a Twin Cities-based dance theater dedicated to creating wildly  physical, naturally virtuosic, intellectually and emotionally engaging  art. Led by Carl Flink, this collective of dance artists seeks to push  the mind, body, and heart to the edge of what is possible and beyond. <\/p><p>A one-time company member  and soloist with the New York City-based <a href=\"\/admin.php\/speakers\/edit\/speakerid\/www.limon.org\" target=\"_blank\">Lim&oacute;n Dance Company<\/a>, Flink is known for choreography with intense athleticism, daring risk  taking and humanistic themes that address diverse social, scientific,  political and working class subjects in addition to more abstract dance  approaches. He is also the endowed Nadine Jette Sween Professor of Dance and Chair of the Department of <a href=\"\/admin.php\/speakers\/edit\/speakerid\/theatre.umn.edu\" target=\"_blank\">Theatre Arts and Dance<\/a>   at the University of Minnesota-Twin Cities.&nbsp; Beyond the dance world, he graduated from Stanford Law  School in 2001 and worked as a staff attorney with Farmers&#39; Legal Action  Group, Inc. protecting the legal rights of low-income family farmers  and promoting sustainable agriculture until 2004. <\/p><p><strong>Credits for the TEDxBrussels performance:<\/strong><br \/>BLM  Movers: Jessica Ehlert, Brian Godbout, Stephanie Laager, Edward  Oroyan,  Nelle Hens, Camille Prieux, Mariel Blaise, Gapson Nenaks, David  Zagari  &amp; Marcio Canabarro <\/p><p>Music: <a href=\"http:\/\/gregbrosofske.com\/\">Greg Brosofske<\/a> (and you can <a href=\"http:\/\/gregbrosofske.com\/2011\/11\/14\/score-for-spacewalk-in-brussels\/\" target=\"_blank\">download the music<\/a>)<a href=\"http:\/\/gregbrosofske.com\/\"><br \/><\/a><\/p>Support from the <a href=\"http:\/\/ias.umn.edu\/\">Institute for Advanced Studies at the University of Minnesota<\/a> was crucial. <p>&nbsp;<\/p>","slug":"black_label_movement","published_at":"2014-06-30 20:56:00","updated_at":"2014-06-30 21:56:55"}}