{"speaker":{"id":2019,"title":"","firstname":"Karima","middleinitial":"","lastname":"Bennoune","description":"Professor of international law","whotheyare":"Karima Bennoune's new book introduces the world to people who speak out against fundamentalist terrorism.","whylisten":"<p>Karima Bennoune is a professor of international law at the University of California&ndash;Davis School of Law. She grew up in Algeria and the United States and now lives in northern California.<br \/><br \/>She has published widely in many leading academic journals, as well as in the Guardian, The New York Times, Comment is Free, the website of Al Jazeera English, The Nation. The topic of her most recent publication &lsquo;Your Fatwa Does Not Apply Here&rsquo; is a very personal one for her. Her father Mahfoud Bennoune was an outspoken professor at the University of Algiers, and faced death threats during the 1990s, but continued speaking out against fundamentalism and terrorism. In writing this book, Karima set out to meet people who are today doing what her father did back then, to try to garner for them greater international support than Algerian democrats received during the 1990s.<br \/><br \/>She has served as a member of the Executive Council of the American Society of International Law and on the board of directors of Amnesty International USA. Currently, she sits on the Board of the Network of Women Living Under Muslim Laws. She has also been a consultant on human rights issues for the International Council on Human Rights Policy, the Soros Foundation, the Coalition to Stop the Use of Child Soldiers, and for the United Nations Educational, Scientific and Cultural Organization (UNESCO). Her human rights field missions have included Afghanistan, Bangladesh, Fiji, Lebanon, Pakistan, South Korea, southern Thailand, and Tunisia.<br \/><br \/>She traveled to Algeria in February 2011 to serve as an observer at pro-democracy protests with the support of the Urgent Action Fund for Women&rsquo;s Human Rights, writing a series of articles about these events for the Guardian. In October 2011, she volunteered as an election observer during the Tunisian constituent assembly elections with Gender Concerns International.<\/p>","slug":"karima_bennoune","published_at":"2014-07-10 14:52:00","updated_at":"2015-01-21 21:18:59"}}