{"speaker":{"id":2023,"title":"","firstname":"Rishi","middleinitial":"","lastname":"Manchanda","description":"Physician","whotheyare":"Rishi Manchanda is an \"upstreamist.\" A physician and public health innovator, he aims to reinvigorate primary care by teaching doctors to think about—and treat—the social and environmental conditions that often underly sickness.","whylisten":"<p>For a decade, Rishi Manchanda has worked as a doctor in South Central Los Angeles, treating patients who live and work in harsh conditions. He has worked at the Venice Family Clinic, one of the largest free clinics in the United States. He was the first director of social medicine at the St. John&rsquo;s Well Child and Family Center in Compton, where he and his team provided high quality primary care to low-income families in the area. Currently, he is the medical director of a veterans&rsquo; clinic within the Greater Los Angeles Healthcare System, which he refers to as an &ldquo;intensive caring unit.&rdquo; He tells the National Health Corps Services, &ldquo;The moment when a patient switches from despair to hopefulness is the greatest part of my service.&rdquo;&nbsp;<\/p>   <p>Manchanda is the author of the TED Book&nbsp;<a href=\"http:\/\/geni.us\/upstreamdoctors\" target=\"_blank\"><em>The Upstream Doctors<\/em><\/a>, in which he looks at how health begins at home and in the workplace, with the social and environmental factors of our everyday lives. He shows how the future of our healthcare system depends on &ldquo;upstreamists,&rdquo; the doctors, nurses and other healthcare practitioners who look for the root cause of illness rather than just treating the symptoms.<\/p>   <p>Manchanda is the president and founder of&nbsp;<a href=\"http:\/\/www.healthbegins.org\/\" target=\"_blank\">Health Begins<\/a>, a social network that teaches and empowers clinicians to improve health where it begins&mdash;in patients&rsquo; home and work environments. He also founded RxDemocracy, a nonpartisan coalition created to register voters in healthcare clinics. He serves on the board of the National Physicians Alliance, as well as on the board of Physicians for Social Responsibility in Los Angeles.<\/p>","slug":"rishi_manchanda","published_at":"2014-08-06 20:57:00","updated_at":"2015-07-10 16:26:51"}}