{"speaker":{"id":206,"title":"","firstname":"Dave","middleinitial":"","lastname":"Eggers","description":"Author, publisher, education activist","whotheyare":"Writing is only his day job: Dave Eggers moonlights as a publisher, philanthropist and advocate for students and teachers.","whylisten":"<p>Dave Eggers is the author of many books, among them <em>The Every<\/em>,<em> The Circle<\/em>, <em>The Monk of Mokha<\/em>, <em>A Hologram for the King<\/em>, <em>What Is the What<\/em>&nbsp;and <em>The Museum of Rain<\/em>. His books for young readers include <em>What Can a Citizen Do?<\/em>, <em>Her Right Foot<\/em>, <em>This Bridge Will Not Be Gray<\/em>, <em>The Lifters<\/em>&nbsp;and <em>The Wild Things<\/em>, among others. His novel <em>What Is the What<\/em>, about the life of Valentino Achak Deng, a refugee from the civil war in South Sudan, gave birth to the Valentino Achak Deng Foundation, run by Mr. Deng, which operates secondary schools in South Sudan. He is founder of McSweeney&#39;s, an independent publishing company based in San Francisco that produces books, a humor website, the <em>Believer<\/em> magazine,<em> Illustoria<\/em> magazine and a journal of new writing, <em>McSweeney&#39;s Quarterly Concern<\/em>.<\/p><p>Eggers is the cofounder of 826 Valencia, a youth writing and tutoring center in San Francisco which has inspired more than 60 other organizations around the world. His work in education and activism also includes cofounding the Voice of Witness book series of social justice oral histories, founding college-access organization ScholarMatch and cofounding the International Congress of Youth Voices. He is co-editor of I,Witness, a series of first-person narratives by young activists for readers ages 9 to 12.&nbsp;<\/p><p>Eggers is winner of the Muhammad Ali Humanitarian Award for Education, the Dayton Literary Peace Prize, the TED Prize and has been a finalist for the National Book Award, the Pulitzer Prize and the National Book Critics Circle Award. His TED Prize wish is for more people to join him in becoming involved in their local schools, via Once Upon A School and other local efforts.<\/p><p>(Photo credit:&nbsp;Brecht von Maele)&nbsp;<\/p>","slug":"dave_eggers","published_at":"2008-03-13 19:46:00","updated_at":"2022-07-27 15:30:12"}}