{"speaker":{"id":207,"title":"","firstname":"Neil","middleinitial":"","lastname":"Turok","description":"Physicist, education activist","whotheyare":"Neil Turok is working on a model of the universe that explains the big bang -- while, closer to home, he's founded a network of math and science academies across Africa.","whylisten":"<p>Neil Turok works on understanding the universe&#39;s very beginnings. With Stephen Hawking, he developed the Hawking-Turok instanton solutions, describing the birth of an inflationary universe -- positing that,<strong> big bang or no, the universe came from something, not from utter nothingness<\/strong>.<\/p><p>Recently, with Paul Steinhardt at Princeton, Turok has been working on a cyclic model for the universe in which the big bang is explained as a collision between two &ldquo;brane-worlds.&rdquo; The two physicists cowrote the popular-science book <a href=\"http:\/\/www.randomhouse.com\/catalog\/display.pperl?isbn=9780385509640\" target=\"_blank\"><em>Endless Universe<\/em><\/a>. <\/p><p>In 2003, Turok, who was born in South Africa, founded the <a href=\"http:\/\/www.aims.ac.za\/english\/\" target=\"_blank\">African Institute for Mathematical Sciences (AIMS)<\/a>  in Muizenberg, a postgraduate center supporting math and science. His TED Prize wish: Help him grow AIMS and promote the study and math and science in Africa, so that the world&#39;s next Einstein may be African.<\/p><p>Turok is the Director of the <a href=\"http:\/\/www.perimeterinstitute.ca\/\" target=\"_blank\">Perimeter Institute for Theoretical Physics<\/a>, in Ontario, Canada. In 2010, the Canadian government funded a <a href=\"http:\/\/blog.ted.com\/2010\/07\/canada_gives_20.php\" target=\"_blank\">$20million expansion of the AIMS schools<\/a>, working with the Perimeter Institute to start five new AIMS schools in different African nations.<\/p><p>In 2016, he won the&nbsp;<a href=\"https:\/\/www.aip.org\/news\/2016\/cosmologist-neil-turok-wins-2016-tate-medal-international-leadership-physics\" target=\"_blank\">Tate Medal for International Leadership in Physics<\/a> .&nbsp;<\/p>","slug":"neil_turok","published_at":"2008-03-20 01:00:00","updated_at":"2016-03-20 16:14:40"}}