{"speaker":{"id":208,"title":"","firstname":"Karen","middleinitial":"","lastname":"Armstrong","description":"Religious scholar","whotheyare":"Karen Armstrong -- winner of the 2008 TED Prize -- is a provocative, original thinker on the role of religion in the modern world.","whylisten":"<p>Religious thinker Karen Armstrong has written more than 20 books on faith and the major religions, studying what Islam, Judaism and Christianity have in common, and how our faiths shaped world history and drive current events.<\/p>  <p>A former nun, Armstrong has written two books about this experience:&nbsp;<a href=\"http:\/\/geni.us\/narrowgate\" target=\"_blank\"><em>Through the Narrow Gate<\/em><\/a>, about her seven years in the convent, and&nbsp;<a href=\"http:\/\/geni.us\/spiralstaircase\" target=\"_blank\"><em>The Spiral Staircase<\/em><\/a>, about her subsequent spiritual awakening, when she developed her iconoclastic take on the major monotheistic religions -- and on the strains of fundamentalism common to all. She is a powerful voice for ecumenical understanding.<\/p>  <p>Armstrong&#39;s 2008 TED Prize wish asked the world to help her create the&nbsp;<a href=\"https:\/\/charterforcompassion.org\/\" target=\"_blank\">Charter for Compassion<\/a>, a document based on the Golden Rule: that we should treat others how we would want to be treated. In fall 2008, the first draft of the charter was written by the world, via a multilingual website that allowed all to comment. In February 2009, the words were given to the Council of Conscience, a gathering of religious leaders and thinkers, who crafted the final document based on global input. The Charter was officially launched in November 2009. It has been signed by notable world leaders including Pope Benedict XVI, the Dalai Lama, Desmond Tutu, Deepak Chopra and Muhammad Ali. The Charter has led to the creation of the Charter for Compassion International (CCI) organization, the Compassionate Communities campaign, and Global Compassion Council -- a group of leaders continuing the movement around the the world.<\/p>","slug":"karen_armstrong","published_at":"2008-03-19 03:19:00","updated_at":"2018-01-22 21:47:18"}}