{"speaker":{"id":209,"title":"","firstname":"Stephen","middleinitial":"","lastname":"Hawking","description":"Theoretical physicist","whotheyare":"Stephen Hawking's scientific investigations shed light on the origins of the cosmos, the nature of time and the ultimate fate of the universe. His bestselling books for a general audience have given an appreciation of physics to millions.","whylisten":"<p>A specialist in cosmology and quantum gravity and a devotee of black holes, Stephen Hawking probed the origins of the cosmos, the nature of time and the universe&#39;s ultimate fate -- earning him accolades including induction into the Order of the British Empire. To the public, he&#39;s best known as an author of bestsellers such as&nbsp;<a href=\"http:\/\/geni.us\/universeinanutshell\" target=\"_blank\"><em>The Universe in a Nutshell<\/em><\/a>&nbsp;and&nbsp;<a href=\"http:\/\/geni.us\/briefhistoryoftime\" target=\"_blank\"><em>A Brief History of Time<\/em><\/a>, which have brought an appreciation of theoretical physics to millions.<br \/><br \/>Though the motor neuron disorder ALS confined Hawking to a wheelchair, it didn&#39;t stop him from lecturing widely, making appearances on television shows such as <em>Star Trek: The Next Generation<\/em> and <em>The Simpsons<\/em> -- and planning a trip into orbit with <a href=\"\/index.php\/speakers\/view\/id\/161\">Richard Branson<\/a>&#39;s Virgin Galactic. A true academic celebrity, he used his public appearances to raise awareness about potential global disasters -- such as global warming -- and to speak out for the future of humanity: &quot;Getting a portion of the human race permanently off the planet is imperative for our future as a species,&quot; he said.<br \/><br \/>Hawking served as Lucasian Professor of Mathematics at the University of Cambridge, where he contributed to both high-level physics and the popular understanding of our universe.<\/p>","slug":"stephen_hawking","published_at":"2008-04-04 01:48:00","updated_at":"2020-02-13 18:52:47"}}