{"speaker":{"id":21,"title":"","firstname":"Malcolm","middleinitial":"","lastname":"Gladwell","description":"Writer","whotheyare":"Detective of fads and emerging subcultures, chronicler of jobs-you-never-knew-existed, Malcolm Gladwell's work is toppling the popular understanding of bias, crime, food, marketing, race, consumers and intelligence.","whylisten":"<p>Malcolm Gladwell searches for the counterintuitive in what we all take to be the mundane: cookies, sneakers, pasta sauce. A <em>New Yorker<\/em> staff writer since 1996, he visits obscure laboratories and infomercial set kitchens as often as the hangouts of freelance cool-hunters -- a sort of pop-R&amp;D gumshoe -- and for that has become a star lecturer and bestselling author.<br \/> <br \/>Sparkling with curiosity, undaunted by difficult research (yet an eloquent, accessible writer), <strong>his work uncovers truths hidden in strange data<\/strong>. His always-delightful <a href=\"http:\/\/gladwell.typepad.com\/gladwellcom\/\" target=\"_blank\">blog<\/a> tackles topics from serial killers to steroids in sports, while provocative recent work in the <em>New Yorker<\/em> <a href=\"http:\/\/www.gladwell.com\/2007\/2007_12_17_c_iq.html\" target=\"_blank\">sheds new light on the Flynn effect<\/a> -- the decades-spanning rise in I.Q. scores.<br \/> <br \/>Gladwell has written four books. <a href=\"http:\/\/www.gladwell.com\/tippingpoint\/index.html\" target=\"_blank\"><em>The Tipping Point<\/em><\/a>, which began as a <em>New Yorker<\/em> piece, applies the principles of epidemiology to crime (and sneaker sales), while <a href=\"http:\/\/www.gladwell.com\/blink\/index.html\" target=\"_blank\"><em>Blink<\/em><\/a> examines the unconscious processes that allow the mind to &quot;thin slice&quot; reality -- and make decisions in the blink of an eye. His third book,&nbsp;<a href=\"http:\/\/geni.us\/outlierssuccess\" target=\"_blank\"><em>Outliers<\/em><\/a>, questions the inevitabilities of success and identifies the relation of success to nature versus nurture. The newest work,&nbsp;<a href=\"http:\/\/geni.us\/whatthedogsaw\" target=\"_blank\"><em>What the Dog Saw and Other Adventures<\/em><\/a>, is an anthology of his <em>New Yorker <\/em>contributions.&nbsp;<\/p><p>He says: &quot;There is more going on beneath the surface than we think, and more going on in little, finite moments of time than we would guess.&quot;<br \/>&nbsp;<\/p>","slug":"malcolm_gladwell","published_at":"2007-02-13 11:10:00","updated_at":"2015-09-21 21:18:00"}}