{"speaker":{"id":215,"title":"","firstname":"Tod","middleinitial":"","lastname":"Machover","description":"Composer, inventor","whotheyare":"At MIT's Media Lab, Tod Machover creates boundary-breaking new music, often using new instruments and music technologies he has invented.","whylisten":"<p>Tod Machover is head of the MIT Media Lab&#39;s Hyperinstruments\/Opera of the Future group. He has composed five operas and helped to develop many groundbeaking musical technologies -- including <a href=\"http:\/\/www.media.mit.edu\/hyperins\" target=\"_blank\">Hyperinstruments<\/a>, a technology that augments musical expression for both virtuosi (from Yo-Yo Ma to Prince) and amateurs, and <a href=\"http:\/\/www.hyperscore.com\" target=\"_blank\">Hyperscore<\/a>, software that allows anyone to create sophisticated, original music by using lines and colors. Many of Machover&#39;s principles about &quot;active participation&quot; in music are exemplified in <a href=\"http:\/\/en.wikipedia.org\/wiki\/Guitar_Hero_(series)\" target=\"_blank\">Guitar Hero<\/a>, which grew out of his lab.  <\/p><p>Among his current projects is a new opera, <em><a href=\"http:\/\/web.media.mit.edu\/~tod\/Powers-ShortDemo11-07.mov\" target=\"_blank\">Death and the Powers<\/a><\/em>, complete with a musical chandelier, animatronic walls, and an army of robots. <em><a href=\"http:\/\/web.media.mit.edu\/~tod\/Powers-ShortDemo11-07.mov\" target=\"_blank\">Death and the Powers<\/a><\/em> premieres in Monaco in September 2009.<br \/><br \/>A recent focus of Machover&#39;s group has been on <a href=\"http:\/\/www.musicmindhealth.com\/\" target=\"_blank\">Music, Mind and Health<\/a>, which marshals the power of music to promote well-being. Working with long-term patients at facilities such as Tewksbury Hospital, north of Boston, the group&#39;s goal is to develop personal musical activities that adapt to the particular skills and needs of each individual. In this way, the path to health becomes as rewarding as learning an instrument, composing a symphony, or premiering at Carnegie Hall.<\/p>","slug":"tod_machover","published_at":"2008-04-15 01:22:00","updated_at":"2014-08-14 14:41:27"}}