{"speaker":{"id":22,"title":"","firstname":"Mena","middleinitial":"","lastname":"Trott","description":"Blogger; cofounder, Six Apart","whotheyare":"Mena Trott and her husband Ben founded Six Apart in a spare bedroom after the blogging software they developed grew beyond a hobby. With products Movable Type, TypePad, LiveJournal and Vox, the company has helped lead the \"social media\" revolution.","whylisten":"<p><em>Time<\/em>&#39;s 2006 Person of the Year is &quot;You,&quot; which is to say, everybody: &quot;The many wresting power from the few and helping one another for nothing.&quot; The tools of this revolution have come in no small part from <strong><a href=\"http:\/\/www.sixapart.com\/\" target=\"_blank\">Six Apart<\/a>, a 2002 startup that helped enable the blogging boom<\/strong> with its products. And co-founder Mena Trott, who rose to Internet fame with her own blog, <a href=\"http:\/\/mena.vox.com\/\" target=\"_blank\">DollarShort<\/a>, has become a strong voice explaining the role of personal blogging in today&#39;s culture.<\/p><p>Trott and her husband Ben developed <a href=\"http:\/\/www.movabletype.org\/\" target=\"_blank\">Movable Type<\/a>  for their own use in 2001, but it became immensely popular and they dove in full-time. By the time they were preparing their blog-hosting service <a href=\"http:\/\/www.typepad.com\/\" target=\"_blank\">TypePad<\/a>, investors were knocking on the door. In 2004, the company grew from seven employees to 50, with Mena Trott serving as chief executive, as well as an interface designer. Today, having acquired <a href=\"http:\/\/www.livejournal.com\/\" target=\"_blank\">LiveJournal<\/a>  and introduced rich-media sharing platform <a href=\"http:\/\/www.vox.com\/\" target=\"_blank\">Vox<\/a>, <strong><a href=\"http:\/\/www.sixapart.com\/\" target=\"_blank\">Six Apart<\/a>&#39;s software gives online voice to millions of people<\/strong> and organizations worldwide. <\/p>","slug":"mena_trott","published_at":"2007-02-13 11:11:00","updated_at":"2010-06-15 15:54:03"}}