{"speaker":{"id":2228,"title":"","firstname":"Francis","middleinitial":"","lastname":"de los Reyes","description":"Environmental engineer, sanitation activist","whotheyare":"Francis de los Reyes works with cutting-edge microbiological techniques in environmental biotech. But his passion, both professionally and personally, is helping to improve the plight of the world’s 2.5 billion people living without adequate sanitation. Reyes is a TED Fellow.","whylisten":"<p>Dr. Francis L. de los Reyes III is a Professor of Civil, Construction,  and Environmental Engineering, Associate Faculty of Microbiology, and  Training Faculty of Biotechnology at North Carolina State University.   His research focuses on biological processes and combines modeling,  bioreactor experiments, and molecular microbial ecology tools in  addressing fundamental and practical issues in environmental  biotechnology and environmental engineering.  An important area of his  research and teaching is water and sanitation in developing countries.   <\/p><p>Current and past research projects (funding of ~ $4.5 M in last 10  years) include: quantitative microbial risk assessment of graywater  reuse (WRRI), molecular analysis and modeling of the competition between  filaments and floc-formers in activated sludge (NSF), analysis of the  ecophysiology of nitrifiers and denitrifiers in microbial floc (NSF),  optimization of a swine waste treatment system for nitrogen removal (US  Department of Agriculture), analysis of the fate of bioagents in  landfills (EPA), microbial characterization of landfills (Waste  Management, Inc.), molecular techniques for groundwater remedation sites  (US DOE\/DOD), investigation of foam control methods (Hazen and Sawyer),  development of probes for environmentally versatile Bacillus strains  (Novozymes Biochemicals, Inc.), improvement of sludge dewatering (NC  WRRI), microbial ecology of grease interceptors (CSPA) and the  system-wide optimization of wastewater treatment plants using genetic  algorithms.&nbsp;   <\/p>","slug":"francis_de_los_reyes","published_at":"2014-09-29 15:05:00","updated_at":"2014-09-29 15:09:44"}}