{"speaker":{"id":2234,"title":"","firstname":"Boniface","middleinitial":"","lastname":"Mwangi","description":"","whotheyare":"Boniface Mwangi is an award-winning Kenyan photographer, artist and activist. He is a TED Fellow.","whylisten":"For four years Boniface Mwangi held a staff photography position at The Standard, the second largest Kenyan newspaper, taking on various assignments of increasing responsibility in a number of countries. Mwangi became the eye of Kenyans during the 2007 post-election violence and showed courage and compassion to capture thousands of images, some so gory that they could not be published.<br \/><br \/>Following the political resolution to the election crisis, Boniface started to see himself as a visual artist, using photography as the vehicle for social change in Kenya. His focus was the fight against the impunity of politicians in the face of over 1000 dead and half a million people displaced as a result of the violence they caused.<br \/><br \/>&quot;Boniface&rsquo;s images are crucial for the healing of our nation; his ability to stay focused and inject a sense of artistry into his work is a testimony to the spirit of professional journalism,&quot; wrote Jackson Biko after Boniface was voted Kenya Photojournalist of the Year in 2008 by readers of <em>Adam<\/em>, a men&rsquo;s magazine in the country.<br \/><br \/>Since then, Boniface has continued to work as a freelance photographer for Bloomberg, the AFP, Reuters, the Boston Globe, and other media outlets while building a movement for social change in Kenya through &ldquo;Picha Mtaani&rdquo; (Swahili for street exhibition). The photo exhibit aims to heal the scars of Kenyans and draw their attention to the dynamics of the violence to prevent a repeat during the upcoming elections of 2013.<br \/><br \/>Boniface founded Pawa254 as a collaborative hub where journalists, artists and activists could meet to find innovative ways of achieving social change. The hub has already had many functions, but two campaigns stand out. &ldquo;Heal the Nation&rdquo; is a very successful initiative to show a half-hour documentary about post-election violence to as many Kenyans as possible and facilitate discussions around the film. The campaign is accompanied by a more shadowy graffiti campaign that has evoked strong reactions and fired up the youth of Kenya and the world, as images of the clever graffiti grace the pages of the world&rsquo;s newspapers.<br \/><br \/>In 2009 United States Secretary of State Hillary Clinton wrote a letter commending Boniface for his work during the post-election violence. She stated, &quot;Your photography is absolutely stunning and tells an important and powerful story for the world to hear.&quot;","slug":"boniface_mwangi","published_at":"2014-10-05 18:41:00","updated_at":"2015-04-02 15:54:59"}}