{"speaker":{"id":2240,"title":"","firstname":"Patrícia","middleinitial":"","lastname":"Medici","description":"Wildlife conservationist","whotheyare":"Patrícia Medici leads the longest running conservation project to protect the threatened lowland tapir.","whylisten":"<p>Patr&iacute;cia Medici is a Brazilian conservation biologist whose main professional interests are tapir conservation, tropical forest conservation, metapopulation management, landscape ecology and community-based conservation.<\/p><p>For the past 20 years, Patr&iacute;cia has been working for a Brazilian non-governmental organization called IP&Ecirc;, Instituto de Pesquisas Ecol&oacute;gicas (Institute for Ecological Research), of which she was one of the founding members together with Cl&aacute;udio and Suzana Padua. Since 1996, Patr&iacute;cia has coordinated the Lowland Tapir Conservation Initiative in Brazil. Since 2000, Patr&iacute;cia has been the Chairperson of the IUCN\/SSC Tapir Specialist Group (TSG), a network of over 120 tapir conservationists from 27 different countries worldwide. <\/p><p>Patr&iacute;cia has a Bachelor&rsquo;s Degree in Forestry Sciences from the S&atilde;o Paulo University (USP &ndash; Universidade de S&atilde;o Paulo), a Masters Degree in Wildlife Ecology, Conservation and Management from the Federal University of Minas Gerais (UFMG &ndash; Universidade Federal de Minas Gerais), Brazil, and a Ph.D. Degree in Biodiversity Management from the Durrell Institute of Conservation and Ecology (DICE), University of Kent, United Kingdom.&nbsp;<\/p><p>Patr&iacute;cia has been honored with three very prestigious conservation awards: Harry Messel Conservation Leadership Award from the International Union for Conservation of Nature in 2004, Golden Ark Award from the Golden Ark Foundation in the Netherlands in 2008, and Whitley Award from the Whitley Fund for Nature in the United Kingdom also in 2008. Patr&iacute;cia received the 2011 Research Prize from the Durrell Institute of Conservation and Ecology (DICE) of the University of Kent in the United Kingdom.<\/p>","slug":"patricia_medici","published_at":"2014-10-05 19:12:00","updated_at":"2015-11-04 17:06:15"}}