{"speaker":{"id":2249,"title":"","firstname":"Sangu","middleinitial":"","lastname":"Delle","description":"Entrepreneur","whotheyare":"Sangu Delle is an entrepreneur and clean water activist. A TED Fellow who hails from Ghana, he sees incredible potential in the African economy.","whylisten":"<p>Born in Ghana, Sangu Delle&#39;s childhood home was a refuge for victims of torture and violence from neighboring Liberia and Sierra Leone. Delle graduated from Harvard College with highest honors in African Studies and Economics. He was awarded the Soros Fellowship and pursued a Juris Doctor of Law and MBA at Harvard Law School and Harvard Business School, respectively.<\/p><p>At Harvard, enrolling in the Social Engagement Initiative program that bridged the academic study and practical service gap, Delle co-founded&nbsp;<a href=\"http:\/\/www.cleanacwa.org\/\" target=\"_blank\">cleanacwa<\/a>&nbsp;(formerly the African Development Initiative) in 2007, which today is currently working to bring clean water and sanitation to over 200,000 people in 160 villages in the Ayensuano, Suhum and Nandom districts in Ghana. Delle is also passionate about mental health and wellness, and was a founding member of Harvard University&rsquo;s Mental Health Alumni Special Interest Group.&nbsp;<\/p><p>Delle has previously worked at Goldman Sachs, Morgan Stanley and Valiant Capital Partners. Convinced that the real needs of communities can best be met through entrepreneurship, in 2008 he founded an investment holding company,&nbsp;<a href=\"http:\/\/www.gpalminvestments.com\/\" target=\"_blank\">Golden Palm Investments<\/a>(GPI) to fund promising start-ups that can have social impact and generate jobs. GPI has backed technology startups such as Andela, Flutterwave and mPharma. &nbsp;GPI has also built a portfolio of greenfield companies in healthcare, agriculture and financial services. Delle serves as the Chairman and Chief Executive Officer of GPI.<\/p><p>Delle has received several international accolades including being named a 2016 finalist for &ldquo;Young CEO of the Year&rdquo; by the Africa CEO Forum, Africa&rsquo;s &ldquo;Young Person of the Year&rdquo; in 2014 by the Future Africa Awards, selected as a 2014 TEDGlobal Fellow, Forbes&rsquo; top 30 most promising entrepreneurs in Africa and Euromoney&rsquo;s &ldquo;Africa&rsquo;s Rising Stars&rdquo; award. Institut Choiseul and Forbes Afrique named Delle as one of the top &ldquo;100 Economic Leaders in Africa&rdquo; in 2015. Mic named Delle as one of 9 entrepreneurs in the millennial generation making a difference.&nbsp;<\/p><p>Delle is a Trustee of the Peddie School in NJ and serves on the Advisory Board and chairs the Leadership Council of Harvard University&rsquo;s Center for African Studies. He also serves on the inaugural West Africa Advisory Group of the Rhodes Scholarship at Oxford University.<\/p><p>Delle loves the outdoors and trekked Mount Everest in 2013 and summited Kilimanjaro during the summer of 2015.<\/p>","slug":"sangu_delle","published_at":"2014-10-06 00:22:00","updated_at":"2017-05-03 21:46:18"}}