{"speaker":{"id":2257,"title":"","firstname":"Angelo","middleinitial":"","lastname":"Vermeulen","description":"Space researcher, biologist, artist","whotheyare":"Angelo Vermeulen wears many hats, including one as a crew commander for NASA, another as an artist and community organizer. ","whylisten":"<p>If you&#39;re looking for someone who embodies &quot;multidisciplinary,&quot; look no further than TED Senior Fellow Angelo Vermeulen, a space systems researcher, biologist, artist  and community organizer. The one common thread in all his work: the desire to understand the relationship between nature and technology, to learn from what&#39;s happened in the past in order to build a promising future for us all.&nbsp;<\/p><p>Having received his PhD in Biology from the University of Leuven in Belgium, Angelo nonetheless eschewed a life in the lab to apply a creative lens to everything he does. To date, that includes working on independent projects around the world, including Biomodd, a worldwide series of interactive art installations in which technology and nature coexist. Throughout 2011, he was a member of the European Space Agency Topical Team Arts  &amp; Science (ETTAS), while  in 2013 he was crew commander of the  NASA-funded HI-SEAS Mars mission  simulation in Hawaii. For this project, he and a crew of six astronauts lived for four months in a dome, all in the name of studying the effects of longterm isolation among a small crew. <\/p><p>In 2009 he launched SEAD (Space  Ecologies Art and Design), a platform for research on the architectures and  ethics of space colonization. In 2014, he launched Seeker, a project calling for the public to co-create starship sculptures that evolve over time; this subject is also the focus of a new PhD at Delft University of  Technology, for which he&#39;s developing &quot;paradigm-shifting concepts for evolvable  starships.&quot;<\/p><p>In 2012  he was a Michael Kalil Endowment for Smart Design Fellow at Parsons in  New York. He holds  positions at LUCA School of Visual Arts in Ghent, Belgium, and Die  Angewandte in Vienna, Austria.<\/p>","slug":"angelo_vermeulen","published_at":"2014-10-06 00:44:00","updated_at":"2015-02-19 16:04:37"}}