{"speaker":{"id":23,"title":"","firstname":"Michael","middleinitial":"","lastname":"Shermer","description":"Skeptic","whotheyare":"Michael Shermer debunks myths, superstitions and urban legends -- and explains why we believe them. Along with publishing Skeptic Magazine, he's author of Why People Believe Weird Things and The Mind of the Market.","whylisten":"<p>As founder and publisher of <a href=\"http:\/\/www.skeptic.com\/\" target=\"_blank\"><em>Skeptic Magazine<\/em><\/a>, Michael Shermer has exposed fallacies behind intelligent design, 9\/11 conspiracies, the low-carb craze, alien sightings and other popular beliefs and paranoias. But it&#39;s not about debunking for debunking&#39;s sake. Shermer defends the notion that we can understand our world better only by matching good theory with good science. <br \/><br \/>Shermer&#39;s work offers cognitive context for our often misguided beliefs: In the absence of sound science, incomplete information can powerfully combine with the power of suggestion (helping us hear Satanic lyrics when &quot;Stairway to Heaven&quot; plays backwards, for example). In fact, a common thread that runs through beliefs of all sorts, he says, is our tendency to convince ourselves: We overvalue the shreds of evidence that support our preferred outcome, and ignore the facts we aren&#39;t looking for.<\/p><p class=\"MsoNormal\">He writes a monthly column for <em>Scientific American<\/em>, and is an adjunct at Claremont Graduate University and Chapman University. His latest book is&nbsp;<a href=\"http:\/\/geni.us\/believingbrain\" target=\"_blank\"><em>The Believing Brain: From Ghosts and Gods to Politics and Conspiracies&mdash;How We Construct Beliefs and Reinforce Them as Truths<\/em><\/a>. He is also the author of&nbsp;<a href=\"http:\/\/geni.us\/mindofmarket\" target=\"_blank\"><em>The Mind of the Market<\/em><\/a><em>,<\/em> on evolutionary economics,&nbsp;<a href=\"http:\/\/geni.us\/whydarwinmatters\" target=\"_blank\"><em>Why Darwin Matters: Evolution and the Case Against Intelligent Design<\/em><\/a><em>,<\/em> and&nbsp;<a href=\"http:\/\/geni.us\/scienceofgoodevil\" target=\"_blank\"><em>The Science of Good and Evil<\/em><\/a>. And his next book is titled <em>The Moral Arc of Science.<\/em><\/p>","slug":"michael_shermer","published_at":"2007-02-13 11:12:00","updated_at":"2015-09-22 19:55:40"}}