{"speaker":{"id":2320,"title":"","firstname":"Fredy","middleinitial":"","lastname":"Peccerelli","description":"Forensic anthropologist","whotheyare":"Fredy Peccerelli works with families whose loved ones “disappeared” in the 36-year armed conflict in Guatemala. The executive director of the Guatemalan Forensic Anthropology Foundation, he helps locate bodies and give back identities to those buried in mass graves.","whylisten":"        <p class=\"p1\">In Guatemala&rsquo;s brutal civil war, 200,000 civilians were killed &mdash; and more than 40,000 of them were never found. They are referred to as the &ldquo;disappeared,&rdquo; and since the end of the conflict, their bodies have been found in unmarked mass graves with very little information to identify them.&nbsp;<\/p> <p class=\"p3\">Fredy Peccerelli has a personal connection to this tragic story. He was born in Guatemala, but when his father received threats from a death squad, his family left for the United States. It was 1980 and Peccerelli was 9. He quickly adapted to life in Brooklyn, New York. But in 1994, while a college student, he heard a presentation on the emerging field of forensic anthropology. The speakers talked about exhuming bodies from mass graves in Guatemala, and Peccerelli was fascinated. He wanted to help.<\/p> <p class=\"p3\">Peccerelli founded the&nbsp;<a href=\"http:\/\/www.fafg.org\/\" target=\"_blank\">Guatemalan Forensic Anthropology Foundation<\/a>, which meets with the families of the &ldquo;disappeared,&rdquo; listens to their stories and takes DNA samples to match to exhumed bodies. In this way, they are able to piece together narratives of what happened &mdash; in order to give families closure and to provide evidence for the trials of those involved in the deaths.&nbsp;<\/p> <p class=\"p3\">Pecerrelli has been profiled on&nbsp;<a href=\"http:\/\/www.pbs.org\/pov\/discoveringdominga\/special_evidence_fp.php\" target=\"_blank\">PBS<\/a>,&nbsp;in&nbsp;<a href=\"http:\/\/www.nytimes.com\/2004\/03\/30\/science\/conversation-with-fredy-peccerelli-bones-tell-story-revealing-history-s-darker.html\" target=\"_blank\"><em>The New York Times<\/em><\/a>&nbsp;and more. He recently launched the &ldquo;No More Missing&rdquo; campaign to raise money for an interactive website to tell the stories of the Guatemalan &quot;disappeared&quot; on the global stage. He wants people across the world to see the&nbsp;connection between what happened Guatemala and what is happening today in countries like Mexico.&nbsp;<\/p>","slug":"fredy_peccerelli","published_at":"2014-11-13 16:12:00","updated_at":"2015-02-06 17:20:54"}}