{"speaker":{"id":238,"title":"","firstname":"Nathan","middleinitial":"","lastname":"Myhrvold","description":"Polymath","whotheyare":"Nathan Myhrvold is a professional jack-of-all-trades. After leaving Microsoft in 1999, he's been a world barbecue champion, a wildlife photographer, a chef, a contributor to SETI, and a volcano explorer.","whylisten":"<p>Since leaving his post as Microsoft&#39;s Chief Technology Officer in 1999 (with fortune in tow), Nathan Myhrvold has been a professional exemplar of the spirit of the &quot;Renaissance Man,&quot; proudly following his interests wherever they&#39;ve led. His dispersed passions have triggered an impressive list of accomplishments, including world barbecue championships, major archeological finds (several <em>Tyrannosaurus rex <\/em>skeletons), prize-winning <a href=\"http:\/\/www.edge.org\/3rd_culture\/myhrvold_lions07\/myhrvold_lions07_index.html\" target=\"_blank\">wildlife photography<\/a>, building a section of Babbage&#39;s Difference Engine #2, s, and a new and consuming interest in the sous-vide <a href=\"http:\/\/www.wired.com\/culture\/lifestyle\/magazine\/16-03\/st_nathan\" target=\"_blank\">cooking technique<\/a>.<br \/> <br \/><a href=\"http:\/\/www.newyorker.com\/reporting\/2008\/05\/12\/080512fa_fact_gladwell\" target=\"_blank\">Malcolm Gladwell&#39;s 2008 <em>New Yorker<\/em> profile of him<\/a>  revealed an impish but truly inspired character whose latest company, <a href=\"http:\/\/www.intellectualventures.com\/\" target=\"_blank\">Intellectual Ventures<\/a> -- which brainstorms and patents a wide array of inventions --&nbsp; has been accused in some quarters of acting like a &#39;patent troll&#39; but is described by Myhrvold as &quot;a disruptive organization providing&nbsp; an efficient way for patent holders to get paid for the inventions they own, and... for technology companies to gain easy access to the invention rights they need.&quot; After funding big-vision projects such as the <a href=\"http:\/\/www.seti.org\/seti\/projects\/ata\/index.php\" target=\"_blank\">Allen Telescope Array<\/a>, exploring active volcanoes and investigating penguin digestion, Myhrvold insists that his hobbies aren&#39;t as discursive as they seem. They do have a common denominator, after all: him.<\/p>","slug":"nathan_myhrvold","published_at":"2008-05-22 14:09:00","updated_at":"2011-08-02 20:04:04"}}