{"speaker":{"id":245,"title":"","firstname":"Julie","middleinitial":"","lastname":"Taymor","description":"Director, designer","whotheyare":"Julie Taymor is a film, theater and opera director. She is known for lavish movies such as Frida and for her hit Broadway musicals, The Lion King and Spider-Man: Turn Off the Dark.","whylisten":"<p>Working in musicals, Shakespeare, film and opera, Julie Taymor is a wildly imaginative and provocative director and designer. <strong>She is well known for having translated the film <em>The Lion King<\/em> to Broadway<\/strong>, a still-running show for which she also designed costumes, masks and puppets -- and won two Tony Awards. (She was the first woman to win a Tony for directing a musical.) She has received multiple awards for her work, and given both MacArthur and Guggenheim fellowships. <\/p><p>In 2005, she worked on a lavish production of Mozart&#39;s opera, <a href=\"http:\/\/www.imdb.com\/title\/tt0956790\/\" target=\"_blank\"><em>The Magic Flute<\/em><\/a>, and in 2006 she co-wrote a version of the story of Beowulf, <a href=\"http:\/\/www.npr.org\/templates\/story\/story.php?storyId=5542123\" target=\"_blank\"><em>Grendel<\/em><\/a>. Meanwhile, she has developed a fascinating career in the movies. She directed <em><a href=\"http:\/\/www.imdb.com\/title\/tt0445922\/\" target=\"_blank\">Across the Universe<\/a>,<\/em> a romp through the music of the Beatles, <em><a href=\"http:\/\/www.imdb.com\/title\/tt0120866\/\" target=\"_blank\">Titus<\/a>,<\/em> a 1999 adaptation of Shakespeare&#39;s <em>Titus Andronicus,<\/em> and the glorious <em><a href=\"http:\/\/www.imdb.com\/title\/tt0120679\/\" target=\"_blank\">Frida<\/a>,<\/em> the 2002 film about Frida Kahlo for which she received an Oscar nomination. More recently, and most dramatically, Taymor collaborated with musicians from U2 on a Broadway stage version of Marvel Studios&#39; Spider-Man.<\/p>","slug":"julie_taymor","published_at":"2008-06-09 07:12:00","updated_at":"2013-07-31 15:29:07"}}