{"speaker":{"id":2461,"title":"","firstname":"Guy","middleinitial":"","lastname":"Winch","description":"Psychologist, author","whotheyare":"Guy Winch asks us to take our emotional health as seriously as we take our physical health -- and explores how to heal from common heartaches.","whylisten":"<p>Guy Winch is a licensed psychologist who works with individuals, couples and families. As an advocate for psychological health, he has spent the last two decades adapting the findings of scientific studies into tools his patients, readers and audience members can use to enhance and maintain their mental health. As an identical twin with a keen eye for any signs of favoritism, he believes we need to practice emotional hygiene with the same diligence with which we practice personal and dental hygiene.<\/p><p>His books --&nbsp;<a href=\"http:\/\/geni.us\/FBGb\" target=\"_blank\"><em>Emotional First Aid: Healing Rejection, Guilt, Failure, and Other Everyday Hurts<\/em><\/a>;&nbsp;<a href=\"https:\/\/www.amazon.com\/Squeaky-Wheel-Complaining-Relationships-Self-Esteem\/dp\/1976342139\" target=\"_blank\"><em>The Squeaky Wheel: Complaining the Right Way to Get Results, Improve Your Relationships and Enhance Self-Esteem<\/em><\/a>; and&nbsp;<a href=\"http:\/\/geni.us\/NF9za4\" target=\"_blank\"><em>How to Fix a Broken Heart<\/em><\/a>&nbsp;have been translated into 26 languages. He also writes the popular &quot;<a href=\"https:\/\/www.psychologytoday.com\/blog\/the-squeaky-wheel\" target=\"_blank\">Squeaky Wheel Blog<\/a>&quot; on PsychologyToday.com.<\/p><p>In January, Winch partnered with TED to launch&nbsp;<a href=\"https:\/\/ideas.ted.com\/tag\/dear-guy\/\" target=\"_blank\"><em>Dear Guy<\/em><\/a>, a science-based advice column for TED&#39;s Ideas blog. His new podcast,&nbsp;<a href=\"https:\/\/www.guywinch.com\/podcast\/\" target=\"_blank\"><em>Dear Therapists<\/em><\/a>, is cohosted with fellow TED speaker Lori Gottlieb and executive produced by Katie Couric. He has also dabbled in stand-up comedy.<\/p>","slug":"guy_winch","published_at":"2015-02-16 15:41:00","updated_at":"2020-12-03 19:49:29"}}