{"speaker":{"id":2477,"title":"","firstname":"Theaster","middleinitial":"","lastname":"Gates","description":"Artist, potter, community builder","whotheyare":"Theaster Gates is a potter whose ambitions stretch far beyond the wheel and the kiln. In Chicago, his leadership of artist-led spaces has catalyzed interest and excitement in a formerly neglected neighborhood, as he uses culture as a transformational weapon. ","whylisten":"<p class=\"MsoNormal\">Theaster Gates is helping to define the future of artistic place-based efforts, in research and practice. Beginning with interventions in small-scale residences now known as <a href=\"http:\/\/theastergates.com\/section\/117693_Dorchester_Projects.html\" target=\"_blank\">Dorchester Projects<\/a>, Gates&rsquo; houses in Greater Grand Crossing in Chicago have become a nexus for globally engaged experiments in structures of individual and collective living, working and art-making. Launched into the international art world at <a href=\"http:\/\/d13.documenta.de\/\" target=\"_blank\">Documenta(13)<\/a>, the houses embodied a new system of values and celebrated both a flexible use of space and provided a way for artists, visitors and students to connect and collaborate.<\/p><p class=\"MsoNormal\">The latest example of this kind of work is the <a href=\"http:\/\/whitecube.com\/channel\/in_the_studio\/theaster_gates_on_stony_island_arts_bank\/\" target=\"_blank\">Stony Island Arts Bank<\/a>, set to open for the Chicago Architecture Biennial in October 2015. Gates will convert a formerly derelict bank on Chicago&#39;s south side to create an artwork -- and a communal and creative space. <\/p> <p>At the University of Chicago, where he is a professor and the director of arts and public life, Gates leads the Arts Incubator in Washington Park. Gates also leads an urban research initiative known as the <a href=\"https:\/\/arts.uchicago.edu\/arts-public-life\/place-lab\" target=\"_blank\">Place Lab<\/a>, a team of social scientists, architects, creative professionals and business leaders. With support from the <a href=\"http:\/\/news.uchicago.edu\/article\/2014\/05\/08\/knight-foundation-invests-35-million-help-uchicago-expand-model-community-revital\" target=\"_blank\">Knight Foundation<\/a>, Gates and his team will create frameworks for reimagining the role that culture plays in the redevelopment of transforming African American communities. <\/p>","slug":"theaster_gates","published_at":"2015-03-04 20:21:00","updated_at":"2015-03-26 15:13:44"}}