{"speaker":{"id":2493,"title":"","firstname":"Camille A.","middleinitial":"","lastname":"Brown","description":"Director, choreographer, educator","whotheyare":"Camille A. Brown leads her dance company through excavations of ancestral stories, both timeless and traditional, that connect history with contemporary culture.","whylisten":"<p>Camille A. Brown is a prolific Black female choreographer reclaiming the cultural narrative of African American identity. She is a Ford Foundation Art of Change Fellow, Audelco Award recipient, four-time Princess Grace Award winner, Guggenheim Fellow, Jacob&#39;s Pillow Dance Award recipient, USA Jay Franke &amp; David Herro Fellow, TED Fellow and Doris Duke Artist Award recipient.<\/p><p>Her Company, Camille A. Brown &amp; Dancers (CABD), tours nationally and internationally. The repertory includes the Bessie award-winning <em>Mr. TOL E. RAncE<\/em> (2012), the Bessie-nominated <em>BLACK GIRL: Linguistic Play<\/em> (2015) and <em>ink<\/em> (2017), which premiered at The Kennedy Center.&nbsp;CABD&#39;s community engagement platform, <em>EVERY BODY MOVE<\/em>, inspires collective action through the art of social dance and includes initiatives such as Black Girl Spectrum, Black Men Moving, The Gathering and more.<\/p><p>Brown has been commissioned to create concert dance works for Alvin Ailey American Dance Theater, Philadanco!, Urban Bush Women, Complexions, Ailey II, Ballet Memphis and Hubbard Street II.<\/p><p>In addition to her company works, Brown brings a passion for storytelling to her choreography for Broadway and Off-Broadway theater productions. Notable theater credits for her choreography include: Tony-winning Broadway revival <em>Once On This Island<\/em>, The Emmy-winning <em>Jesus Christ Superstar Live on NBC <\/em>as well as&nbsp;<em>A Streetcar Named Desire<\/em>, <em>The Fortress of Solitude<\/em> (Lortel Nomination) and <em>BELLA: An American Tall Tale<\/em> (Lortel Nomination), among others.<\/p><p>Brown graduated from LaGuardia High School of the Performing Arts in New York City and she has a BFA from UNC School of the Arts. She is the choreographer for the upcoming <em>Magic Mike The Musical <\/em>and<em> P<\/em><em>AL JOEY<\/em>, and she is movement director for Broadway&#39;s <em>Choir Boy<\/em> and <em>Toni Stone<\/em>.<\/p>","slug":"camille_brown","published_at":"2015-03-05 18:36:00","updated_at":"2018-10-01 21:29:58"}}