{"speaker":{"id":2499,"title":"","firstname":"LaToya Ruby","middleinitial":"","lastname":"Frazier","description":"Visual artist","whotheyare":"LaToya Ruby Frazier focuses her camera lens on working class families, exploring themes of family, inequality, health care and environmental racism.","whylisten":"<p>TED Fellow LaToya Ruby Frazier is a visual artist known for collaborative storytelling with the people who appear in her photographs, videos, texts and performances. Her use of the photograph as a platform for social justice and visual representation for working class families is rooted in her commitment to expose the violation of basic human rights and promote environmental justice, access to healthcare, education and employment and migration and immigration equity.&nbsp; Her photographs often become a source of empowerment that lead to creative solutions.<\/p><p>Some of her work, featuring images of her mother and  grandmother, was published in her first book,&nbsp;<a href=\"http:\/\/geni.us\/NotionofFamily\" target=\"_blank\"><em>The Notion of Family<\/em><\/a>, which received the International Center for Photography Infinity Award. She is also know for her work&nbsp;<em>Flint Is Family, <\/em>portraits of&nbsp;three generations of women surviving the man-made water crisis in Flint, Michigan; and <em>And From The Coaltips A Tree Will Rise<\/em>, documenting coalminers&#39; reflections on their memories of migration, immigration, work and labor in the coalmining village of Borinage, Belgium.<\/p><p>Frazier&#39;s newest work, <em>The Last Cruze<\/em>, is a monument and memorial comprised of 67 photographs and texts on an assembly line for auto workers from the labor union United Auto Workers Local 1112 in Lordstown, Ohio. Frazier documented the unallocated status and closure of the General Motors Lordstown Complex in northeast Ohio and the impact on autoworkers, their families and community.<\/p><p>Frazier is an associate professor at the School of the Art Institute of Chicago. She is a 2015 MacArthur &quot;Genius Grant Fellow&quot; and is represented by Gavin Brown&#39;s enterprise in New York City and Rome.<\/p>","slug":"latoya_ruby_frazier","published_at":"2015-03-05 18:47:00","updated_at":"2019-11-20 15:42:59"}}