{"speaker":{"id":2503,"title":"","firstname":"Linda","middleinitial":"","lastname":"Hill","description":"Management professor","whotheyare":"Linda Hill studies collective genius -- the way great companies, and great leaders, empower creativity from many.","whylisten":"<p>Linda A. Hill is the Wallace Brett Donham Professor of Business Administration at the Harvard Business School. In 2014, Professor Hill co-authored <a href=\"http:\/\/collectivegeniusbook.com\" target=\"_blank\"><em>Collective Genius: The Art and Practice of Leading Innovation<\/em><\/a>.  It features thick descriptions of exceptional leaders of innovation in a  wide range of industries&mdash;from information technology to law to  design&mdash;and geographies&mdash;from the US and Europe to the Middle East and  Asia. <em>Business Insider<\/em> named Collective Genius one of &ldquo;The 20 Best  Business Books&rdquo; in summer 2014. <\/p><p>She is the faculty chair of the Leadership Initiative and has chaired numerous HBS Executive Education programs, including the Young She is the co-author, with Kent Lineback, of&nbsp;<a href=\"http:\/\/geni.us\/BeingtheBoss\" target=\"_blank\"><em>Being the Boss: The 3 Imperatives of Becoming a Great Leader<\/em><\/a>&nbsp;and <em>Breakthrough Leadership, <\/em>a blended cohort-based program that helps organizations transform midlevel managers into more effective leaders.<em> Breakthrough Leadership<\/em> was the winner of the 2013 Brandon Hall Group Award for Best Advance in Unique Learning Technology. The book was included in the <em>Wall Street Journal <\/em>as one of the &ldquo;Five Business Books to Read for Your Career in 2011.&quot; She is also the author of&nbsp;<a href=\"http:\/\/geni.us\/BecomingaManager\" target=\"_blank\"><em>Becoming a Manager: How New Managers Master the Challenges of Leadership<\/em><\/a>&nbsp;(2nd Edition). She heads up Harvard&#39;s Presidents&#39; Organization Presidents&#39; Seminar and the High Potentials  Leadership Program, and was course head during the development of the  new Leadership and Organizational Behavior MBA required course. <\/p>","slug":"linda_hill","published_at":"2015-03-13 14:53:00","updated_at":"2021-04-15 15:05:27"}}