{"speaker":{"id":251,"title":"","firstname":"Rick","middleinitial":"","lastname":"Smolan","description":"Photographer","whotheyare":"Rick Smolan is the co-founder of the America 24\/7 and Day in the Life photography series -- and a natural storyteller in many media. His latest books are America at Home and Blue Planet Run.","whylisten":"<p>Photographer Rick Smolan is the co-creator of the <a href=\"http:\/\/www.myamericaathome.com\/customcover\/\" target=\"_blank\">America at Home<\/a>  project, which <strong>captured the &quot;emotions of home&quot; across the United States during a week in September 2008<\/strong>. More than 20,000 photographers -- pros and amateurs -- sent images to a team of editors assembled by Smolan and partner Jennifer Erwitt, who turned the photos into an eye-popping book. It&#39;s become a best-seller, of course, helped along by the fact that <a href=\"http:\/\/www.myamericaathome.com\/customcover\/\" target=\"_blank\">buyers can choose their own image for the cover<\/a>.&nbsp;<\/p><p>Smolan has long been a force for <strong>exploring culture through photography<\/strong>. The Day in the Life photography series that he cofounded -- best-selling photo books that captured life in America, Australia,  the Soviet Union ... -- were an &#39;80s cultural phenomenon. (Rare was the coffee table without at least one of them.) In the 1990s his production company, <a href=\"http:\/\/www.againstallodds.com\/\" target=\"_blank\">Against All Odds<\/a>, investigated the storytelling powers of interactive CD-ROMs with <em>From Alice to Ocean<\/em>, a narrative of a cross-Australia trek, and <em>Passage to Vietnam<\/em>, exploring that country as it opened up in the early 1990s. <em>24 Hours in Cyberspace<\/em> took a snapshot of the booming industry in 1996, and <em>One Digital Day<\/em> in 1997 further explored our fascination with tech.<\/p><p>Along with collaborator Jennifer Erwitt, Smolan published the beautiful <em><a href=\"http:\/\/marketplace.publicradio.org\/display\/web\/2007\/12\/17\/blueplanet_smolan_q\/\" target=\"_blank\">Blue Planet Run<\/a>&nbsp;<\/em>in 2007, about the drive to bring fresh drinking water to everyone on Earth. It&#39;s packed with glorious (and sometimes shocking) images and data about our planet&#39;s water. In an unprecedented move, Amazon.com offers <a href=\"http:\/\/geni.us\/blueplanetrun\" target=\"_blank\"><em>Blue Planet Run<\/em><\/a>  as a free PDF download. <a href=\"http:\/\/geni.us\/blueplanetrun\" target=\"_blank\"><strong>Download the free PDF of <em>Blue Planet Run<\/em> &gt;&gt;<\/strong><\/a><\/p><p>Smolan&#39;s latest work is&nbsp;<em>The Obama Time Capsule, <\/em>a collection of photographs and insights capturing the historical election of President Barack Obama, from the beginning of his campaign to his first 100 days in office.&nbsp;<\/p>","slug":"rick_smolan","published_at":"2008-06-27 10:27:00","updated_at":"2015-07-09 22:20:50"}}