{"speaker":{"id":252,"title":"","firstname":"Peter","middleinitial":"","lastname":"Diamandis","description":"Space activist","whotheyare":"Peter Diamandis runs the X Prize Foundation, which offers large cash incentive prizes to inventors who can solve grand challenges like space flight, low-cost mobile medical diagnostics and oil spill cleanup. He is the chair of Singularity University, which teaches executives and grad students about exponentially growing technologies.","whylisten":"<p><a href=\"http:\/\/blog.ted.com\/2012\/03\/14\/exclusive-qa-from-the-ted-stage-paul-gilding-and-peter-diamandis-debate\/\" target=\"_blank\"><strong>Watch the live onstage debate with Paul Gilding that followed Peter Diamandis&#39; 2012 TEDTalk &gt;&gt; <\/strong><\/a> <\/p><p>Peter Diamandis is the founder and chair of the&nbsp;<a style=\"color: #1155cc\" href=\"http:\/\/www.xprize.org\/\" target=\"_blank\">X Prize Foundation<\/a>, a nonprofit whose mission is simply &quot;to bring about radical breakthroughs for the benefit of humanity.&quot; By offering a big cash prize for a specific accomplishment, the X Prize stimulates competition and excitement around some of the planet&#39;s most important goals. Diamandis is also co-founder and chairman of&nbsp;<a style=\"color: #1155cc\" href=\"http:\/\/www.singularityu.org\/\" target=\"_blank\">Singularity University<\/a>&nbsp;which runs Exponential Technologies Executive and Graduate Student Programs.<\/p><p>Diamandis&#39; background is in space exploration -- before the X Prize, he ran a company that studied low-cost launching technologies and&nbsp;<a style=\"color: #1155cc\" href=\"http:\/\/www.gozerog.com\/\" target=\"_blank\">Zero-G<\/a>&nbsp;which offers the public the chance to train like an astronaut and experience weightlessness. But though&nbsp;<a style=\"color: #1155cc\" href=\"http:\/\/www.xprize.org\/space\/ansari-x-prize\" target=\"_blank\">the X Prize&#39;s first $10 million<\/a>&nbsp;went to a space-themed challenge, Diamandis&#39; goal now is to&nbsp;<a style=\"color: #1155cc\" href=\"http:\/\/www.xprize.org\/future-x-prizes\" target=\"_blank\">extend the prize<\/a>&nbsp;into health care, social policy, education and many other fields that could use a dose of competitive innovation. <\/p>","slug":"peter_diamandis","published_at":"2008-07-01 01:00:00","updated_at":"2013-07-24 18:32:34"}}