{"speaker":{"id":2527,"title":"","firstname":"Mia","middleinitial":"","lastname":"Birdsong","description":"Family activist","whotheyare":"Mia Birdsong advocates for strong communities and the self-determination of everyday people.\r\n","whylisten":"<p>Mia Birdsong has spent more than 20 years fighting for the self-determination and pointing out the brilliant adaptations of everyday people. In her current role as co-director of&nbsp;<a href=\"http:\/\/www.familystoryproject.org\/\" target=\"_blank\">Family Story<\/a>, she is updating this nation&#39;s outdated picture of the family in America (hint: rarely 2.5 kids and two heterosexual parents living behind a white picket fence). Prior to launching Family Story, Birdsong&nbsp;was the vice president of the Family Independence Initiative, an organization that leverages the power of data and stories to illuminate and accelerate the initiative low-income families take to improve their lives.<\/p><p>Birdsong, whose 2015 TED talk &quot;<a href=\"\/talks\/mia_birdsong_the_story_we_tell_about_poverty_isn_t_true?language=en\" target=\"_blank\">The story we tell about poverty isn&#39;t true<\/a>&quot; has been viewed more than 1.5 million times, has been published in the Stanford Social Innovation Review, Slate, Salon and On Being. She speaks on economic inequality, race, gender and building community at universities and conferences across the country. She co-founded&nbsp;<a href=\"https:\/\/www.facebook.com\/canerowkids\/\" target=\"_blank\">Canerow<\/a>, a resource for people dedicated to raising children of color in a world that reflects the spectrum of who they are. &nbsp;<\/p><p>Birdsong is also modern Renaissance woman. She has spent time organizing to abolish prisons, teaching teenagers about sex and drugs, interviewing literary luminaries like Edwidge Danticat, David Foster Wallace and John Irving, and attending births as a midwifery apprentice. She is a graduate of Oberlin College, an inaugural&nbsp;<a href=\"http:\/\/ascend.aspeninstitute.org\/\" target=\"_blank\">Ascend Fellow<\/a>&nbsp;of The Aspen Institute and a&nbsp;<a href=\"https:\/\/www.newamerica.org\/ca\/\" target=\"_blank\">New America California<\/a>&nbsp;Fellow. She sits on the Board of Directors of&nbsp;<a href=\"http:\/\/forwardtogether.org\/\" target=\"_blank\">Forward Together<\/a>.<\/p>","slug":"mia_birdsong","published_at":"2015-04-09 16:28:00","updated_at":"2016-11-28 19:12:13"}}