{"speaker":{"id":255,"title":"","firstname":"Torsten","middleinitial":"","lastname":"Reil","description":"Animating neurobiologist","whotheyare":"By coding computer simulations with biologically modeled nervous systems, Torsten Reil and his company NaturalMotion breathe life into the animated characters inhabiting the most eye-poppingly realistic games and movies around.","whylisten":"From modeling the mayhem of equine combat in Lord of the Rings: Return of the King to animating Liberty City gun battles in Grand Theft Auto IV, Torsten Reil&#39;s achievements are all over the map these days. Software that he helped create (with NaturalMotion, the imaging company he co-founded) has revolutionized computer animation of human and animal avatars, giving rise to some of the most breathtakingly real sequences in the virtual world of video games and movies- and along the way given valuable insight into the way human beings move their bodies.<br \/><br \/>Reil was a neural researcher working on his Masters at Oxford, developing computer simulations of nervous systems based on genetic algorithms-&nbsp; programs that actually used natural selection to evolve their own means of locomotion. It didn&#39;t take long until he realized the commercial potential of these lifelike characters. In 2001 he capitalized on this lucrative adjunct to his research, and cofounded NaturalMotion. Since then the company has produced motion simulation programs like Euphoria and Morpheme, state of the art packages designed to drastically cut the time and expense of game development, and create animated worlds as real as the one outside your front door. Animation and special effects created with Endorphin (NaturalMotion&#39;s first animation toolkit) have lent explosive action to films such as Troy and Poseidon, and NaturalMotion&#39;s software is also being used by LucasArts in video games such as the hotly anticipated Indiana Jones. <br \/><br \/>But there are serious applications aside from the big screen and the XBox console: NaturalMotion has also worked under a grant from the British government to study the motion of a cerebral palsy patient, in hopes of finding therapies and surgeries that dovetail with the way her nervous system is functioning.","slug":"torsten_reil","published_at":"2008-07-06 06:25:00","updated_at":"2008-07-08 06:09:00"}}