{"speaker":{"id":2555,"title":"","firstname":"Yuval Noah","middleinitial":"","lastname":"Harari","description":"Historian, author","whotheyare":"Yuval Noah Harari is a historian, philosopher and the bestselling author of \"Sapiens,\" \"Homo Deus,\" \"21 Lessons for the 21st Century\" and the graphic novel series \"Sapiens: A Graphic History.\" He is considered one of the world's most influential public intellectuals today.","whylisten":"<p>Yuval Noah Harari lectures as a professor of history at The Hebrew University of Jerusalem, where he specializes in world history, medieval history and military history. His current research focuses on macro-historical questions: What is the relationship between history and biology? What is the essential difference between Homo sapiens and other animals? Is there justice in history? Does history have a direction? Did people become happier as history unfolded?&nbsp;These topics are explored in his books, which have sold more than 40 million copies in 65 languages. Harari regularly connects broad historical questions to current global events in mainstream media, and has written and spoken extensively on the COVID-19 pandemic and the war in Ukraine.<\/p><p>Harari&#39;s 2011 book,&nbsp;<a href=\"http:\/\/geni.us\/sapienshistory\" target=\"_blank\"><em>Sapiens: A Brief History of Humankind<\/em><\/a>, explores what made homo sapiens the most successful species on the planet. His answer: We are the only animal that can believe in things that exist purely in our imagination, such as gods, states, money, human rights, corporations and other fictions, and we have developed a unique ability to use these stories to unify and organize groups and ensure cooperation.&nbsp;<em>Sapiens<\/em>&nbsp;has sold more than 21 million copies and been translated into more than 50 languages.&nbsp;<a href=\"https:\/\/www.gatesnotes.com\/About-Bill-Gates\/Summer-Books-2016\" target=\"_blank\">Bill Gates<\/a>,&nbsp;<a href=\"https:\/\/www.facebook.com\/zuck\/posts\/10102182252999291\" target=\"_blank\">Mark Zuckerberg<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/edition.cnn.com\/videos\/tv\/2016\/09\/03\/exp-gps-obama-clip-book-recommendation.cnn\" target=\"_blank\">President Barack Obama<\/a>&nbsp;have recommended <em>Sapiens<\/em> as a must-read.<\/p><div>In his 2015 book,&nbsp;<a href=\"http:\/\/geni.us\/wuCSvAK\" target=\"_blank\"><em>Homo Deus: A Brief History of Tomorrow<\/em><\/a>, Harari explores the projects, dreams and nightmares that will shape the 21st century -- from overcoming death to creating artificial life. He maps the future and asks fundamental questions: Where do we go from here? How will we protect this fragile world from our own destructive powers? Harari&#39;s&nbsp;2018 book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Lessons-21st-Century-Yuval-Harari\/dp\/0525512179\" target=\"_blank\"><em>21 Lessons for the 21st Century<\/em><\/a>, takes the pulse of the global climate, focusing on the biggest questions of the moment: What is really happening right now? What are today&#39;s greatest challenges and choices? What should we pay attention to?<\/div><div>&nbsp;<\/div><div>In 2020 Harari joined forces with comics artists David Vandermeulen and Daniel Casanave to create&nbsp;<a href=\"https:\/\/geni.us\/15bbIn\" target=\"_blank\"><em>Sapiens: A Graphic History<\/em><\/a>,&nbsp;a radical adaptation of the original Sapiens into a graphic novel series. These illustrated books cast Harari in the role of guide, who takes the reader through the entire history of the human species, accompanied by a range of fictional characters and traveling through time, space and popular culture references. Fall 2022 will see Harari writing for a younger audience for the first time, with the illustrated middle-school kids series <em>Unstoppable Us<\/em>.&nbsp;<\/div><div>&nbsp;<\/div><div>Following the international success of his books, Harari co-founded Sapienship with his husband and original agent, Itzik Yahav. Sapienship is a social impact company with projects in the fields of entertainment and education, whose main goal is to focus the public conversation on the most important global challenges facing the world today.<\/div>","slug":"yuval_noah_harari","published_at":"2015-06-09 18:00:00","updated_at":"2022-06-09 14:44:37"}}