{"speaker":{"id":256,"title":"","firstname":"A.J.","middleinitial":"","lastname":"Jacobs","description":"Author","whotheyare":"Immersing himself in alternate lifestyles and hilarious experiments (usually with himself as the guinea pig), writer A.J. Jacobs tests the limits of behavior, customs, culture -- and reports back on the wisdom and practical knowledge he's gained.","whylisten":"<p>A.J. Jacobs&#39;s writings stand at the intersection of philosophy, Gonzo journalism and performance art. Stubbornly curious and slyly perceptive, he takes immersive learning to its irrational and profoundly amusing extreme -- extracting wisdom and meaning after long stints as a self-styled guinea pig. For his <a href=\"http:\/\/blog.ted.com\/2005\/09\/aj_jacobs_rocks.php\" target=\"_blank\">widely circulated<\/a> <em>Esquire<\/em> article, &quot;<a href=\"http:\/\/www.esquire.com\/ESQ0905OUTSOURCING_214\" target=\"_blank\">My Outsourced Life<\/a>,&quot; he explored the phenomenon of outsourcing by hiring a team in Bangalore to take care of every part of his life -- from reading his emails to arguing with his wife to reading bedtime stories to his own son. A previous article, &quot;<a href=\"http:\/\/www.esquire.com\/features\/honesty0707\" target=\"_blank\">I Think You&#39;re Fat<\/a>,&quot; chronicled a brief, cringe-inducing attempt to live his life in Radical Honesty, telling all the truth, all the time. <\/p><p>Jacobs is author of <em><a href=\"http:\/\/geni.us\/theknowitall\" target=\"_blank\">The Know-It-All<\/a><\/em>, which documents the year he spent reading the <em>Encyclopedia Britannica <\/em>from A to Z, uncovering both funny and surprising factoids but also poignant insight into history and human nature. In 2007 he released&nbsp;<em><a href=\"http:\/\/geni.us\/yearoflivingbiblically\" target=\"_blank\">The Year of Living Biblically<\/a><\/em>, in which he attempted to follow every single rule in the Bible as literally as possible for an entire year. His book<em>&nbsp;<\/em><em><a href=\"http:\/\/geni.us\/guineapigdiaries\" target=\"_blank\">The Guinea Pig Diaries: My Life as an Experiment<\/a>&nbsp;<\/em>is a collection of numerous personal experiments, including living according to George Washington&#39;s rules of conduct, outsourcing every single task to India and posing as a woman on an online dating site. Jacobs recently released a new book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Thanks-Thousand-Gratitude-Journey-Books\/dp\/1501119923\" target=\"_blank\"><em>Thanks A Thousand: A Gratitude Journey<\/em><\/a>, which relates his life-altering journey&nbsp;to thank every single person involved in producing his morning cup of coffee.<\/p>","slug":"a_j_jacobs","published_at":"2008-07-17 01:00:00","updated_at":"2020-02-03 19:26:28"}}