{"speaker":{"id":2560,"title":"","firstname":"Johann","middleinitial":"","lastname":"Hari","description":"Journalist","whotheyare":"Johann Hari is the author of two \"New York Times\" best-selling books.","whylisten":"<p>Johann Hari&#39;s first book,&nbsp;<a href=\"https:\/\/geni.us\/SScIzVZ\" target=\"_blank\"><em>Lost Connections: Why You&#39;re Depressed and How to Find Hope<\/em><\/a>,&nbsp;is being translated into 27 languages and has been praised by a broad range of people -- from Elton John (who said it &quot;will change your life&quot;) to the <em>British Journal of General Practice<\/em>, who called it &quot;one of the most important texts in recent years.&quot; His second book,&nbsp;<a href=\"https:\/\/geni.us\/aHumkBN\" target=\"_blank\"><em>Chasing the Scream: The First and Last Days of the War on Drugs<\/em><\/a>,&nbsp;has been translated into 15 languages and is currently being adapted into a major Hollywood film by Oscar-winning director Lee Daniels, and into a non-fiction documentary series.<\/p><p>Hari graduated from Cambridge University with the highest degree grade, a Double First, in social and political sciences. He grew up in London, with a Swiss father who was a bus driver and a Scottish mother who worked in a shelter for victims of domestic violence. Today, he lives half the year in London, and he spends the other half of the year traveling to research his books.<\/p><p>Hari has written over the past eight years for some of the world&#39;s leading newspapers and magazines, including the <em>New York Times<\/em>, the <em>Los Angeles Times<\/em>, the <em>Guardian<\/em>, the <em>Spectator<\/em>, <em>Le Monde Diplomatique<\/em>, the <em>Melbourne Age<\/em>&nbsp;and Politico. He has also appeared on leading TV shows, including HBO&#39;s <em>Realtime With Bill Maher<\/em>. He was twice named &quot;National Newspaper Journalist of the Year&quot; by Amnesty International. He has also been named &quot;Cultural Commentator of the Year&quot; and &quot;Environmental Commentator of the Year&quot; at the Comment Awards, and &quot;Gay Journalist of the Year&quot; at the Stonewall Awards.&nbsp;<a href=\"https:\/\/www.patreon.com\/johannhari\" target=\"_blank\">Read about<\/a>&nbsp;what Johann is working on now.<\/p>","slug":"johann_hari","published_at":"2015-06-09 18:20:00","updated_at":"2019-09-18 15:23:01"}}