{"speaker":{"id":262,"title":"","firstname":"Reed","middleinitial":"","lastname":"Kroloff","description":"Architecture critic","whotheyare":"With an outspoken approach to the problems of rebuilding cites and a fearless eye for design, Reed Kroloff is helping to change the urban landscape of cities from New York to New Orleans.","whylisten":"<p>Already known throughout the architecture community for his award-winning tenure as editor-in-chief of <em>Architecture<\/em> magazine, Reed Kroloff came to the attention of the country at large after Hurricane Katrina. As Dean of Architecture at Tulane University, he was responsible for bringing back 97% of the school&#39;s student body and 100% of its faculty after the disaster. In 2005, New Orleans mayor Ray Nagin appointed Kroloff to the Bring New Orleans Back Commission to assist in the reconstruction of the city, and <strong>to help avoid creating, in Kroloff&#39;s words, &quot;a bad cartoon version of what New Orleans actually is.&quot;<\/strong> <\/p><p>His searing 2006 essay &quot;Black Like Me&quot; lays out the frustrations of a citizen of post-Katrina New Orleans -- &quot;<strong>the slow-burning frustration of being at the table but not invited to sit down<\/strong>.&quot; It&#39;s typical of his desire to look past simple aesthetics to the emotional heart of any building project.<\/p><p>Kroloff left New Orleans in 2007 to become the director of the Cranbrook Academy of Art in Bloomfield Hills, Michigan. <strong>He continues to promote excellence in urban design<\/strong> through his writing and his consulting firm Jones | Kroloff. He is also an active organizer and adviser for dozens of New Public Works competitions designed to choose architects for high-profile projects, including the Motown Center in Detroit, and a signature building for the University of Connecticut campus (the contract for which was awarded to Frank Gehry).<\/p>","slug":"reed_kroloff","published_at":"2008-07-27 18:55:00","updated_at":"2008-07-28 09:12:26"}}