{"speaker":{"id":263,"title":"","firstname":"Kwabena","middleinitial":"","lastname":"Boahen","description":"Bioengineer","whotheyare":"Kwabena Boahen wants to understand how brains work -- and to build a computer that works like the brain by reverse-engineering the nervous system. His group at Stanford is developing Neurogrid, a hardware platform that will emulate the cortex’s inner workings.","whylisten":"<p>Kwabena Boahen is the principal investigator at the Brains in Silicon lab at Stanford. He writes of himself: <\/p><p>Being a scientist at heart, I want to understand how cognition arises from neuronal properties. Being an engineer by training, <strong>I am using silicon integrated circuits to emulate the way neurons compute<\/strong>, linking the seemingly disparate fields of electronics and computer science with neurobiology and medicine.<\/p><p>My group&#39;s contributions to the field of neuromorphic engineering include <strong>a <a href=\"http:\/\/www.stanford.edu\/group\/brainsinsilicon\/pdf\/06_ZaghloulBoahenJNE06.pdf\">silicon retina<\/a> that could be used to give the blind sight<\/strong> and a <a href=\"http:\/\/www.stanford.edu\/group\/brainsinsilicon\/pdf\/02_conf_NIPS_Topo.pdf\">self-organizing chip<\/a> that emulates the way the developing brain wires itself up. Our work is widely recognized, with over <a href=\"http:\/\/www.stanford.edu\/group\/brainsinsilicon\/pubs.html\">sixty publications<\/a>, including a <a href=\"http:\/\/www.stanford.edu\/group\/brainsinsilicon\/pdf\/05_journ_SciAm_NeurmorphChips.pdf\">cover story<\/a> in the May 2005 issue of <em>Scientific American<\/em>. <br \/> <br \/> My current research interest is building a simulation platform that will enable the cortex&#39;s inner workings to be modeled in detail. While progress has been made linking neuronal properties to brain rhythms, the task of scaling up these models to link neuronal properties to cognition still remains. Making the supercomputer-performance required affordable is the goal of our <a href=\"http:\/\/www.stanford.edu\/group\/brainsinsilicon\/goals.html\">Neurogrid<\/a> project. <strong>It is at the vanguard of a profound shift in computing<\/strong>, away from the sequential, step-by-step Von Neumann machine towards a parallel, interconnected architecture more like the brain.<\/p>","slug":"kwabena_boahen","published_at":"2008-07-28 07:59:00","updated_at":"2008-07-30 06:14:33"}}