{"speaker":{"id":2655,"title":"","firstname":"Ole","middleinitial":"","lastname":"Scheeren","description":"Architect","whotheyare":"Ole Scheeren designs buildings that generate both functional and social spaces.","whylisten":"        <p class=\"p1\">Ole Scheeren is a German architect and principal of Buro Ole Scheeren with offices in Hong Kong, Beijing, Berlin and Bangkok. He is chief designer and leading the company&rsquo;s creative vision and strategic development.<\/p><p class=\"p1\">Ole Scheeren&rsquo;s current work includes the Guardian Art Center, a new exhibition space and headquarters for China&rsquo;s oldest art auction house currently under construction near the Forbidden City in Beijing; 1500 West Georgia, a residential high-rise in downtown Vancouver; DUO, a large-scale mixed-use urban development under construction in Singapore; MahaNakhon, at 314 meters Bangkok&rsquo;s tallest tower housing the Ritz-Carlton Residences; Angkasa Raya, a 268 meter tall landmark building in the center of Kuala Lumpur; and a large-scale mixed-use urban development in Shenzhen, China.<\/p><p class=\"p1\">Prior to launching Buro Ole Scheeren in 2010, Ole was Director and Partner along with Rem Koolhaas at OMA and responsible for the office&rsquo;s work across Asia. As partner-in-charge of one of the largest buildings in the world, he successfully led the design and realization of the CCTV and TVCC Towers in Beijing. Other projects include The Interlace, a residential complex in Singapore and the Taipei Performing Arts Center in Taiwan. He also directed OMA&rsquo;s work for Prada and completed the Prada Epicenters in New York and Los Angeles.<\/p><p class=\"p1\">Through Studio Ole Scheeren, he is exploring his more personal interest in non-architectural projects and interventions, such as Archipelago Cinema, a floating auditorium in the Andaman Sea for the &ldquo;Film on the Rocks&rdquo; Festival in Yao Noi, Thailand, and subsequently installed at the 13th Architecture Biennale in Venice. He also developed Mirage City Cinema, a cinema-architecture space commissioned by the Sharjah Art Foundation as part of the Sharjah Biennial 11 Film Programme.<\/p><p class=\"p1\">Ole Scheeren has contributed to various arts and culture projects and exhibitions throughout his career, including triennials in Beijing and Milan, China Design Now in London, the exhibition Cities on the Move at London&rsquo;s Hayward Gallery and in the city of Bangkok, Media City Seoul and the Rotterdam Film Festival. For the Museum of Modern Art he designed two exhibitions in New York and Beijing featuring the CCTV project.<\/p><p class=\"p1\">He regularly lectures at various international institutions and conferences, serves on juries for awards and competitions, and has been awarded numerous prizes, including the CTBUH 2013 Best Tall Building award for CCTV and the 2015 inaugural Urban Habitat Award for The Interlace.&nbsp;<\/p><p class=\"p1\">Educated at the universities of Karlsruhe and Lausanne, Ole Scheeren graduated from the Architectural Association in London and was awarded the RIBA Silver Medal.<\/p>","slug":"ole_scheeren","published_at":"2015-09-23 16:43:00","updated_at":"2016-01-14 16:10:32"}}