{"speaker":{"id":2660,"title":"","firstname":"Daniel","middleinitial":"","lastname":"Levitin","description":"Neuroscientist","whotheyare":"Daniel Levitin incorporates findings from neuroscience into everyday life.","whylisten":"<p>Dr. Daniel Levitin is a neuroscientist at McGill University in Montreal, dean at Minerva Schools in San Francisco and a musician. His research focuses on pattern processing in the brain.<\/p><p>His three books&nbsp;<a href=\"http:\/\/geni.us\/brainonmusic\" target=\"_blank\"><em>This Is Your Brain on Music<\/em><\/a>,&nbsp;<a href=\"http:\/\/geni.us\/worldinsixsongs\" target=\"_blank\"><em>The World in Six Songs<\/em><\/a>, and the recent&nbsp;<a href=\"http:\/\/geni.us\/organizedmind\" target=\"_blank\"><em>The Organized Mind<\/em><\/a>&nbsp;are all bestsellers. A polymath at heart, he has performed with top musicians and holds a few gold and platinum records.<\/p><p>Levitin earned his B.A. in Cognitive Psychology and Cognitive Science at Stanford University, and went on to earn his Ph.D. in Psychology from the University of Oregon, researching complex auditory patterns and pattern processing in expert and non-expert populations. He completed post-doctoral training at Stanford University Medical School (in Neuroimaging) and at UC Berkeley (in Cognitive Psychology). He has consulted on audio sound source separation for the U.S. Navy, and on audio quality for several rock bands and record labels (including the Grateful Dead and Steely Dan), and served as one of the &ldquo;Golden Ears&rdquo; expert listeners in the original Dolby AC3 compression tests. He worked for two years at the Silicon Valley think tank Interval Research Corporation.<\/p><p>He taught at Stanford University in the Department of Computer Science, the Program in Human-Computer Interaction, and the Departments of Psychology, Anthropology, Computer Music, and History of Science.&nbsp;<\/p>","slug":"daniel_levitin","published_at":"2015-09-23 17:13:00","updated_at":"2015-10-30 16:11:02"}}