{"speaker":{"id":267,"title":"","firstname":"Ory","middleinitial":"","lastname":"Okolloh","description":"Blogger and activist","whotheyare":"Ory Okolloh maintains the blog Mzalendo, providing an unprecedented look at the doings of Kenya's parliament -- information once unavailable to Kenyan citizens.","whylisten":"<p>Ory Okolloh is a blogger and open-government activist. She runs <a href=\"http:\/\/www.mzalendo.com\/\" target=\"_blank\">Mzalendo<\/a>, <strong>a pioneering civic website that tracks the performance of Kenya&#39;s Parliament<\/strong> and its Parliamentarians. With a vote tracker, articles and opinion pieces, the site connects Kenyans to their leaders and opens the lid on this powerful and once-secretive body. (This is a Parliament that finally agreed to have its procedings <a href=\"http:\/\/www.networkworld.com\/news\/2008\/072508-kenyan-parliament-airs-proceedings-to.html\" target=\"_blank\">televised<\/a>  in <em>August 2008<\/em>.) <\/p><p>Okolloh&#39;s own blog is called <a href=\"http:\/\/www.kenyanpundit.com\/\" target=\"_blank\">Kenyan Pundit<\/a>, and it tracks her work with Mzalendo and her other efforts as part of the rebuilding of Kenya, following the post-election violence in late 2007 (she collected a powerful series of <a href=\"http:\/\/www.kenyanpundit.com\/2008\/01\/06\/diary-1\/\" target=\"_blank\">diaries of the violence<\/a>, dozens of essays  from Kenyans and others -- well worth a read). <\/p><p>Okolloh is part of a wave of young Africans who are using the power of blogging, SMS and web-enabled openness to push their countries forward and help Africans to truly connect. Tools like <a href=\"http:\/\/www.kenyanpundit.com\/2008\/01\/22\/ushahidi-local-sms-number-6007\/\" target=\"_blank\">Ushahidi<\/a>  help to link a people whose tribal differences, as Okolloh points out again and again, are often cynically exploited by a small group of leaders. Only by connecting Africans can this cycle be broken.<\/p>","slug":"ory_okolloh","published_at":"2008-08-01 08:02:00","updated_at":"2016-06-15 14:48:30"}}