{"speaker":{"id":2682,"title":"","firstname":"Jason","middleinitial":"","lastname":"deCaires Taylor","description":"Sculptor","whotheyare":"Jason deCaires Taylor's underwater installations offer views of another world, where the artistic efforts of man meet the vivifying power of nature.","whylisten":"        <p class=\"p1\">Born in 1974 to an English father and Guyanese mother, Taylor grew up in Europe and Asia, where he spent much of his early childhood exploring the coral reefs of Malaysia. Educated in the South East of England, Taylor graduated from the London Institute of Arts in 1998 with a BA Honours in Sculpture and went on to become a fully qualified diving instructor and underwater naturalist. With over 20 years diving experience under his belt, Taylor is also an award winning underwater photographer, famous for his dramatic images, which capture the metamorphosing effects of the ocean on his evolving sculptures.<\/p> <p class=\"p1\">In 2006, Taylor founded and created the world&rsquo;s first underwater sculpture park. Situated off the west coast of Grenada in the West Indies, it is now listed as one of the Top 25 Wonders of the World by National Geographic and was instrumental in the creation of a national marine protected area by the local government. In 2009, he co-founded MUSA (Museo Subacu&aacute;tico de Arte), a monumental museum with a collection of over 500 of his sculptural works, submerged off the coast of Cancun, Mexico. Both of these ambitious, permanent public works have a practical, functional aspect, facilitating positive interactions between people and fragile underwater habitats while at the same relieving pressure on natural resources.<\/p> <p class=\"p1\">Taylor&#39;s pioneering public art projects are not only examples of successful marine conservation but also works of art that seek to encourage environmental awareness, instigate social change and lead us to appreciate the breathtaking natural beauty of the underwater world. He is currently based in Lanzarote part of the Canary Islands where he is working on a major new underwater museum for the Atlantic Ocean.<\/p>","slug":"jason_decaires_taylor","published_at":"2015-10-08 16:33:00","updated_at":"2015-12-22 17:15:32"}}