{"speaker":{"id":2709,"title":"","firstname":"Tea","middleinitial":"","lastname":"Uglow","description":"Designer","whotheyare":"Tea Uglow leads part of Google's Creative Lab specializing in work with cultural organizations, artists, writers and producers on experiments using digital technology at the boundaries of traditional cultural practice.","whylisten":"<p>Tea Uglow has worked at Google for nearly 10 years, starting Google&#39;s Creative Lab in Europe and, since 2012, building a Creative Lab for the Asia Pacific region in Sydney, Australia. She works with cultural organizations and practitioners to enable artists, writers and performers to look at new ways in which we can use digital technology to augment traditional art, theatre and music. Uglow believes that by experimenting with digital tools at the creative core of culture we can transform existing cultural practice without losing the tradition, values and intangible qualities that make the arts so valuable.<\/p><p>Previous projects include&nbsp;<a href=\"https:\/\/editionsatplay.withgoogle.com\/#\/\" target=\"_blank\">Editions at Play<\/a>&nbsp;(books), Hangouts in History (education), Dream40 (theatre, with the RSC),&nbsp;<a href=\"https:\/\/www.buildwithchrome.com\/\" target=\"_blank\">Build with Chrome<\/a>&nbsp;(with LEGO),&nbsp;<a href=\"http:\/\/www.chromeweblab.com\/\" target=\"_blank\">Web Lab<\/a>&nbsp;(with London&#39;s Science Museum),&nbsp;<a href=\"https:\/\/www.youtube.com\/user\/lifeinaday\" target=\"_blank\">Life in a Day<\/a>&nbsp;(YouTube film with Ridley Scott) and the&nbsp;<a href=\"https:\/\/www.youtube.com\/user\/symphony\" target=\"_blank\">YouTube Symphony Orchestra<\/a>&nbsp;(with the LSO). Uglow is proud of her early involvement in the Art Project (now&nbsp;<a href=\"https:\/\/www.google.com\/culturalinstitute\/beta\/\" target=\"_blank\">Google&#39;s Cultural Institute<\/a>).<\/p><p>Uglow speaks on innovation and digital futures around the world. At the time of her TEDxSydney talk (2015), Tea was still presenting as male and using her boy-name, which is Tom.&nbsp;<\/p><p>Uglow studied fine art at the Ruskin in Oxford before completing two further degrees in book arts and design management at UAL. She spent six years in art&nbsp;publishing and design management for charities as well as in various digital start-ups before joining Google in 2006. Prior to Google, Uglow worked for the Royal Academy of Arts, the Wellcome Trust, Random House and Christian Aid. She is on the board of the Biennale of Sydney (art) and formerly D&amp;AD (design) and AWARD (advertising).<\/p><p>Uglow is also a very active and proud parent of two small boys. She lives in Sydney, Australia.<\/p>","slug":"tom_uglow","published_at":"2015-10-21 18:57:00","updated_at":"2018-07-05 15:09:17"}}