{"speaker":{"id":2724,"title":"","firstname":"Raymond","middleinitial":"","lastname":"Wang","description":"Inventor","whotheyare":"Raymond Wang won the top prize in the 2015 Intel Science and Engineering Fair for his invention that circulates fresh air on planes and reduces transmission of germs between passengers.","whylisten":"        <p class=\"p1\">Raymond Wang is a Canadian youth innovator who is passionate about science, technology, engineering and entrepreneurship. He is one of Canada&#39;s Top 20 Under 20, and most recently, the recipient of the Gordon E. Moore award for the Top Project at the 2015 Intel International Science and Engineering Fair (ISEF).<\/p><p class=\"p1\">Raymond enjoys exploring STEM and promoting global sustainability. His latest engineering innovations, including his work with aircraft cabin airflow and his inventions of the &ldquo;Weather Harvester,&rdquo; &ldquo;Smart Knee Assistant&rdquo; and &quot;Smart Bin,&rdquo; have achieved international recognition.<\/p><p class=\"p1\">Raymond is enthusiastic about inspiring others to pursue STEM opportunities. He actively reaches out to the local community through camps &amp; associations, in addition to communities around the world through YouTube &amp; Modern Media.<\/p><p class=\"p1\">Having a strong passion for sustainability, Raymond has founded Sustainable Youth Canada, a youth-led non-profit organization dedicated to empowering young people in Affiliated Regions established from coast to coast to be leaders in tackling issues with environmental and energy sustainability.<\/p><p class=\"p1\">In his spare time, Raymond enjoys exploring music as both a National Youth Band clarinetist and an avid pianist. He is also a keen director of films and videos; many of his productions have been recognized at local film festivals.&nbsp;<\/p><p class=\"p1\">Raymond envisions himself pursuing a career in science, applying research and innovation with a business approach to do his part in bettering the world.<\/p>","slug":"raymond_wang","published_at":"2015-11-10 19:58:00","updated_at":"2015-12-10 16:11:27"}}