{"speaker":{"id":274,"title":"","firstname":"Noah","middleinitial":"","lastname":"Feldman","description":"Constitutional law scholar","whotheyare":"Noah Feldman studies the intersection of religion, politics and law.","whylisten":"<p>Noah Feldman is a professor and writer who tries to figure out how to make the government follow the rules; what the rules are that the government has to follow; and what to do if the rules are being broken. In his work, he asks questions like: How can a 225-year-old constitutional blueprint still work? Can you design a new and better constitution from scratch in places like Iraq and Tunisia? What rights do we have, really?<\/p><p>Feldman is the Felix Frankfurter Professor of Law at Harvard Law School and a contributing writer for <em>Bloomberg View<\/em>. He served as senior constitutional advisor to the Coalition Provisional Authority in Iraq, and advised members of the Iraqi Governing Council on the drafting of the Transitional Administrative Law or interim constitution. He is writing a biography on James Madison, principal author of the Constitution and fourth president of the US; it&#39;s forthcoming in 2017. <\/p><p>Feldman is the author of six other books: <em>Cool War: The Future of Global Competition<\/em> (Random House, 2013); S<em>corpions: The Battles and Triumphs of FDR&rsquo;s Great Supreme Court Justices<\/em> (Twelve Publishing, 2010); <a href=\"http:\/\/geni.us\/islamicstate\" target=\"_blank\"><em>The Fall and Rise of the Islamic State<\/em><\/a> (Princeton University Press, 2008); <em>Divided By God: America&#39;s Church-State Problem and What We Should Do About It<\/em> (Farrar, Straus &amp; Giroux 2005); <em>What We Owe Iraq: War and the Ethics of Nation-building<\/em> (Princeton University Press 2004) and <em>After Jihad: America and the Struggle for Islamic Democracy<\/em> (Farrar, Straus &amp; Giroux 2003. He most recently co-authored two textbooks:<em> Constitutional Law, Eighteenth Edition<\/em> (Foundation Press, 2013) and <em>First Amendment Law, Fifth Edition<\/em> (Foundation Press, 2013).<\/p> ","slug":"noah_feldman","published_at":"2008-08-26 11:40:00","updated_at":"2017-04-27 19:43:14"}}