{"speaker":{"id":2748,"title":"","firstname":"Guillaume","middleinitial":"","lastname":"Néry","description":"World champion freediver","whotheyare":"With just one breath, Guillaume Néry can dive to -125m below the water's surface.","whylisten":"        <p class=\"p1\">Guillaume N&eacute;ry is a French freediving champion, specializing in deep diving. As a multiple world record holder and the double reigning world champion, Guillaume&#39;s goals go well beyond the simple realm of sport. With a perfect combination of aesthetics, performance, films and exploration, Guillaume practices his discipline like an art form &mdash; it has become his way of life.<\/p> <p class=\"p1\">Guillaume grew up by the Mediterranean Sea, in Nice. As a child, he used to go diving every summer with his flippers and mask, accompanied by his father, to discover the wonders of the underwater world. At the age of 14, he and a friend took up a challenge: to hold their breath for as long as possible. The simple game became an obsession and led him one day to meet Claude Chapuis, the founder of the international AIDA federation (Worldwide Federation for breath-hold diving). Claude became Guillaume&rsquo;s mentor.<\/p> <p class=\"p1\">True to the Nice school of diving, Guillaume devoted all his time and energy to his passion. He made huge progress when working alongside Loic Leferme (5x No-Limits world record holder), who later became a role model, guide and close friend.<\/p> <p class=\"p1\">In 2002, he became the youngest ever freedive record holder, by diving to a depth of -87m using the force of his fins alone. That marked the beginning of a great adventure. Guillaume then beat the world record 3 times, became the world team champion in 2008 and the individual world champion in Greece in 2011, diving down to -117m. Nowadays, he dives until -125m of depth, the new French record<\/p> <p class=\"p1\">Guillaume also teaches deep diving at his school, CIPA (in Nice), conducts training, is involved in business life and sets sail across the world&#39;s oceans searching for new areas to explore.<\/p> <p class=\"p1\">However, it was thanks to the film he produced in 2010 with his partner Julie Gautier, <em>Free Fall<\/em>, that the Frenchman&#39;s career truly took off. One scene shows Guillaume walking on a seabed, towards an underwater chasm: the Deans Blue Hole (Bahamas), the deepest blue hole in the world. Suddenly, he jumps into emptiness and starts his free fall into the chasm. In just a few days, these images had been seen all around the world, revealing a new, artistic and poetic approach to freediving.<\/p> <p class=\"p1\">Since then, the couple has carried out a number of other film projects, including <em>Narcoses<\/em> or, recently, <em>Ocean Gravity<\/em>. They also launched their own website dedicated to all their creations:&nbsp;<a href=\"http:\/\/www.lesfilmsengloutis.com\" target=\"_blank\">www.lesfilmsengloutis.com<\/a> <\/p>","slug":"guillaume_nery","published_at":"2015-11-12 00:17:00","updated_at":"2015-12-04 16:00:08"}}