{"speaker":{"id":2750,"title":"","firstname":"António","middleinitial":"","lastname":"Guterres","description":"Secretary-General of the United Nations","whotheyare":"António Guterres is at the forefront of fighting the climate emergency and achieving the Sustainable Development Goals.","whylisten":"        <p class=\"p1\">Ant&oacute;nio Guterres, the ninth Secretary-General of the United Nations, has had a long and varied career in public service rooted in one overarching imperative: to promote human dignity for all.<\/p><p class=\"p1\">Whether working as a volunteer in the poor neighbourhoods of Lisbon or representing his constituency in the Portuguese parliament, and from his years as Prime Minister to his service as United Nations High Commissioner for Refugees, Guterres has sought to ease suffering, protect the vulnerable and ensure human rights for all. These priorities have remained at the core of his efforts today as Secretary-General of the United Nations. Since taking office January 2017, he has worked to promote peace, advance prevention, combat hatred and mobilize ambition in fighting the climate emergency and achieving the Sustainable Development Goals.<\/p><p class=\"p1\">Guterres has also recognized the need for the United Nations itself to be more innovative and effective, and has set in motion wide-ranging reforms to make full use of new technology and to enhance agility, transparency and accountability. He has also pressed to make the organization more equal, including through gender parity -- with major milestones met well ahead of schedule -- and improved geographical representation.&nbsp; &nbsp;&nbsp;<\/p><p class=\"p1\">Mr. Guterres has proclaimed himself a proud multilateralist. &quot;But international cooperation cannot be taken for granted.&quot; he has stressed. &quot;We must prove its value by addressing the real problems people face.&quot;<\/p><p class=\"p1\">Guterres was born in Lisbon in 1949 and graduated from the Instituto Superior T&eacute;cnico with a degree in engineering. He is fluent in Portuguese, English, French and Spanish. He is married to Catarina de Almeida Vaz Pinto, Deputy Mayor for Culture of Lisbon, and has two children, a stepson and three grandchildren.<\/p>","slug":"antonio_guterres","published_at":"2015-11-17 23:20:00","updated_at":"2020-10-02 20:23:29"}}