{"speaker":{"id":2765,"title":"","firstname":"Nadia","middleinitial":"","lastname":"Lopez","description":"Educator","whotheyare":"Nadia Lopez is the founding principal of Mott Hall Bridges Academy, where she is showing the world how underprivileged communities can beat the odds and create positive institutions that have a global impact.","whylisten":"<p>Dr. Nadia Lopez is pioneering a path of inspired leadership. The founding principal of&nbsp;<a href=\"http:\/\/www.mhbabrooklyn.com\/\" target=\"_blank\">Mott Hall Bridges Academy<\/a>, a New York City Public School, Lopez became a viral sensation after one of her students was featured on the popular blog, Humans of New York. Millions of people around the world discovered the positive learning environment, high expectations and growing success rate at her school, which is located right in the middle of one of the most under-served communities in America. In 2015 a Humans of New York fundraiser raised $1.4 million to take Lopez&#39;s students on college trips that include Harvard University, Summer STEAM programs and college scholarships.<\/p><p>Lopez&#39;s story was shared across numerous media outlets and resulted in her guest appearing on the Ellen Show, visiting President Barack Obama at the White House and receiving the Medal of Distinction from Barnard College. In addition, Lopez was honored alongside First Lady Michelle Obama with the Change Agent Award at the Black Girls Rock show hosted on BET Networks.<\/p><p>Lopez&#39;s passion, belief in children and strong conviction has been unwavering in her belief that her community needs strong leadership. Despite the adversities she faced in opening Mott Hall Bridges Academy in 2010, Lopez is encouraged and inspired to see children overcome the &quot;beautiful challenges&quot; of Brownsville and ensuring that they are admitted into some of the most competitive high schools in New York City. Understanding the power of programming, Lopez continues to impact the lives of children through her &quot;She Is Me&quot; and &quot;I Matter&quot; initiatives, which have served thousands of youth throughout Central Brooklyn by providing workshops, forums and mentoring. Lopez continues to influence and inspire the world through her company The Lopez Effect, which offers a blueprint for personal and organizational success.<\/p>","slug":"nadia_lopez","published_at":"2015-11-23 19:11:00","updated_at":"2016-09-24 16:03:03"}}