{"speaker":{"id":2767,"title":"","firstname":"Dena","middleinitial":"","lastname":"Simmons","description":"Educator","whotheyare":"Dena Simmons believes that creating a safe environment for children is an essential component of education.","whylisten":"<p>Dena Simmons, Ed.D., is a lifelong activist, educator and student of life. A native of the Bronx, New York, Simmons grew up in a one-bedroom apartment with her two sisters and immigrant mother. There, she learned and lived the violence of injustice and inequity and decided to dedicate her life to educating and empowering others. As the Director of Education at the&nbsp;<a href=\"http:\/\/ei.yale.edu\" target=\"_blank\">Yale Center for Emotional Intelligence<\/a>, she supports schools throughout the nation and world to use the power of emotions to create a more effective and compassionate society.<\/p><p>Prior to her work at the Center, Simmons&nbsp;served as an educator, teacher educator, diversity facilitator and curriculum developer. She is a leading voice on teacher education and has spoken across the country about social justice pedagogy, diversity, education reform, emotional intelligence and bullying in K-12 school settings, including the United Nations and two&nbsp;<a href=\"https:\/\/www.youtube.com\/results?search_query=dena+simmons+TEDx\" target=\"_blank\">TEDx talks<\/a>. She writes and has written for numerous outlets including&nbsp;<a href=\"http:\/\/www.tolerance.org\/author\/dena-simmons\" target=\"_blank\">Teaching Tolerance<\/a>,&nbsp;<a href=\"https:\/\/medium.com\/@DenaSimmons\" target=\"_blank\">Bright on Medium<\/a>,&nbsp;<a href=\"https:\/\/feministteacher.com\/tag\/dena-simmons\/\" target=\"_blank\">Feminist Teacher<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/feministing.com\/2010\/12\/16\/making-the-links-between-street-harrassment-bullying-and-toxic-masculinity\/\" target=\"_blank\">Feministing<\/a>. Simmons&nbsp;has been profiled in the&nbsp;<a href=\"http:\/\/www.huffingtonpost.com\/Ola-Ojewumi\/from-a-onebedroom-bronx-a_b_6425464.html\" target=\"_blank\">Huffington Post<\/a>, the AOL\/PBS project, &quot;<a href=\"http:\/\/www.makers.com\/dena-simmons\" target=\"_blank\">MAKERS: Women Who Make America<\/a>,&quot; and a Beacon Press Book,&nbsp;<a href=\"http:\/\/geni.us\/013HndQ\" target=\"_blank\"><em>Do It Anyway: The New Generation of Activists<\/em><\/a>.<\/p><p>Simmons is a recipient of a Harry S. Truman Scholarship, a J. William Fulbright Fellowship, an Education Pioneers Fellowship, a Paul and Daisy Soros Fellowship, a Phillips Exeter Academy Dissertation Fellowship and an Arthur Vining Davis Aspen Fellowship among others. She is a graduate of Middlebury College and Pace University. She received her doctorate degree from Teachers College, Columbia University.<\/p><p>Simmons&#39;s research interests include teacher preparedness to address bullying in the K-12 school setting as well as the intersection of social and emotional learning and culturally responsive pedagogy -- all in an effort to ensure and foster justice and safe spaces for all.<\/p>","slug":"dena_simmons","published_at":"2015-11-23 19:12:00","updated_at":"2016-12-15 15:55:31"}}