{"speaker":{"id":2768,"title":"","firstname":"Sara","middleinitial":"","lastname":"Ramirez","description":"Singer, songwriter, actress","whotheyare":"Broadway and TV veteran Sara Ramirez challenges stereotypes even as she beguiles audiences.","whylisten":"<p>Sara Ramirez has been known to viewers for the past 11 years as orthopedic surgeon Dr. Callie Torres on ABC&#39;s drama &quot;Grey&#39;s Anatomy.&quot; Prior to that role, Ramirez was seen on Broadway in Monty Python&#39;s <em>Spamalot <\/em>as Lady of the Lake, for which she earned both a Tony Award for Best Performance by a Featured Actress in a Musical&nbsp;and an Outer Critics Award for Outstanding Featured Actress in a Musical.<\/p><p>Ramirez graduated from the Juilliard Drama School. Shortly after graduation, she made her Broadway debut starring in Paul Simon&#39;s <em>The Capeman<\/em>. Following that, she starred on Broadway in <em>Fascinating Rhythm<\/em> and <em>A Class Act<\/em>, as well as Off-Broadway in <em>The Vagina Monologues<\/em>. For the past four seasons, Ramirez has been the voice of Queen Miranda in the Disney Channel animated series, &quot;Sofia The First.,&quot; She has also appeared on &quot;NYPD Blue,&quot; &quot;Law &amp; Order: SVU,&quot; &quot;Third Watch&quot; and &quot;Spin City.&quot; In 2011, she captured a whole new audience when she performed the most prominent songs on the special music event episode of &quot;Grey&#39;s Anatomy&quot; and released her own EP on iTunes.<\/p><p>Most recently, Ramirez co-hosted and performed at TED Talks Live on PBS, and produced two films: <em>Loserville<\/em> (released in fall 2016 in partnership with the Pacer Foundation&#39;s Center for Bullying Prevention &amp; Stomp Out Bullying) and the virtual reality film experience <em>Out of Exile: Daniel&rsquo;s Story<\/em>, an Official Selection Sundance Film Festival and Lumiere Award nominee directed by Nonny de la Pe&ntilde;a. Her next executive producing project is <em>The Death and Life of Marsha P. Johnson<\/em>, a documentary by filmmaker David France of <em>How to Survive a Plague<\/em> about LGBTQ civil rights transgender pioneers Sylvia Rivera and Marsha P. Johnson.<\/p><p>In 2015, Ramirez was awarded the Ally for Equality Award by the Human Rights Campaign Foundation. In addition to her role as a member of the True Colors Fund&rsquo;s Board of Directors, she supports The True Colors Fund, Bisexual Organizing Project, NDLON, Mujerez De Maiz, The Task Force and The San Diego\/New York\/San Francisco LGBT Centers.<\/p><p>(Photo: Paul Gregory)<\/p>","slug":"sara_ramirez","published_at":"2015-11-23 19:12:00","updated_at":"2017-03-03 17:22:39"}}