{"speaker":{"id":2775,"title":"","firstname":"Samantha","middleinitial":"","lastname":"Nutt","description":"Doctor, writer and humanitarian","whotheyare":"Samantha Nutt envisions a world where no child knows war.","whylisten":"<p class=\"p1\">Samantha Nutt is a leading authority on the civilian impact of war and a bestselling author. A medical doctor and the founder of the international humanitarian organizations War Child USA and War Child Canada, Dr. Nutt has worked with children and their families at the frontline of many of the world&#39;s major crises -- from Iraq to Afghanistan, Somalia to the Democratic Republic of Congo, and Sierra Leone to Darfur, Sudan.&nbsp;With a career that has spanned more than two decades and dozens of conflict zones, her international work has benefited millions of war-affected children globally.<\/p><p class=\"p1\">Dr. Nutt writes and speaks about war, international aid and foreign policy. Her work has been published by a variety of print and online media, including the Globe and Mail, Huffington Post, Reuters, Maclean&#39;s Magazine and many others. She regularly appears on news shows discussing foreign affairs and is a panelist on CBC&#39;s flagship news program, The National.&nbsp;Dr. Nutt&#39;s critically-acclaimed book,&nbsp;<a href=\"http:\/\/geni.us\/DamnedNations\" target=\"_blank\"><em>Damned Nations: Greed, Guns, Armies and Aid<\/em><\/a>, was a bestseller.&nbsp;<\/p><p class=\"p1\">Dr. Nutt is a recipient of the Order of Canada, Canada&#39;s highest civilian honour, and has been recognized as a Young Global Leader by the World Economic Forum. She is a staff physician at Women&#39;s College Hospital in Toronto and an assistant professor of Medicine at the University of Toronto. She holds a degree in medicine from McMaster University and post graduate degrees from the London School of Hygiene and Tropical Medicine (University of London) and the University of Toronto. Dr. Nutt is also a member of the Royal College of Physicians and Surgeons of Canada, as well as the Canadian College of Family Practice.<\/p>","slug":"samantha_nutt","published_at":"2015-11-23 19:16:00","updated_at":"2016-06-24 04:11:41"}}