{"speaker":{"id":278,"title":"","firstname":"Jonathan","middleinitial":"","lastname":"Haidt","description":"Social psychologist","whotheyare":"Jonathan Haidt studies how -- and why -- we evolved to be moral and political creatures.","whylisten":"<p>By understanding more about our moral psychology and its biases, Jonathan Haidt says we can design better institutions (including companies, universities and democracy itself), and we can learn to be more civil and open-minded toward those who are not on our team.<\/p><p>Haidt is a social psychologist whose research on morality across cultures led to his <a href=\"\/talks\/jonathan_haidt_on_the_moral_mind.html\" target=\"_blank\">2008 TED Talk<\/a>&nbsp;on the psychological roots of the American culture war, and his 2013 TED Talk on how &quot;common threats can make common ground.&quot; In both of those talks he asks, &quot;Can&#39;t we all disagree more constructively?&quot; Haidt&#39;s&nbsp;<a href=\"http:\/\/www.ted.com\/talks\/jonathan_haidt_humanity_s_stairway_to_self_transcendence\" target=\"_blank\">2012 TED Talk<\/a>&nbsp;explored the intersection of his work on morality with his work on happiness to talk about &quot;hive psychology&quot; -- the ability that humans have to lose themselves in groups pursuing larger projects, almost like bees in a hive. This hivish ability is crucial, he argues, for understanding the origins of morality, politics, and religion. These are ideas that Haidt develops at greater length in his book, <a href=\"http:\/\/righteousmind.com\/\" target=\"_blank\"><em>The Righteous Mind: Why Good People are Divided by Politics and Religion<\/em><\/a>.<\/p><p>Haidt joined New York University Stern School of Business in July 2011. He is the Thomas Cooley Professor of Ethical Leadership, based in the Business and Society Program. Before coming to Stern, Professor Haidt taught for 16 years at the University of Virginia in the department of psychology.<\/p><p>Haidt&#39;s writings appear frequently in the <em>New York Times<\/em> and <em>The Wall Street Journal<\/em>. He was named one of the top global thinkers by Foreign Policy magazine and by Prospect magazine. Haidt received a B.A. in Philosophy from Yale University, and an M.A. and Ph.D. in Psychology from the University of Pennsylvania.<\/p>","slug":"jonathan_haidt","published_at":"2008-09-17 01:33:00","updated_at":"2019-03-28 16:46:24"}}