{"speaker":{"id":2791,"title":"","firstname":"Eric","middleinitial":"","lastname":"Haseltine","description":"Author, futurist, innovator","whotheyare":"Eric Haseltine applies discoveries about the brain to innovation and forecasting game-changing advances in science and technology.","whylisten":"<p>Dr. Eric Haseltine is a neuroscientist and futurist who has applied a brain-centered approach to help organizations in aerospace, entertainment, healthcare, consumer products and national security transform and innovate. He is the author of <em><a href=\"https:\/\/www.amazon.com\/Long-Fuse-Big-Bang-Achieving\/dp\/1401323634\" target=\"_blank\">Long Fuse, Big Bang: Achieving Long-Term Success Through Daily Victories<\/a>.<\/em>&nbsp;For five years, he wrote a monthly column on the brain for <em>Discover<\/em> magazine and is a frequent contributor to <em>Psychology Today&#39;<\/em>s web site, where his popular blog on the brain has garnered over 800,000 views. Haseltine received the Distinguished Psychologist in Management Award from the Society of Psychologists in Management and has published 41 patents and patent applications in optics, media and entertainment technology.<\/p><p class=\"MsoNormal\">In 1992 he joined Walt Disney Imagineering to help found the Virtual Reality Studio, which he ultimately ran until his departure from Disney in 2002. When he left Disney, Haseltine was executive vice president of Imagineering and head of R&amp;D for the entire Disney Corporation, including film, television, theme parks, Internet and consumer products.<\/p><p class=\"MsoNormal\">In the aftermath of 9\/11, Eric joined the National Security Agency to run its Research Directorate. Three years later, he was promoted to associate of director of National Intelligence, where he oversaw all science and technology efforts within the United States Intelligence Community as well as fostering development innovative new technologies for countering cyber threats and terrorism. For his work on counter-terrorism technologies, he received the National Intelligence Distinguished Service Medal in 2007.<\/p><p class=\"MsoNormal\">Haseltine serves on numerous boards, and is an active consultant, speaker and writer. Over the past three years, he has focused heavily on developing innovation strategies and consumer applications for the Internet of Things, virtual reality and augmented reality.<\/p><p class=\"MsoNormal\">Haseltine continues to do basic research in neuroscience, with his most recent publications focusing on the mind-body health connection and exploitation of big-data to uncover subtle, but important trends in mental and physical health.<\/p>","slug":"eric_haseltine","published_at":"2015-11-23 19:22:00","updated_at":"2018-05-29 12:07:02"}}