{"speaker":{"id":2793,"title":"","firstname":"James","middleinitial":"","lastname":"Green","description":" Space physicist","whotheyare":"James Green leads NASA's solar system exploration and astrobiology research.","whylisten":"<p>Dr. James Green began his career at NASA 35 years ago at the Marshall Space Flight Center, where he developed and managed the Space Physics Analysis Network. It provided scientists all over the world rapid access to data and resources. As NASA&#39;s Director of Planetary Science he leads NASA&#39;s solar system exploration and astrobiology research.<\/p><p>Green received his Ph.D. in Space Physics from the University of Iowa in 1979 and began working in the Magnetospheric Physics Branch at NASA&#39;s Marshall Space Flight Center (MSFC) in 1980. At Marshall, Green developed and managed the Space Physics Analysis Network that provided scientists all over the world with rapid access to data, to other scientists, and to specific NASA computer and information resources. In addition, Green was a Safety Diver in the Neutral Buoyancy tank making over 150 dives until left MSFC in 1985.<\/p><p>From 1985 to 1992 Green was the head of the National Space Science Data Center (NSSDC) at Goddard Space Flight Center (GSFC). The NSSDC is NASA&#39;s largest space science data archive. In 1992, he became the Chief of the Space Science Data Operations Office until 2005, when he became the Chief of the Science Proposal Support Office. While at GSFC, Green was a co-investigator and the Deputy Project Scientist on the Imager for Magnetopause-to-Aurora Global Exploration (IMAGE) mission. He has written over 100 scientific articles in refereed journals involving various aspects of the Earth&#39;s and Jupiter&#39;s magnetospheres and over 50 technical articles on various aspects of data systems and networks.<\/p><p>In August 2006, Green became the Director of the&nbsp;<a href=\"http:\/\/solarsystem.nasa.gov\/\" target=\"_blank\">Planetary Science Division<\/a>&nbsp;at NASA Headquarters. Over his career, Green has received numerous awards. In 1988, he received the Arthur S. Flemming award given for outstanding individual performance in the federal government and was awarded Japan&#39;s Kotani Prize in 1996 in recognition of his international science data management activities.<\/p>","slug":"james_green","published_at":"2015-11-23 19:23:00","updated_at":"2016-08-16 15:58:14"}}