{"speaker":{"id":2794,"title":"","firstname":"Paula","middleinitial":"","lastname":"Hammond","description":"Medical researcher and educator ","whotheyare":"Paula Hammond, head of MIT's Department of Chemical Engineering, is developing new technologies to kill cancer cells.","whylisten":"        <p class=\"p1\">Professor Paula T. Hammond is the Head of the Department of Chemical Engineering and David H. Koch Chair Professor in Engineering at the Massachusetts Institute of Technology (MIT). She is a member of MIT&#39;s Koch Institute for Integrative Cancer Research, the MIT Energy Initiative and a founding member of the MIT Institute for Soldier Nanotechnology. She has recently been named the new head of the Department of Chemical Engineering (ChemE). She is the first woman and the first person of color appointed to the post. She also served as the Executive Officer (Associate Chair) of the Chemical Engineering Department (2008-2011).<\/p><p class=\"p1\">Professor Hammond was elected into the 2013 Class of the American Academy of Arts and Sciences. She is also the recipient of the 2013 AIChE Charles M. A. Stine Award, which is bestowed annually to a leading researcher in recognition of outstanding contributions to the field of materials science and engineering, and the 2014 Alpha Chi Sigma Award for Chemical Engineering Research. She was also selected to receive the Department of Defense Ovarian Cancer Teal Innovator Award in 2013. She has been listed in the prestigious&nbsp;<a href=\"http:\/\/highlycited.com\/\" target=\"_blank\">Highly Cited Researchers<\/a>&nbsp;2014 list, published by Thomson Reuters in the Materials Science category. This list contains the world&#39;s most influential researchers across 21 scientific disciplines based on highly cited papers in the 2002-2012 period. She is also included in the report:&nbsp;<a href=\"http:\/\/sciencewatch.com\/sites\/sw\/files\/sw-article\/media\/worlds-most-influential-scientific-minds-2014.pdf\" target=\"_blank\">The World&#39;s Most Influential Scientific Minds 2014<\/a>.<\/p><p class=\"p1\">Professor Hammond serves as an Associate Editor of the American Chemical Society journal, ACS Nano. She has published over 250 scientific papers and holds over 20 patents based on her research at MIT. She was named a Fellow of the American Physical Society, the American Institute of Biological and Medical Engineers, and the American Chemical Society Polymer Division. In 2010, she was named the Scientist of the Year by the Harvard Foundation.<\/p><p class=\"p1\">Professor Hammond received her B.S. in Chemical Engineering from MIT in 1984, and her M.S. from Georgia Tech in 1988 and earned her Ph.D. in 1993 from MIT.<\/p>","slug":"paula_hammond","published_at":"2015-11-23 19:23:00","updated_at":"2016-04-13 15:02:57"}}