{"speaker":{"id":2798,"title":"","firstname":"Jessica","middleinitial":"","lastname":"Shortall","description":"Strategy consultant, social entrepreneur and author","whotheyare":"Jessica Shortall is a working mom of two and author of Work. Pump. Repeat: The New Mom's Survival Guide to Breastfeeding and Going Back to Work.","whylisten":"        <p class=\"p1\">What do breastfeeding and paid leave for working mothers, sustainable eye care, hunger, green investing, giving shoes and the business case for LGBT equality have in common?&nbsp;<\/p> <p class=\"p1\">For Jessica Shortall, they have all been opportunities to change the world: challenges that need sustainable solutions and require a deep understanding of market forces, audiences, and cultures. They all require an intense dive into data, and they all benefit from powerful storytelling.<\/p> <p class=\"p1\">Shortall has provided strategy consulting to dozens of businesses, social enterprises, non-profit organizations and campaigns in the US, UK and beyond. Her first book,&nbsp;<a href=\"http:\/\/geni.us\/workpumprepeat\" target=\"_blank\"><em>Work. Pump. Repeat: The New Mom&#39;s Guide to Surviving Breastfeeding and Going Back to Work<\/em><\/a>, was inspired by her own experiences of circumnavigating the globe with a breast pump. She interviewed hundreds of working mothers and dozens of HR professionals to create a practical, relatable, judgment-free guide for women who want to try to continue breastfeeding after they&#39;ve returned to work.<\/p> <p class=\"p1\">Shortall started her adult life as a Peace Corps Volunteer in Uzbekistan, and she haven&#39;t stopped searching for ways to change the world since, across non-profit and for-profit worlds. In the early 2000s, she co-founded and franchised a non-profit organization that is now active in more than 40 communities. In 2006, she received an MBA with honors from the University of Oxford, as a Skoll Scholar in Social Entrepreneurship. She went on to spend three years providing consulting services to social entrepreneurs. From 2009 to 2014, she was the first Director of Giving at TOMS Shoes, hired to build out the now-iconic One for One giving mission and strategy.&nbsp;<\/p> <p class=\"p1\">She currently lives in Dallas, TX with her husband Clay and her two children.<\/p>","slug":"jessica_shortall","published_at":"2015-11-24 17:10:00","updated_at":"2015-12-02 18:17:50"}}