{"speaker":{"id":2808,"title":"","firstname":"Judson","middleinitial":"","lastname":"Brewer","description":"Mindful addiction doctor","whotheyare":"Psychiatrist and addiction expert Judson Brewer researches mindfulness techniques that effectively help quell cravings of all kinds.","whylisten":"<p>Judson Brewer MD PhD (&quot;Dr. Jud&quot;) is a <em>New York Times<\/em> best-selling author and thought leader in the field of habit change and the &quot;science of self-mastery,&quot; having combined more than 25 years of experience with mindfulness training with his scientific research therein. He is the Director of Research and Innovation at the Mindfulness Center and associate professor in Behavioral and Social Sciences and Psychiatry at the Schools of Public Health &amp; Medicine at Brown University. He is also the executive medical director of behavioral health at Sharecare Inc. and a research affiliate at MIT.<\/p><p>A psychiatrist and internationally known expert in mindfulness training for addictions, Brewer has developed and tested novel mindfulness programs for habit change, including both in-person and app-based treatments for smoking (<a href=\"https:\/\/www.cravingtoquit.com\/\" target=\"_blank\">cravingtoquit.com<\/a>), emotional eating (<a href=\"https:\/\/www.goeatrightnow.com\/\" target=\"_blank\">goeatrightnow.com<\/a>), and anxiety (<a href=\"https:\/\/www.unwindinganxiety.com\/\" target=\"_blank\">unwindinganxiety.com<\/a>). He has also studied the underlying neural mechanisms of mindfulness using standard and real-time fMRI and EEG neurofeedback. He has trained US Olympic athletes and coaches as well as foreign government ministers, and his work has been featured on <em>60 Minutes<\/em>, the <em>New York Times<\/em>, <em>TIME<\/em> magazine, <em>Forbes<\/em>,&nbsp;<em>Businessweek,&nbsp;<\/em>BBC, NPR, Al Jazeera&nbsp;and others. His work has been funded by the National Institutes of Health and American Heart Association, among others.<\/p><p>Brewer founded MindSciences (which merged with&nbsp;<a href=\"https:\/\/www.sharecare.com\/\" target=\"_blank\">Sharcecare<\/a>&nbsp;Inc. in 2020) to move his discoveries of clinical evidence behind mindfulness for anxiety, eating, smoking and other behavior change into the hands of consumers. He is the author of&nbsp;<a href=\"http:\/\/geni.us\/zwnse\" target=\"_blank\"><em>The Craving Mind: From Cigarettes to Smartphones to Love &ndash; Why We Get Hooked and How We Can Break Bad Habits<\/em><\/a>&nbsp;(New Haven: Yale University Press, 2017) and the <em>New York Times<\/em> best-seller,&nbsp;<a href=\"https:\/\/geni.us\/QDJVgzB\" target=\"_blank\"><em>Unwinding Anxiety: New Science Shows How to Break the Cycles of Worry and Fear to Heal Your Mind<\/em><\/a>&nbsp;(Avery\/Penguin Random House, 2021).<\/p>","slug":"judson_brewer","published_at":"2015-11-24 19:57:00","updated_at":"2021-10-12 13:10:05"}}