{"speaker":{"id":283,"title":"","firstname":"Ann","middleinitial":"","lastname":"Cooper","description":"Lunch lady","whotheyare":"Ann Cooper cares -- a lot -- what kids eat for lunch. As the head of nutrition for Berkeley, California, schools, she serves organic, regionally sourced and sustainable meals to lots of lucky children.","whylisten":"<p>Ann Cooper has a frontline view of the daily battle to keep kids healthy -- and of the enemy, the processed-foods industries that, it sometimes seems, want to wrap every single thing that children eat in a fried coating and then a plastic bag. As the director of nutrition services for the Berkeley (California) Unified School District, <strong>she&#39;s an outspoken activist for serving fresh, sustainable food to kids<\/strong>. Her lively website, <a href=\"http:\/\/www.chefann.com\/\">ChefAnn.com<\/a>, rounds up recipes, links, and resources for food activism. <\/p><p>Cooper&#39;s influential program in Berkeley <strong>involves kids in every stage of the food they eat<\/strong>, from growing to disposing of it. And along the way, eating some delicious cafeteria lunches. She&#39;s also recently become one of the most enterprising members of Jamie Oliver&#39;s Food Revolution, launching <a href=\"http:\/\/www.thelunchbox.org\/\">TheLunchBox.org<\/a> to give schools the resources and support they need to transform their menus and provide balanced, healthy meals. In line with that effort, she is partnering with Whole Foods on the <a href=\"http:\/\/www.saladbarproject.org\/\">Great American Salad Project (GASP)<\/a>, which will create fresh salad bars in over 300 schools around the U.S.&nbsp; <\/p><p>She&#39;s the author of <a href=\"http:\/\/www.lunchlessons.org\/html_v2\/books.html\" target=\"_blank\">several books<\/a>, including <a href=\"http:\/\/geni.us\/bitterharvest\" target=\"_blank\"><em>Bitter Harvest<\/em><\/a>, an examination of the food chain, and her latest, <a href=\"http:\/\/www.lunchlessons.org\/html_v2\/books\/lunch_lessons.html\" target=\"_blank\"><em>Lunch Lessons: Changing the Way We Feed Our Children<\/em><\/a>.<\/p>","slug":"ann_cooper","published_at":"2008-09-16 01:00:00","updated_at":"2015-09-26 01:12:58"}}