{"speaker":{"id":284,"title":"","firstname":"David S.","middleinitial":"","lastname":"Rose","description":"Angel Investor","whotheyare":"\"The Pitch Coach\" David S. Rose is an expert on the business pitch. As an entrepreneur, he has raised millions for his own companies. As an investor, he has funded millions more.","whylisten":"<p>David S. Rose is a split-screen legend to the world&#39;s entrepreneurs. He&#39;s been both a mentor to hundreds of startup hopefuls and, sometimes&mdash;to the talented and fortunate&mdash;a funder. His rapid-fire seminars on pitching to venture capitalists are celebrated and sought-after. He&#39;s helped invest many millions of dollars in startups through <a href=\"http:\/\/www.newyorkangels.com\/\" target=\"_blank\">New York Angels<\/a>, meanwhile raising tens of millions for his own companies. His <em>New York Times<\/em> bestselling book <a href=\"http:\/\/angelinvesting.com\" target=\"_blank\"><em>Angel Investing<\/em><\/a>  has become the definitive how-to guide for anyone considering making or receiving angel investments. And as Associate Founder -- and Founding Track Chair for Finance, Entrepreneurship &amp; Economics -- of <a href=\"http:\/\/singularityu.org\" target=\"_blank\">Singularity University<\/a><a target=\"_blank\"><\/a>, he is one of the world&#39;s leading theorists on the future of business in a world of exponential technology growth.<br \/><br \/>Fusing these interests under <a href=\"http:\/\/www.rose.vc\/\" target=\"_blank\">Rose Tech Ventures<\/a>, Rose&#39;s mission is to give future movers-and-shakers support and encouragement. <a href=\"http:\/\/gust.com\" target=\"_blank\">Gust<\/a>, the international financing platform that he founded, connects hundreds of thousands of entrepreneurs to tens of thousands of angel investors in over 100 countries, and powers many of the world&#39;s major startup ecosystems. Gust was named the world&#39;s most innovative financial technology company by SWIFT, and has won the CODiE Award for Best Collaboration Solution for three years in a row. Rose&#39;s new <a href=\"http:\/\/rose.vc\/incubator\" target=\"_blank\">technology incubator<\/a>  is a &quot;greenhouse to nurture the seedlings of future entrepreneurial superstars.&quot;<\/p>","slug":"david_s_rose","published_at":"2008-09-19 01:00:00","updated_at":"2020-10-28 18:59:42"}}