{"speaker":{"id":2843,"title":"","firstname":"Laura","middleinitial":"","lastname":"Robinson","description":"Ocean scientist","whotheyare":"Dr. Laura Robinson's scientific mission is to document and understand the processes that govern climate.","whylisten":"        <p class=\"p1\">Dr. Laura Robinson&#39;s research the processes that govern climate on time scales ranging from the modern day back through hundreds of thousands of years. To do this research, Robinson uses geochemical techniques, with an emphasis on radioactive elements including uranium series isotopes and radiocarbon. These elements are particularly valuable as they have a wide range of decay rates and geochemical properties and can be analyzed in geologic materials such as corals, marine sediments and seawater.<\/p> <p class=\"p2\">Through a combination of field work and lab work, Robinson has been tackling questions relating to: timing of Pleistocene climate change events; palaeoclimate reconstructions; deep-sea coral paleo-biogeography; impact of weathering on the ocean and climate; biomineralization; development of new geochemical proxies for past climate conditions; chemical tracers of ocean circulation.<\/p> <p class=\"p2\">Robinson describes the inspiration behind her work:<\/p> <p class=\"p2\">&ldquo;When I finished my PhD, I moved to California to work with Professor Jess Adkins at Caltech on a project using deep-sea corals. Before that time, like many people, I did not know that corals lived in the deep ocean. The first thing I did was prepare for a research cruise to the North Atlantic. We took the research submarine &#39;Alvin&#39; out to undersea mountains and were able to collect fossil corals from the seafloor. The start of my work in the Southern Ocean came from analysis of a single coral specimen from the Smithsonian Natural History Museum in Washington DC. They loaned us the sample, and we found that it was about 16,000 years old, just right for looking at the middle of the last global deglaciation. Being able to access and work on these specimens is a fantastic way of starting a science project. We published a paper on that sample, and then, together with a coral biologist, I wrote a proposal to fund specific expeditions to the Southern Ocean, and to the Equatorial Atlantic to gain a wider view of how the Atlantic Ocean behaved during major climate transitions.<\/p> <p class=\"p2\">I love the research as it combines field work, lab work and collaborations with all kinds of people including scientists, engineers as well as the ships&#39; crews. In terms of scientists, I work with biologists, oceanographers, chemists, geologists, habitat specialists and a whole range of people who have technical expertise across these fields.&rdquo;<\/p><p class=\"p2\"><a href=\"https:\/\/www.bas.ac.uk\/project\/so-anteco\/\" target=\"_blank\">Learn more<\/a> about Robinson&#39;s current expidition in the Southern Ocean.&nbsp;<\/p>","slug":"laura_robinson","published_at":"2015-12-02 23:34:00","updated_at":"2016-03-09 15:59:18"}}