{"speaker":{"id":2858,"title":"","firstname":"Stephen","middleinitial":"","lastname":"Wilkes","description":"Photographer","whotheyare":"By blending up to 100 still photographs into a seamless composite that captures the transition from day to night, Stephen Wilkes reveals the stories hidden in familiar locations.","whylisten":"        <p class=\"p1\">Since opening his studio in New York City in 1983, Stephen Wilkes has built an unprecedented body of work and a reputation as one of America&#39;s most iconic photographers, widely recognized for his fine art and editorial and commercial work.&nbsp;<\/p><p class=\"p1\">In 1998, a one-day assignment to the south side of Ellis Island led to a five-year photographic study of the island&#39;s long-abandoned medical wards where immigrants were detained before they could enter America. Through his photographs and video, Wilkes helped secure six million dollars toward the restoration of the south side of the island. A monograph based on the work, <em>Ellis Island: Ghosts of Freedom<\/em>, was published in 2006 and was named one of <em>TIME<\/em> magazine&#39;s &quot;5 Best Photography Books of the Year.&quot;<\/p><p class=\"p1\"><em>Day to Night<\/em>, Wilkes&#39; most defining project, began in 2009. These epic cityscapes and landscapes portrayed from a fixed camera angle for up to 30 hours capture fleeting moments of humanity as light passes in front of his lens over the course of a full day. Wilkes is a National Geographic Explorer, having received multiple grants to document America&#39;s National Parks for the centennial anniversary, Bird Migration for the 2018 Year of the Bird. Most recently, a new grant was extended to focus his work on endangered species and habitats. The series will focus on iconic Canadian species and habitats at risk, in collaboration with National Geographic Society and The Royal Canadian Geographic Society.&nbsp;<\/p><p class=\"p1\"><em>Day to Night: In the Field with Stephen Wilkes<\/em> was exhibited at The National Geographic Museum in 2018 and was published by TASCHEN as a monograph in 2019.&nbsp;<\/p><p class=\"p1\">Wilkes&#39; directorial debut, the documentary film&nbsp;<em>Jay Myself<\/em>, world-premiered at DOCNYC in November 2018. The critically acclaimed film is an in-depth look into the world of photographer Jay Maisel and his move out of his 35,000 sq. foot building at 190 Bowery. The film opened at Film Forum in New York in July 2019.<\/p><p class=\"p1\">Wilkes graduated from Syracuse University with a dual degree from S.I. Newhouse School of Public Communications and Whitman School of Management in 1980. His photographs are included in the collections of the George Eastman Museum, James A. Michener Art Museum, Houston Museum of Fine Arts, Dow Jones Collection, Carl and Marilynn Thoma Art Foundation, Jewish Museum of NY, Library of Congress, Snite Museum of Art, The Historic New Orleans Collection, Museum of the City of New York, 9\/11 Memorial Museum and numerous private collections. Wilkes is represented by Bryce Wolkowitz Gallery in New York, Monroe Gallery in Santa Fe NM and Holden Luntz Gallery in Palm Beach, FL.<\/p>","slug":"stephen_wilkes","published_at":"2016-01-08 22:00:00","updated_at":"2020-10-07 22:00:56"}}