{"speaker":{"id":2869,"title":"","firstname":"Kio","middleinitial":"","lastname":"Stark","description":"Stranger enthusiast","whotheyare":"Kio Stark explores the myriad ways encounters with strangers impact our lives.","whylisten":"<p>Kio Stark has always talked to strangers. She started documenting her experiences when she realized that not everyone shares this predilection. She&#39;s done extensive research into the emotional and political dimensions of stranger interactions and the complex dynamics how people relate to each other in public places.<\/p><p>Her novel&nbsp;<a href=\"https:\/\/www.amazon.com\/Follow-Me-Down-Kio-Stark\/dp\/193586906X\" target=\"_blank\"><em>Follow Me Down<\/em><\/a>&nbsp;began as a series of true vignettes about strangers placed in the fictional context of a woman unraveling the eerie history of a lost letter misdelivered to her door.<\/p><p>Stark did doctoral work at Yale University&rsquo;s American Studies program, where she thought a lot about the history of science and medicine, urban studies, art, and race -- and then dropped out. Because she also taught graduate courses at NYU&#39;s Interactive Telecommunications Program, numberless people consulted her about whether or not to go back to school. Those conversations inspired&nbsp;<a href=\"https:\/\/www.amazon.com\/Dont-Go-Back-School-Handbook\/dp\/0988949008\" target=\"_blank\"><em>Don&#39;t Go Back to School<\/em><\/a>, a handbook for independent learners.<\/p><p>Stark is the author of the TED Book&nbsp;<a href=\"http:\/\/geni.us\/whenstrangersmeet\" target=\"_blank\"><em>When Strangers Meet<\/em><\/a>, in which she argues for the pleasures and transformative possibilities of talking to people you don&rsquo;t know.&nbsp;<\/p><p>Beyond strangers, Stark&#39;s abiding fixations include the invisibility of technology; how people learn; practices of generosity and mutual aid; the culture, infrastructure and ephemera of cities; mythology and fairy tales; and advocating for independent learning, data literacy, social justice and feminism. Fiction writers get to dive down wonderful rabbit holes, and some of her favorites have been the forging and stealing of art, secret societies, the daily lives of medical examiners, the physics of elementary particles, bridge design, the history of maps, the mechanisms of wrongful conviction and psychoanalysis.<\/p><p>When not writing books, Stark has worked in journalism, interactive advertising, community research and game design. She writes, teaches and speaks around the world about stranger interactions, independent learning and how people relate to technology. She also consults for startups and large companies helping them think about stranger interactions among their users and audiences.<\/p>","slug":"kio_stark","published_at":"2016-01-08 23:00:00","updated_at":"2016-08-31 14:58:49"}}