{"speaker":{"id":289,"title":"","firstname":"Rodney","middleinitial":"","lastname":"Brooks","description":"Roboticist","whotheyare":"Rodney Brooks builds robots based on biological principles of movement and reasoning. The goal: a robot who can figure things out.","whylisten":"<p>Former MIT professor Rodney Brooks studies and engineers robot intelligence, looking for the holy grail of robotics: the AGI, or artificial general intelligence. For decades, we&#39;ve been building robots to do highly specific tasks -- welding, riveting, delivering interoffice mail -- but what we all want, really, is a robot that can figure things out on its own, the way we humans do.<\/p><p>Brooks realized that a top-down approach -- just building the biggest brain possible and teaching it everything we could think of -- would never work. What <em>would<\/em> work is a robot who learns like we do, by trial and error, and with many separate parts that learn separate jobs. The thesis of his work which was captured in&nbsp;<em><a href=\"http:\/\/www.sonypictures.com\/classics\/fastcheap\/\" target=\"_blank\">Fast, Cheap and Out of Control<\/a>,<\/em>went on to become the title of the great Errol Morris documentary.<\/p><p>A founder of <a href=\"http:\/\/www.irobot.com\/\" target=\"_blank\">iRobot<\/a>, makers of the Roomba vacuum, Brooks is now founder and CTO of&nbsp;<a href=\"http:\/\/rethinkrobotics.com\" target=\"_blank\"><span>Rethink Robotics<\/span><\/a>, whose mission is to apply advanced robotic intelligence to manufacturing and physical labor. Its first robots: the versatile two-armed&nbsp;<a href=\"http:\/\/www.youtube.com\/watch?v=gXOkWuSCkRI\" target=\"_blank\">Baxter<\/a>&nbsp;and one-armed Sawyer. Brooks is the former director of&nbsp;<a href=\"http:\/\/www.csail.mit.edu\/\" target=\"_blank\">CSAIL<\/a>, MIT&#39;s Computers Science and Artificial Intelligence Laboratory. <\/p>&nbsp;","slug":"rodney_brooks","published_at":"2008-09-29 06:27:00","updated_at":"2016-08-08 19:51:54"}}