{"speaker":{"id":2901,"title":"","firstname":"Sue","middleinitial":"","lastname":"Desmond-Hellmann","description":"CEO, Gates Foundation","whotheyare":"Sue Desmond-Hellmann leads the Bill & Melinda Gates Foundation’s mission to establish equity for every person.","whylisten":"        <p class=\"p1\"><span class=\"s1\">As CEO of the Bill &amp; Melinda Gates Foundation, Sue Desmond-Hellmann leads the organization&#39;s vision for a world where every person has the opportunity to live a healthy, productive life. Drawing on her diverse experience as scientist, physician and business executive, she oversees a variety of missions focused on eradicating disease, poverty and inequity. She leads 1,400 people, across four continents, working in more than 100 countries to help more children and young people survive and thrive, combat infectious diseases that hit the poorest hardest, and empower people -- particularly women and girls -- to transform their lives.<\/span><\/p><p class=\"p1\">Trained as an oncologist, Dr. Desmond-Hellmann spent 14 years at biotech firm Genentech, developing a number of breakthrough medicines, including two of the first gene-targeted therapies for cancer, Avastin and Herceptin. In November 2009, <em>Forbes<\/em> magazine named her one of the world&#39;s seven most &quot;powerful innovators,&quot; calling her &quot;a hero to legions of cancer patients.&quot; Her time at Genentech put her at the forefront of the precision medicine revolution, and in her current role she champions a similar approach to global development: precision public health -- getting the right interventions, to the right populations, in the right places, to save lives.<\/p><p class=\"p1\">Immediately prior to joining the foundation in 2014, Dr. Desmond-Hellmann was the first female chancellor of the University of California at San Francisco (UCSF), overseeing all aspects of the university and medical center&#39;s strategy and operations. It was her second stint at UCSF, having completed her clinical training there in the 1980s. She moved to Uganda in 1989 to work on HIV\/AIDS and cancer, which she credits as a turning point in her career. &quot;It was so profound to recognize ... that all the learning I had done to become a doctor didn&#39;t matter at all if I didn&rsquo;t make a contribution,&quot; she said.<\/p><p class=\"p1\">Dr. Desmond-Hellmann is the recipient of numerous honors and awards. She was listed among <em>Fortune<\/em> magazine&#39;s &quot;50 most powerful women in business&quot; for seven years. In 2010, she was inducted into the American Academy of Arts and Sciences and elected to the Institute of Medicine. She serves on the boards of directors at Facebook Inc. and the Procter &amp; Gamble Company.<\/p>","slug":"sue_desmond_hellman","published_at":"2016-01-10 20:15:00","updated_at":"2016-05-31 15:18:31"}}