{"speaker":{"id":2905,"title":"","firstname":"Victoria","middleinitial":"","lastname":"Pratt","description":"Professor","whotheyare":"Judge Victoria Pratt is inspiring a global revolution in criminal justice.","whylisten":"<p>Judge Victoria Pratt has gained national and international acclaim for her commitment to reforming the criminal justice system. As the Chief Judge in Newark Municipal Court in Newark, New Jersey, a busy urban court, she spent years gaining a deep understanding of how justice could be delivered to court participants in a manner that increased their trust in the legal system. While presiding over Newark Community Solutions, the Community Court Program, she provided alternatives to jail to low-level offenders. These alternatives included community service, individual and group counseling sessions, and her signature assignment of introspective essays. Her respectful approach has had a positive effect on court participant&rsquo;s court experience -- and how the community viewed the court.<\/p><p>Pratt is now serving as a Professor at Rutgers Law School in Newark, an institution that has always been committed to social justice. Her teaching load includes problem-solving&nbsp;courts and restorative justice. As a graduate of Rutgers Law, she is excited by the opportunity to influence the minds of future lawyers and judges with innovative and humane ways of dealing with court participants.&nbsp; She also continues to champion criminal justice reform through her consulting firm Pratt Lucien Consultants, LLC, by sharing her skills and approach with others.&nbsp; &nbsp;<\/p><p>Pratt&rsquo;s work has been featured in&nbsp;<a href=\"https:\/\/www.theguardian.com\/us-news\/2015\/jun\/23\/procedural-justice-transform-us-criminal-courts\" target=\"_blank\"><em>The Guardian<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/magazine.rutgers.edu\/features\/asking-for-a-little-respect\" target=\"_blank\"><em>Rutgers<\/em> Magazine<\/a>&nbsp;(both written by Pulitzer-winning author Tina Rosenberg.) As a nationally recognized expert in procedural justice and alternative sentencing, she has been asked by numerous professional organizations and jurisdictions to share her story and philosophy. Judge Pratt has also appeared on MSNBC&#39;s &quot;Melissa Harris Perry Show,&quot; the Emmy-winning PBS show &quot;<a href=\"http:\/\/www.pbs.org\/video\/due-process-community-court-kinder-gentler-way\/\" target=\"_blank\">Due Process<\/a>,&quot; and National Public Radio&#39;s &quot;Conversations with Allan Wolper.&quot;<\/p><p>Pratt is licensed to practice law in both New Jersey and New York and is admitted to the US Supreme Court. She also facilitates empowerment sessions to help people live their best lives.<\/p><p>(Photo:&nbsp;Erik James Montgomery)&nbsp;<\/p>","slug":"victoria_pratt","published_at":"2016-01-10 20:30:00","updated_at":"2017-11-10 15:26:50"}}