{"speaker":{"id":2919,"title":"","firstname":"Christiana","middleinitial":"","lastname":"Figueres","description":"Stubborn optimist","whotheyare":"Christiana Figueres is an internationally recognized leader on climate action and steered the global diplomatic effort that culminated in the 2015 Paris Agreement.","whylisten":"<p>Christiana Figueres&nbsp;was the executive secretary of the United Nations Framework Convention on Climate Change (UNFCCC) from 2010 to 2016. Assuming responsibility for the international climate change negotiations after the failed Copenhagen conference of 2009, she was determined to lead the process to a universally agreed regulatory framework. Building toward that goal, she directed the successful Conferences of the Parties in Cancun 2010, Durban 2011, Doha 2012, Warsaw 2013 and Lima 2014, and culminated her efforts in the historical Paris Agreement of 2015.<\/p><p>During her tenure, Figueres brought together national and subnational governments, corporations and activists, scientists and spiritual communities, financial institutions and NGOs to jointly deliver the historic 2015 Paris Agreement on Climate Change. Under this agreement, 195 sovereign governments agreed on a collaborative path to limit future global warming to well below two degree Celsius, and strive for one-and-a-half degrees Celsius in order to protect the most vulnerable in every nation. For this achievement, Figueres&nbsp;has been credited with forging a new brand of collaborative diplomacy, for which she has received multiple awards. In 2016, Figueres shared&nbsp;<a href=\"https:\/\/www.ted.com\/talks\/christiana_figueres_the_inside_story_of_the_paris_climate_agreement\" target=\"_blank\">the story behind the landmark climate accord<\/a>&nbsp;on the TED stage.<\/p><p>Since then, Figueres has continued to serve her one and only boss: the global atmosphere that protects our planet and is the ultimate basis of human well-being.&nbsp;<\/p><p>Figueres has a long trajectory in the field of global climate change. She was a member of the Costa Rican negotiating team from 1995 to 2009 and played a number of key roles in the governance of the UNFCCC before formally joining the secretariat. She began her life of public service as Minister Counselor at the Embassy of Costa Rica in Bonn, Germany in 1982. Moving to the US, she became Director of Renewable Energy in the Americas (REIA) and in 1995 founded the nonprofit Center for Sustainable Development of the Americas (CSDA), which she directed for eight years. She designed and helped to establish national climate change programs throughout Latin America and served as high level advisor to both governments and private companies. In 2001, she received the Hero for the Planet Award from <em>National Geographic.<\/em><\/p><p>Figueres is a graduate of Swarthmore College and the London School of Economics. After decades of living and working abroad, she has recently moved back to her beloved Costa Rica. She has two fantastic daughters for whom she is deeply grateful.<\/p>","slug":"christiana_figueres","published_at":"2016-01-13 13:31:00","updated_at":"2021-08-18 19:02:33"}}