{"speaker":{"id":2921,"title":"","firstname":"Tania","middleinitial":"","lastname":"Simoncelli","description":"Policy expert","whotheyare":"Tania Simoncelli advises the White House on science and technology policy.","whylisten":"        <p class=\"p1\">Tania Simoncelli is Assistant Director for Forensic Science in the White House Office of Science and Technology Policy (OSTP). She came to OSTP from the U.S. Food and Drug Administration (FDA), where she served as Senior Advisor in the Office of Medical Products and Tobacco, providing guidance and leadership on complex initiatives that required coordination across the centers for drugs, biologics, medical devices and tobacco products. Prior to this role, she served for two years as Special Assistant to FDA Commissioner Margaret Hamburg, where she advised the Commissioner and her staff on a wide range of issues, including nutrition labeling, food safety, genetically modified foods, scientific integrity, drug safety communication, direct-to-consumer genetic testing and personalized medicine.<\/p><p class=\"p1\">From 2003-2010, Simoncelli worked as the Science Advisor to the American Civil Liberties Union, where she guided the organization&rsquo;s responses to cutting-edge developments in science and technology that pose challenges for civil liberties. In this capacity, she spearheaded the development of ACLU&rsquo;s successful Supreme Court challenge to the patenting of human genes and advised ACLU leadership and staff on a number of other science policy issues. In 2013, Simoncelli was named by the journal <em>Nature<\/em> as one of &ldquo;ten people who mattered this year&rdquo; for her work with the ACLU in overturning gene patents.<\/p><p class=\"p1\">Simoncelli is co-author with Sheldon Krimsky of&nbsp;<a href=\"http:\/\/geni.us\/GeneticJustice\" target=\"_blank\"><em>Genetic Justice: DNA Data Banks, Criminal Investigations, and Civil Liberties<\/em><\/a>&nbsp;(Columbia University Press: 2010). She has published articles in a range of scientific, legal and policy journals, including the <em>Journal of the American Medical Association<\/em> (JAMA), <em>The Journal of Law, Medicine &amp; Ethics<\/em> (JLME) and Genewatch Magazine.<\/p><p class=\"p1\">Simoncelli holds a BA in Biology &amp; Society from Cornell University and an MS in Energy and Resources from the University of California, Berkeley. She has worked as a researcher, analyst, and consultant for a range of nonprofit environmental and social justice organizations, including the Environmental Defense Fund and the Center for Genetics and Society, and served for five years as a board member of the Council for Responsible Genetics.<\/p>","slug":"tania_simoncelli","published_at":"2016-01-19 18:36:00","updated_at":"2016-01-27 15:31:59"}}