{"speaker":{"id":2929,"title":"","firstname":"Ivan","middleinitial":"","lastname":"Coyote","description":"Writer, performer","whotheyare":"Ivan Coyote believes that a good story can help inspire us to invent a better future.","whylisten":"        <p class=\"p1\"><span class=\"s1\">Ivan Coyote was born and raised in Whitehorse, Yukon Territory. An award-winning author of eight collections of short stories, one novel, three CD&rsquo;s, four short films and a renowned performer, Ivan&rsquo;s first love is live storytelling. Over the last nineteen years, they have become an audience favorite at music, poetry, spoken word and writer&rsquo;s festivals from Anchorage to Amsterdam.<\/span><\/p> <p class=\"p1\"><span class=\"s1\">Ivan began performing in 1992, and in 1996 co-founded Taste This, a four person performance troupe that combined live music, storytelling and performance poetry to create a text-driven genre-busting collaborative exchange. Taste This toured North America extensively and in 1998 the four artists published Boys Like Her, a critically acclaimed book that took the stage show to the printed page. Boys Like Her sold out three editions and continues to be considered a notable Canadian contribution to the dialogue around gender identity and sexuality.<\/span><\/p> <p class=\"p1\"><span class=\"s1\">Ivan teamed up with Arsenal Pulp Press in 2000, and has since released nine more books. Close to Spiderman (2000), One Man&rsquo;s Trash (2002), Loose End (2005), Bow Grip (2006), The Slow Fix (2008), Missed Her (2010), Persistence: All Ways Butch and Femme (2011), One In Every Crowd (2012) and Gender Failure (2014).&nbsp;<\/span><\/p> <p class=\"p1\"><span class=\"s1\">Ivan is still fascinated by the intersection of storytelling and music, and works with a number of well-established Canadian musicians, including pianist and composer Veda Hille, songwriter Dan Mangan, folk artist Rae Spoon, cellist Cris Derksen, and violinist Lyndell Montgomery. Ivan has released three CDs of storytelling with music, You&rsquo;re A Nation (2003) and You Are Here (2007) and Only Two Reasons (2010).<\/span><\/p> <p class=\"p1\"><span class=\"s1\">In 2001 Ivan landed a little gig teaching short fiction at Capilano University in North Vancouver. This little night school class led to an accidental discovery: Ivan loves to teach creative writing. Coyote continued to teach short fiction and classes and workshops, and in 2007 was invited to become Carleton University&rsquo;s writer-in-residence. While in Ottawa, Coyote taught a third year fiction class, and three memoir-writing classes for senior citizens. It was while teaching seniors that Ivan realized their true calling. Ivan strongly believes in listening to the stories of our elders, and encouraging them to write down their lives.&nbsp;<\/span><\/p> <p class=\"p1\"><span class=\"s1\">Coyote has since been honoured to be the writer-in-residence at the Vancouver Public Library (2009), The Carol Shield&rsquo;s writer-in-residence at the University of Winnipeg (2011) and the writer-in-residence at The University of Western Ontario in London, Ontario (2012).&nbsp;<\/span><\/p> <p class=\"p1\"><span class=\"s1\">In addition to these literary and teaching accomplishments, Ivan continues to tour extensively throughout North America and Europe, telling stories not only to festival audiences but to high school students, social justice activists, adult literacy students and senior citizens all across the continent. Ivan believes in the transformative power of storytelling, and that collecting and remembering oral history not only preserves a vital part of our families and where we come from, but that a good story can help inspire us to invent a better future.<\/span><\/p>","slug":"ivan_coyote","published_at":"2016-02-08 16:13:00","updated_at":"2016-02-26 15:21:39"}}