{"speaker":{"id":2932,"title":"","firstname":"Andrew","middleinitial":"","lastname":"Pelling","description":"Biomedical researcher","whotheyare":"TED Senior Fellow Andrew Pelling uses novel materials for next-generation medical innovations and speculative living technologies of the future.","whylisten":"        <p class=\"p1\">Andrew Pelling is a lifelong scientist, full professor at the University of Ottawa and founder of multiple start-up companies. His highly experimental Pelling Lab for Augmented Biology has trailblazed by developing speculative living technologies of the future with the potential to redefine the limits of biology and medicine. The Lab is well known for its discovery that plants can be harnessed to create medical-grade biomaterials for engineering and regenerating human tissues. Pelling&#39;s work in this area gained considerable international recognition after delivering his first TED Talk on growing human ears out of apples. To date, the Pelling Lab has spun out four companies in the technology, biotechnology and medical fields, translating their discoveries into real-world products and solutions.<\/p><p class=\"p1\">Pelling also serves as cofounder and chief scientific officer of&nbsp;<a href=\"https:\/\/spiderwortbio.com\/\" target=\"_blank\">Spiderwort<\/a>, a company translating the fundamental discoveries from his Lab in the area of plant-based biomaterials. As CSO, he leads Spiderwort&#39;s research program, which addresses a variety of tissue engineering applications and unmet medical needs. He also plays a key role in guiding the translation of Spiderwort&#39;a products through the clinical and regulatory landscapes.<\/p><p class=\"p1\">As an award-winning scientist, Pelling has published his research in some of the world&#39;s most prestigious journals and has been well recognized by his peers. He is the recipient of numerous grants and awards, including being elected a Fellow of the Royal Society of Biology, Member of the College of the Royal Society of Canada and a Canada Research Chair. He has delivered hundreds of keynotes and served in a variety of advisory roles for community, industry and government organizations.<\/p>","slug":"andrew_pelling","published_at":"2016-02-15 18:00:00","updated_at":"2021-04-20 19:23:41"}}