{"speaker":{"id":2937,"title":"","firstname":"Sanford","middleinitial":"","lastname":"Biggers","description":"Conceptual artist","whotheyare":"Sanford Biggers creates art that upends traditional narratives about topics ranging from hip hop to Buddhism to American history.","whylisten":"<p>An LA native working in NYC, Sanford Biggers creates artworks that integrate film, video, installation, sculpture, drawing, original music and performance. He intentionally complicates issues such as hip hop, Buddhism, politics, identity and art history in order to offer new perspectives and associations for established symbols. Through a multi-disciplinary formal process and a syncretic creative approach, he makes works that are as aesthetically pleasing as they are conceptual.<\/p><p>The significance of Biggers&#39; work within contemporary society has been celebrated through solo exhibitions both nationally and internationally, most recently at the Brooklyn Museum, Sculpture Center and Mass MoCA. He has participated in prestigious residencies and fellowships including: Akademie Schloss Solitude, Stuttgart, Germany; Ujazdowski Castle, Warsaw, Poland; Headlands Center for the Arts, Sausalito, California; ARCUS Project Foundation, Ibaraki, Japan; and the Art in General\/ Trafo Gallery Eastern European Exchange in Budapest, Hungary. He has been a fellow of the Creative Time Global Residency, the Socrates Sculpture Park Residency, the Lower Manhattan Cultural Council World Views AIR Program, the Eyebeam Atelier Teaching Residency, the Studio Museum AIR Program, the P.S. 1 International Studio Program and the Skowhegan School of Painting and Sculpture residency.<\/p><p>Biggers&#39; installations, videos and performances have appeared in venues worldwide including Tate Britain and Tate Modern in London, the Whitney Museum and Studio Museum in Harlem, New York and the Yerba Bue a Center for the Arts in San Francisco, as well as institutions in China, Germany, Hungary, Japan, Poland and Russia. The artist&#39;s works have been included in notable exhibitions such as: Prospect 1 New Orleans Biennial, Illuminations at the Tate Modern, Performa 07 in NY, the Whitney Biennial and Freestyle at the Studio Museum in Harlem. His works are included in the collections of the Museum of Modern Art, Walker Art Center, Whitney Museum, Brooklyn Museum and Bronx Museum.<\/p><p>Biggers has won awards including: the American Academy in Berlin Prize, Greenfield Prize, New York City Art Teachers Association Artist-of-the-Year, Creative Time Travel Grant, Creative Capital Project Grant, New York Percent for the Arts Commission, Art Matters Grant, New York Foundation for the Arts Award, the Lambent Fellowship in the Arts, the Pennies From Heaven\/ New York Community Trust Award, Tanne Foundation Award and Rema Hort Mann Foundation Award Grant.<\/p><p>Biggers is Assistant Professor at Columbia University&#39;s Visual Arts program and a board member of Sculpture Center, Soho House and the CUE Foundation. He has also taught at Virginia Commonwealth University&rsquo;s Sculpture and Expanded Media program and was a visiting scholar at Harvard University&#39;s VES Department in 2009.<\/p>","slug":"sanford_biggers","published_at":"2016-02-15 18:06:00","updated_at":"2016-05-11 14:33:50"}}