{"speaker":{"id":2948,"title":"","firstname":"Laura","middleinitial":"","lastname":"Indolfi","description":"Biomedical entrepreneur","whotheyare":"Laura Indolfi is revolutionizing cancer treatment with new technologies including implantable devices for delivering drugs locally to the site of a tumor.","whylisten":"        <p class=\"p1\">Laura Indolfi is a biomedical entrepreneur, CEO and co-founder of PanTher Therapeutics, an early stage spin-out from MIT and MGH that provides superior technologies for revolutionizing the treatment of locally advanced inoperable solid tumors. Prior to this she served as an entrepreneur-in-residence at the MGH Cancer Center and as a research associate in the Harvard-MIT Institute for Medical Engineering&nbsp;and Science. She was selected as a TED Fellow in 2016.<\/p><p class=\"p1\">Indolfi has broad professional experiences and interests ranging from biomedical engineering to entrepreneurship and outreaching initiative to promoting science. Her scientific expertise covers a broad range of therapeutic areas (cardio, cancer, inflammation, regenerative medicine) and approaches (drug delivery, cell therapy, implanted devices). Together with her strong technical background, Laura has hands-on business and managerial know-how developed during her biomedical business training at Sloan and Harvard Business Schools and with several consulting firms. She strongly believes in the power of outreach initiatives to promote research awareness and foster the public audience&#39;s discovery of the beauty of science. In 2014 the line of clothes Cytocouture, created in collaboration with Colombian designer Carlos Villamil and inspired by her cell-therapy research, won the global competition Descience.<\/p><p class=\"p1\">Indolfi holds a MS\/BS degree in materials science and engineering and a PhD in biomaterials from the University of Naples Federico II in Italy. Upon graduation, she joined the Harvard-MIT Division of health, science and technology, working on several projects spanning from devices for local drug delivery to tissue engineering approaches for cell therapies.<\/p>","slug":"laura_indolfi","published_at":"2016-02-15 18:14:00","updated_at":"2016-05-17 17:48:38"}}