{"speaker":{"id":2954,"title":"","firstname":"Jherek","middleinitial":"","lastname":"Bischoff","description":"Composer, musician","whotheyare":"Jherek Bischoff is a Los Angeles-based composer, arranger, producer and multi-instrumental performer.","whylisten":"<p>Jherek Bischoff&nbsp;has collaborated with the likes of Kronos Quartet, Bang on a Can, David Byrne and Neil Gaiman, and he has performed in venues and festivals around the globe including Royal Albert Hall for BBC Proms, Carnegie Hall, Radio City Music Hall, Adelaide Festival and Tasmania&#39;s MONA FOMA. His work as a composer has garnered commissions from Kronos Quartet, Lincoln Center, and St Ann&#39;s Warehouse and has been performed by Seattle Symphony, Adelaide Art Orchestra, Wordless Music, Stargaze and yMusic.<\/p><p>His critically-acclaimed releases include 2016&#39;s <em>Cistern<\/em>, 2012&#39;s <em>Composed<\/em>, and a co-release in 2016 with Amanda Palmer,&nbsp;<em>Strung Out In Heaven: A Bowie String Quartet Tribute<\/em>. He has been interviewed by Terry Gross on &quot;Fresh Air&quot; and by Jonathan Ross for BBC Radio 2&#39;s &quot;Arts Show&quot;. In 2014, Bischoff made his musical scoring debut with Johnny Breitwieser at Vienna&#39;s Schauspielhaus; in 2015, Bischoff ventured into television, contributing work to Starz&#39; &quot;Blunt Talk&quot; and Netflix&#39;s &quot;Wet Hot American Summer: First Day of Camp.&quot;<\/p><p>Bischoff was the artist in residence for the month of August for Times Square&#39;s Midnight Moment, where his video for &quot;Cistern&quot; was broadcast every night on Times Square&#39;s electronic billboards, culminating in two live performances in the middle of Times Square. He is currently working on his next musical score for Theater Basel&#39;s production of &quot;Das Fliegende Klassenzimmer,&quot; which premieres in December, and a collaborative album with Kronos Quartet.<\/p>","slug":"jherek_bischoff","published_at":"2016-02-19 20:07:00","updated_at":"2016-11-07 13:14:40"}}