{"speaker":{"id":2956,"title":"","firstname":"Carol","middleinitial":"F","lastname":"Cohen","description":"CEO and co-founder, iRelaunch","whotheyare":"Carol Fishman Cohen documents successful transitions back into the workforce after career breaks.","whylisten":"        <p class=\"p1\"><span class=\"s1\">Carol Fishman Cohen is CEO and co-founder of iRelaunch, a comprehensive career reentry resource for employers, individuals, universities and professional associations. Cohen has been on a dual mission for nearly 15 years: to elevate the profile and champion the success of professionals returning to the workforce after a career break, and to educate and support employers that engage with return-to-work talent. Her goal is to normalize the career path that includes a career break and document successful transitions back into the workforce so that employers understand the value proposition that returning professionals provide.<\/span><\/p><p class=\"p1\">Cohen is the co-author of career reentry strategy book&nbsp;<em><a href=\"http:\/\/geni.us\/CareerTrack\" target=\"_blank\">Back on the Career Track<\/a>&nbsp;<\/em>and a returning professional herself. Her return to work at Bain Capital after 11 years out of the full-time workforce is documented in a Harvard Business School case study. She has connected with thousands of professionals who have successfully returned to work after a hiatus, and she has engaged with hundreds of hiring managers to understand their perspectives on hiring people returning from career break.<\/p><p class=\"p1\">iRelaunch&#39;s flagship event, the annual iRelaunch Return-to-Work Conference in New York City, is the leading external source of candidates for the major Wall Street reentry internship programs and is the largest and longest-running dedicated career reentry event in the United States. Cohen has been tracking career reentry programs of all types since 2008 and writes a series of articles for Harvard Business Review on the theme &quot;The 40-Year-Old Intern.&quot; She originated and co-leads the Society of Women Engineers\/iRelaunch STEM Reentry Task Force, an initiative to increase the pipeline of female engineers via reentry internship programs at STEM sector companies.<\/p>","slug":"carol_f_cohen","published_at":"2016-03-18 00:03:00","updated_at":"2016-03-22 14:45:02"}}