{"speaker":{"id":2997,"title":"","firstname":"Sajay","middleinitial":"","lastname":"Samuel","description":"Educator","whotheyare":"Professor Sajay Samuel's proposal to reduce the burden of student loans is part of his larger preoccupation with thinking beyond the conventional categories of economics and ecology.","whylisten":"        <p class=\"p1\">Sajay Samuel is an award winning professor of accounting at the Smeal College of Business at Penn State University. He has organized seminars and lectured widely in Europe and elsewhere on a range of topics, including&nbsp;<a href=\"http:\/\/www.cbc.ca\/radio\/ideas\/how-to-think-about-science-part-11-1.464992\" target=\"_blank\">science and technology<\/a>, the political economy of professions and decision theory.<\/p><p class=\"p1\">Samuel received his Masters in Accounting and Ph.D in Business Administration from Penn State University in 1990 and 1995 respectively. Since then he has taught management accounting and related subjects to undergraduates, graduates, MBAs and Executives over assignments that included stints at Bucknell University and the University of Connecticut. He returned to Penn State in 2003 and now teaches a capstone course to all undergraduate business majors titled, &quot;Business and Industry Analysis.&quot;<\/p><p class=\"p1\">Samuel was awarded the 2006 Lester J. Shonto Faculty Award for Excellence in Accounting Education. Dr. Samuel&#39;s research has been published in such scholarly journals as <em>Accounting, Organizations and Society<\/em>, <em>Administration Science Quarterly<\/em>&nbsp;and <em>Symbolic Interaction<\/em>. His most recent work on accounting, technology and on the history of ideas, has appeared in three articles in the <em>Encyclopedia of Science, Technology and Ethics<\/em> (2005). His current research aims at clarifying the political implications of accounting practice. His studies in this area concern the political significance of administrative agencies and professional associations in liberal democratic polities. He has presented the early fruits of this work in France, Italy, Germany and England.<\/p>","slug":"sajay_samuel","published_at":"2016-06-03 17:58:00","updated_at":"2016-06-09 15:15:07"}}