{"speaker":{"id":2999,"title":"","firstname":"Elise","middleinitial":"","lastname":"Roy","description":"Lawyer, artist, human rights advocate","whotheyare":"Elise Roy thinks that designers have the capacity and responsibility to address and resolve human problems on micro and macro scales and contribute to social well-being.","whylisten":"<div>Deaf from the age of ten, Elise Roy has been a design thinker from early on, constantly adapting her environment and its tools to serve her extraordinary abilities. <\/div><div>&nbsp;<\/div><div>A Division I athlete in both soccer and lacrosse, Roy participated in the Olympic Development Program for soccer. In the classroom, she learned how to teach herself from books. At Brown University, Roy was recognized as one of the nation&#39;s elite soccer goalkeepers. She also began to see herself as an advocate for people with non-normative abilities. During her freshman year, the University tried to take away real time captioning, a cross between closed captions that you see on television and a courtroom stenographer, enabling her to hear and participate in the classroom&nbsp;for the first time. After organizing the other Deaf students at the University and meeting with several deans, Roy was able to secure the real time captioning for the remainder of her time at Brown.<\/div><div><br \/><\/div><div>Following Brown, Roy turned down an invitation to play professional soccer and instead opted for law school at Northeastern University. While in law school, Roy became actively involved in gay and lesbian rights, acting as a fellow for the human rights campaign in Washington D.C. Upon graduation, Roy received the highly prestigious Georgetown University Women&#39;s Law and Public Policy Fellowship, with alumni and board members that included Supreme Court Justice Ruth Ginsburg as well as D.C. Congresswoman Eleanor Holmes Norton.<\/div><div><br \/><\/div><div>Roy was in law school when she began working on the International Disability Rights Treaty at the United Nations, the first such human rights treaty to be passed in the 21st century. She quickly found herself thrust from a mere observer to the leader of her Article on culture, sport, recreation and leisure. The treaty, the first human rights treaty at the United Nations to be passed in the 21st century, was ratified in 2007. Over 155 countries have become signatories. After the treaty was signed in 2007, she traveled the world to see it put into action. Her work took her to Southeast Asia and the Gulf region as well as Africa.&nbsp;<\/div><div><br \/><\/div><div>Roy&#39;s deafness has always given her a heightened awareness of how profoundly design shapes the social, emotional and physical environment and this led her to study human-centered design in Maryland Institute College of Art&#39;s (MICA) Social Design program. Premised on the foundational notion that complex social problems require creative problem solving through design, she completed a master&#39;s degree with a thesis that investigated the barriers that exist for individuals with hearing loss in the fabrication technology and design realm. She researched various tools to identify possible adaptations for the Deaf user based on the auditory information emitted.&nbsp;<\/div><div><br \/><\/div><div>Roy promotes design thinking as fundamental to progressive social change and is a passionate proponent of applying social impact and human-centered design research to international aid and development work.<\/div>","slug":"elise_roy","published_at":"2016-06-16 00:39:00","updated_at":"2016-07-08 14:23:36"}}