{"speaker":{"id":3000,"title":"","firstname":"Gill","middleinitial":"","lastname":"Hicks","description":"Survivor and activist","whotheyare":"Gill Hicks has dedicated her life to being an advocate for peace.","whylisten":"        <p class=\"p1\">Dr. Gill Hicks is considered to be one of the most thought provoking, powerful and life affirming speakers in Australia and the UK. She is globally known as a survivor of the London terrorist bombings on July 7, 2005. She survived, but suffered severe and permanent injuries, losing both legs from just below the knee.<\/p><p class=\"p1\">Originally from Adelaide, Australia, Hicks has lived in London since 1991, however in 2012 Hicks returned to Australia where she operates nationally and internationally through her not for profit&nbsp;<a href=\"http:\/\/www.madnests.com\/\" target=\"_blank\">M.A.D. for Peace<\/a>&nbsp;network and her public speaking work.<\/p><p class=\"p1\">Her unique and compelling projects and initiative&#39;s, aimed at both deterring anyone from following the path of violent extremism and building sustainable models for peace, draw upon Hicks&#39;s previous roles within the Arts.<\/p><p class=\"p1\">An impressive career before the bombings included being at the helm of some of the UK&#39;s most prestigious and respected institutions -- including publishing director of the architecture, design and contemporary culture magazine, <em>Blueprint<\/em>, director of the Dangerous Minds design consultancy and head curator at the Design Council. It wasn&rsquo;t until after the bombings that Hicks decided to dedicate her life to being an advocate for peace. She has made it her mission to use her experiences and her new body form to positive effect.<\/p><p class=\"p1\">In 2007 Hicks founded the not for profit organisation M.A.D. for Peace, a platform that connects people globally and encourages us to think of &quot;Peace as a Verb,&quot; something that we have an individual responsibility to do every day.<\/p><p class=\"p1\">In 2008 Hicks released her first book,&nbsp;<a href=\"http:\/\/geni.us\/OneUnknown\" target=\"_blank\"><em>One Unknown<\/em><\/a>, named after the chilling label given to her as she arrived to hospital as an unidentified body. The book was shortlisted for the Mind Book of the Year Awards.<\/p><p class=\"p1\">Since her return to Australia in 2012, Hicks has been recognised as South Australian, Australian of the Year 2015 and is Chair to the Innovation component for the Committee for Adelaide.<\/p><p class=\"p1\">In 2013 Hicks welcomed her daughter, Amelie into the world. This, as she describes it, is her finest achievement and greatest acknowledgement of the brilliance and resilience of the human body.<\/p>","slug":"gill_hicks","published_at":"2016-06-17 18:00:00","updated_at":"2016-06-20 14:43:57"}}