{"speaker":{"id":3004,"title":"","firstname":"Timothy","middleinitial":"","lastname":"Ihrig","description":"Palliative care physician","whotheyare":"Timothy Ihrig advocates for an approach to healthcare that prioritizes a patient's personal values.","whylisten":"<p>Dr. Timothy Ihrig, MD practices palliative medicine, caring for the most vulnerable and sickest people, and helps other providers improve the quality and value of the care they provide to this population. His work has shown how patient-centered care improves quality and length of life, and that it has significant economic benefits to patients, healthcare systems and the economy.<\/p><p>Ihrig is nationally recognized for his expertise in continuum population health and community-based palliative care. He holds appointments as content expert to the Accountable Care Learning Collaborative, an industry-leading healthcare innovation collaborative co-chaired by former Health and Human Services Secretary and Utah Governor Mike Leavitt and former Food and Drug Administration Commissioner Dr. Mark McClellan. Ihrig is a member of the Advisory Council of the Iowa Healthcare Collaborative, a think-tank for strategies in health care quality, safety and value for the state of Iowa. He also serves as an Iowa Alternate-Delegate to the American Medical Association.<\/p><p>Ihrig has been an expert source for palliative care development for the Brookings Institution, and he was the sole practicing physician assisting the Iowa General Assembly in raising minimum standard requirements for Iowa physicians with respect to end-of-life care and oversight of prescriptive narcotics. He also acted as an expert clinician in support of Iowa Physician Orders for Life-Sustaining Treatment bill. He holds appointments as Clinical Adjunct Professor in the Department of Medicine at the University of Iowa Carver School of Medicine and acts as Palliative Care clinical instructor. He is on the board of the Hospice and Palliative Care Association of Iowa, is the former chair of the Advocacy Committee and sits on the Palliative Care Advisory Committee.<\/p><p>Ihrig&#39;s other interests include sexuality at the end of life and global health. He served as the Medical Chair of the Health Services Committee for Empower Tanzania Incorporated, whose mission is the development of sustainable healthcare solutions in sub-Saharan Africa for individuals suffering with HIV\/AIDS, cancer and other life-limited illnesses.<\/p>","slug":"timothy_ihrig","published_at":"2016-08-12 22:09:00","updated_at":"2016-08-23 15:21:54"}}