{"speaker":{"id":3012,"title":"","firstname":"Opal","middleinitial":"","lastname":"Tometi","description":"Human rights activist","whotheyare":"By taking the phrase \"Black Lives Matter\" onto social media, Opal Tometi helped turn a hashtag into a networked movement. ","whylisten":"<p>Opal Tometi is a New York-based Nigerian-American writer, strategist and community organizer. She is a co-founder of&nbsp;<a href=\"http:\/\/blacklivesmatter.com\/about\/\" target=\"_blank\">#BlackLivesMatter<\/a>. The historic political project was launched in the wake of the murder of Trayvon Martin in order to explicitly combat implicit bias and anti-black racism, and to protect and affirm the beauty and dignity of all black lives. Tometi is credited with creating the project&#39;s online platforms and initiating the social media strategy during its early days. The campaign has grown into a national network of approximately 50 chapters.<\/p><p>Tometi is currently at the helm of the country&#39;s leading black organization for immigrant rights, the&nbsp;<a href=\"http:\/\/blackalliance.org\/\" target=\"_blank\">Black Alliance for Just Immigration<\/a>&nbsp;(BAJI). Founded in 2006, BAJI is a national organization that educates and advocates to further immigrant rights and racial justice together with African-American, Afro-Latino, African and Caribbean immigrant communities. As the executive director at BAJI, Tometi collaborates with staff and communities in Los Angeles, Phoenix, New York, Oakland, Washington, DC and communities throughout the southern states. The organization&#39;s most recent campaign helped win family reunification visas for Haitians displaced by the 2010 earthquake. BAJI is an award-winning institution with recognition by leading intuitions across the country.<\/p><p>A transnational feminist, Tometi supports and helps shape the strategic work of&nbsp;<a href=\"https:\/\/www.facebook.com\/PanAfricanNetworkInDefenseOfMigrantsRightspaNidmr\/\" target=\"_blank\">Pan African Network in Defense of Migrant Rights<\/a>, and the&nbsp;<a href=\"http:\/\/blackimmigration.net\/\" target=\"_blank\">Black Immigration Network<\/a>&nbsp;international and national formations respectively, dedicated to people of African descent. She has presented<a href=\"https:\/\/www.youtube.com\/watch?v=yBzGBHJMqMI\" target=\"_blank\"> at the United Nations<\/a>&nbsp;and participated with the UN&#39;s Global Forum on Migration and Commission on the Status of Women. Tometi is&nbsp;<a href=\"http:\/\/www.nytimes.com\/2016\/03\/27\/arts\/design\/how-do-you-tell-the-story-of-black-america-in-one-museum.html?_r=0\" target=\"_blank\">being featured<\/a> &nbsp;in the Smithsonian&#39;s new National Museum for African American History and Culture for her historic contributions.<\/p><p>Prior to becoming executive director, Tometi worked as co-director and communications director at BAJI. Her contributions include leading organizing efforts for the first ever black-led rally for immigrant justice and the first Congressional briefing on black immigrants in Washington, DC. Additionally, she coordinated BAJI&#39;s work as launch partner with Race Forward&#39;s historic &quot;Drop the I-Word&quot; campaign, working with the campaign to raise awareness about the importance of respectful language and history through the lens of the Great Migration, the Civil Rights Movement and current migration of the black diaspora.\u2028 Tometi has been active in social movements for over a decade. She is a student of liberation theology and her practice is in the tradition of Ella Baker, informed by Stuart Hall, bell hooks and black Feminist thinkers. She was a lead architect of the Black-Brown Coalition of Arizona and was involved in grassroots organizing against SB 1070 with the Alto Arizona campaign. Tometi is a former case manager for survivors of domestic violence and still provides community education on the issue.<\/p><p>Tometi holds a Bachelor of Arts degree in history and a Masters of Arts degree in communication and advocacy. The daughter of Nigerian immigrants, she grew up in Phoenix, Arizona. She currently resides in the Brooklyn, New York where she loves riding her single speed bike and collecting African art.&nbsp;<\/p>","slug":"opal_tometi","published_at":"2016-08-30 18:29:00","updated_at":"2016-11-29 15:50:03"}}