{"speaker":{"id":3018,"title":"","firstname":"Katie","middleinitial":"","lastname":"Hinde","description":"Lactation researcher","whotheyare":"Katie Hinde is studying breast milk’s status as the first superfood, providing babies with invaluable microbes custom-tailored to their individual needs, via an incredible and unlikely dialogue between the mother’s enzymes and the baby’s saliva.","whylisten":"<p>Did you know mother&#39;s milk is older than dinosaurs? Or that the &quot;biological recipe&quot; of milk differs for sons and daughters? Or that milk doesn&#39;t just build babies but fuels them too? Mother&#39;s milk is the food, medicine and message that organize a baby&#39;s brain, body and behavior. What we take for granted in the grocery store dairy aisle has been shaped by hundreds of millions of years of natural selection. As scientists decode the mysteries of milk, we gain essential new tools for human health and well-being.<\/p><p>Scientist, writer and advocate, Katie Hinde, PhD, explores the dynamic interactions between mothers, milk, and infants. Author of dozens of essays and academic articles, Hinde situates her work at the intersection of the life sciences and social sciences to inform parents, clinicians and policy-makers about institutional and inter-personal support of mothers and babies. Hinde co-authored the book&nbsp;<a href=\"http:\/\/geni.us\/4BpMa\" target=\"_blank\"><em>Building Babies<\/em><\/a>&nbsp;and founded the science outreach blog, &quot;<a href=\"http:\/\/mammalssuck.blogspot.com\/\" target=\"_blank\">Mammals Suck&hellip;Milk!<\/a>&quot;<\/p><p>Hinde earned a PhD in Anthropology at UCLA, completed post-doctoral training in neuroscience at the California National Primate Research Center, and then launched her faculty career in the Department of Human Evolutionary Biology at Harvard University. Now an Associate Professor, Hinde is the Director of the Comparative Lactation Lab in the Center for Evolution and Medicine and the School of Human Evolution and Social Change at Arizona State University.<\/p><p>Described as &quot;The Milk Maven&quot; in the inaugural&nbsp;<a href=\"https:\/\/grist.org\/grist-50\/2016\/\" target=\"_blank\">Grist 50<\/a>&nbsp;list of &quot;innovators, organizers and visionaries who will lead us toward a more sustainable future,&quot; Hinde&#39;s work was highlighted for tackling social justice in health and research. From considering&nbsp;<a href=\"http:\/\/phenomena.nationalgeographic.com\/2015\/04\/08\/could-mothers-milk-nourish-mind-manipulating-microbes\/\" target=\"_blank\">how milk feeds microbes<\/a>&nbsp;to&nbsp;<a href=\"https:\/\/www.nytimes.com\/2014\/11\/06\/science\/in-a-mothers-milk-nutrients-and-a-message-too.html\" target=\"_blank\">researching how milk shapes infant behavior<\/a> , her research has been featured in the<em> New York Time<\/em>s, <em>National Geographic<\/em>, <em>La Presse<\/em>, <em>Wall Street Journal<\/em>, Quartz and more. Hinde has been recognized with Early Career Awards from the International Society for Research in Human Milk and Lactation and the American Society of Primatologists for making outstanding, original contributions to these fields as a young investigator.<\/p><p>Importantly, Hinde is dedicated to science outreach and building enthusiasm for animals, ecology and behavior. In 2013, Hinde created the annual&nbsp;<a href=\"https:\/\/theconversation.com\/march-mammal-madness-tournament-shows-the-power-of-performance-science-73425\" target=\"_blank\">March Mammal Madness<\/a>, a month-long science outreach extravaganza that is used in hundreds of classrooms described by Deadspin Deputy Editor Barry Petchesky as &quot;<a href=\"http:\/\/theconcourse.deadspin.com\/march-mammal-madness-is-the-only-bracket-you-need-1792790520\" target=\"_blank\">the only bracket you need<\/a>.&quot;<\/p><p>Understanding milk can directly translate to more personalized clinical recommendations and health optimization for mothers and their infants as well as substantiate the importance of infrastructure and institutional support for breastfeeding. Further, identifying the composition and function of milk informs the formulation of more representative artificial breast milk for those mothers facing obstacles or contraindications to breastfeeding. Lastly, decoding mother&#39;s milk will allow for enhanced precision medicine for the most fragile infants and children in neonatal and pediatric intensive care units. Such integrative approaches to mother&#39;s milk take discoveries at the bench to applications at the bedside.<\/p>","slug":"katie_hinde","published_at":"2016-08-30 19:25:00","updated_at":"2017-03-28 15:03:47"}}