{"speaker":{"id":3019,"title":"","firstname":"Kathy","middleinitial":"","lastname":"Hull","description":"Pediatric psychologist","whotheyare":"Kathy Nicholson Hull founded the first freestanding pediatric palliative care center in the US.","whylisten":"<p>With her pioneering spirit and tenacious nature, Dr. Kathy Hull recognized an unmet need in the provision of services to children with incurable medical conditions. Working in a traditional medical environment at a prominent children&#39;s hospital, with its emphasis on curative treatment, Hull realized the necessity for a more supportive medical model, and setting, for children at the end of their lives. Her research of pediatric care modalities convinced her that a well-established prototype of pediatric palliative care existed throughout Europe and could be replicated here.<\/p><p>Acting as an architect for creative change, Hull navigated the labyrinth of permits and approvals, as well as managed the design and building of the George Mark Children&#39;s House (GMCH). The House opened in 2004 in San Leandro, California, where it&#39;s set on five beautifully landscaped acres. Since opening its doors, more than twelve hundred children and their families have been lovingly cared for by the staff of GMCH. Additionally, George Mark has served as the role model for sixteen other entities currently under development throughout the United States. Presently, Dr. Hull is the staff Psychologist and President of the Board of GMCH, as well as being an adjunct staff member at UCSF Benioff Children&rsquo;s Hospital Oakland.<\/p><p>Among the honors Hull has received for her philanthropy and humanitarianism are Maria Shriver&rsquo;s Minerva Award; Traditional Home Magazine Classic Woman Award Purpose Prize Fellow and Jefferson Award. She is also a Regent Emeritus of Santa Clara University. Hull and her husband Bill reside in the San Francisco Bay Area and are proud parents of eight offspring and have eight delightful grandchildren.<\/p>","slug":"kathy_hull","published_at":"2016-08-30 19:27:00","updated_at":"2017-03-02 15:56:25"}}