{"speaker":{"id":3021,"title":"","firstname":"Stacy","middleinitial":"","lastname":"Smith","description":"Media researcher","whotheyare":"Stacy Smith shows how Hollywood’s homogenous (and overwhelmingly male) culture systematically excludes women and minorities.","whylisten":"<p>Dr. Stacy L. Smith is the Founder and Director of the Media, Diversity, and Social Change Initiative at the Annenberg School for Communication &amp; Journalism at the University of Southern California, where she is also an Associate Professor. Her work examines gender, race, LGBT status, disability and age on screen and gender and race\/ethnicity behind the camera in cinematic content as well as barriers and opportunities facing women and people of color in the entertainment industry. She also conducts economic analyses related to diversity and the financial performance of films. Smith is a world leader, with speaking engagements ranging from the TED Women stage to the United Nations. Her research sets the global standard for data on employment diversity in entertainment, and she is a trusted source to the entertainment industry. Her&nbsp;work is cited widely by both corporate and educational audiences.<\/p><p>Smith has written more than 100 journal articles, book chapters, and reports on content patterns and effects of the media. Her research has been written about in the <em>New York Times<\/em>, <em>Los Angeles Times<\/em>, fivethirtyeight.com, The Atlantic, The Huffington Post, Newsweek, The Hollywood Reporter, Variety, Wired and USA Today, among others. She has a co-edited essay in Maria Shriver&#39;s book, <em>A Woman&#39;s Nation Changes Everything<\/em> (2009). Her most recent research reports include the Comprehensive Annenberg Report on Diversity (CARD), multiple landmark studies with Sundance Institute and Women in Film Los Angeles and a study of 800 top-grossing films conducted at USC Annenberg.<\/p>","slug":"stacy_smith","published_at":"2016-08-30 19:30:00","updated_at":"2017-02-24 15:47:01"}}