{"speaker":{"id":3022,"title":"","firstname":"Kimberlé","middleinitial":"","lastname":"Crenshaw","description":"Civil rights advocate","whotheyare":"As a pioneer in critical race theory, Kimberlé Crenshaw helped open the discussion of the double bind faced by victims of simultaneous racial and gender prejudice.","whylisten":"<p>Kimberlé Crenshaw, professor of law at UCLA and Columbia Law School, is a leading authority in the area of cvil&nbsp;rights, Black feminist legal theory, and race, racism and the law. Her work has been foundational in two fields of study that have come to be known by terms that she coined: critical race theory and intersectionality.<\/p><p>Crenshaw&rsquo;s articles have appeared in the <em>Harvard Law Review<\/em>, <em>National Black Law Journal<\/em>, <em>Stanford Law Review<\/em> and <em>Southern California Law Review<\/em>. She is the founding coordinator of the Critical Race Theory Workshop, and the co-editor of the volume,&nbsp;<a href=\"http:\/\/geni.us\/GNsc\" target=\"_blank\"><em>Critical Race Theory: Key Documents That Shaped the Movement<\/em><\/a>. She has lectured widely on race matters, addressing audiences across the country as well as in Europe, India, Africa and South America. A specialist on race and gender equality, she has facilitated workshops for human rights activists in Brazil and in India, and for constitutional court judges in South Africa. Her groundbreaking work on intersectionality has traveled globally and was influential in the drafting of the equality clause in the South African Constitution.<\/p><p>Crenshaw authored the background paper on race and gender discrimination for the United Nation&#39;s World Conference on Racism, served as the rapporteur for the conference&#39;s expert group on gender and race discrimination, and coordinated NGO efforts to ensure the inclusion of gender in the WCAR Conference Declaration. She is a leading voice in calling for a gender-inclusive approach to racial justice interventions, having spearheaded the &quot;Why We Can&#39;t Wait&quot; campaign and co-authored&nbsp;<a href=\"http:\/\/geni.us\/ONVPWP\" target=\"_blank\"><em>Black Girls Matter: Pushed Out, Overpoliced and Underprotected<\/em><\/a>, and&nbsp;<a href=\"http:\/\/geni.us\/a2rOT\" target=\"_blank\"><em>Say Her Name: Resisting Police Brutality Against Black Women<\/em><\/a>.<\/p><p>Crenshaw has worked extensively on a variety of issues pertaining to gender and race in the domestic arena including violence against women, structural racial inequality and affirmative action. She has served as a member of the National Science Foundation&#39;s committee to research violence against women and has consulted with leading foundations, social justice organizations and corporations to advance their race and gender equity initiatives.<\/p><p>In 1996, she co-founded the&nbsp;<a href=\"http:\/\/www.aapf.org\/\" target=\"_blank\">African American Policy Forum<\/a>&nbsp;to house a variety of projects designed to deliver research-based strategies to better advance social inclusion. Among the Forum&#39;s projects are the Affirmative Action Research and Policy Consortium and the Multiracial Literacy and Leadership Initiative. In partnership with the Aspen Roundtable for Community Change, Crenshaw facilitated workshops on racial equity for hundreds of community leaders and organizations throughout the country. With the support of the Rockefeller Foundation, Crenshaw facilitates the Bellagio Project, an international network of scholars working in the field of social inclusion from five continents. She formerly served as Committee Chair for the U.S.-Brazil Joint Action Plan to Promote Racial and Ethnic Equality, an initiative of the U.S. State Department.<\/p><p>Crenshaw has received the Fulbright Distinguished Chair for Latin America, the Alphonse Fletcher Fellowship and was a Fellow at the Center for Advanced Study in the Behavioral Sciences at Stanford University in 2009 and a Visiting Fellow at the European University Institute in Florence, Italy in 2010. Currently, Crenshaw is director of the Center for Intersectionality and Social Policy Studies &nbsp;at Columbia Law School, which she founded in 2011, as well as the Centennial Professor at the LSE Gender Institute 2015-2018. Crenshaw received her J.D. from Harvard, L.L.M. from University of Wisconsin and B.A. from Cornell University.<\/p>","slug":"kimberle_crenshaw","published_at":"2016-08-30 19:33:00","updated_at":"2016-11-15 02:07:48"}}