{"speaker":{"id":3027,"title":"","firstname":"Kim Katrin","middleinitial":"","lastname":"Milan","description":"Writer, educator, artist","whotheyare":"Through her art and writing, Kim Katrin Milan advocates for queer, trans and feminist issues. Now she’s using her own love story to help bridge communities.","whylisten":"<p>A daughter of the diaspora -- Afro-Caribbean, Venezuelan Arawak, Indian and Scottish, hailing from Trinidad and living between Toronto and New York -- Kim Katrin Milan is an acclaimed educator, writer and artist.<\/p><p>Kim is the co-founder and Executive Director of The People Project, an initiative to bring forth local and international community development for queer and trans folks of color and their allies through alternative education, art&shy;-activism and collaboration. She is also one of the owners of the Glad Day Book Shop, the oldest LGBT bookstore in the world.&nbsp;<\/p><p>As an educator, Kim travels around the world talking to people about justice, equity and human rights. She is dedicated to inclusivity and invested in arousing a sense of curiosity and empathy in her audience. She uniquely weaves together the historical context, statistical analysis, as well as current events.<\/p><p>A public researcher, consultant and human rights educator, Kim has shared hundreds of unique resources and presentations around intersectional issues including race, ability and gender. As a social entrepreneur, she speaks to the opportunities and challenges for women in business and leadership roles. With great openness, she welcomes difficult conversations hosting community dialogues and sharing practical strategies around sexuality and consent, queer and trans allyship. and anti-racism and equity.<\/p><p>Since 2012, Kim has spoken at universities including Princeton, Dartmouth, McGill and Mount Allison. She has opened for cultural scholar Cornel West at UC Davis, delivered the keynote address at HBCU&#39;s Morehouse and Spelman&#39;s first Pride, and she was a panelist at Amber Rose&#39;s first SlutWalk. She has hosted events for the United Nations, acted as the Grand Marshall for Hudson, NY Pride and hosted an session at Dreamforce 2016.<\/p><p>Kim has contributed to <em>Cosmopolitan<\/em>, MTV, NBC, Larry King Now, Buzzfeed and the CBC, both independently and alongside her husband Tiq Milan. She regularly contributes to TeleSUR English, the Central American news network.<\/p>","slug":"kim_katrin_milan","published_at":"2016-08-30 19:58:00","updated_at":"2016-12-05 16:06:15"}}