{"speaker":{"id":3035,"title":"","firstname":"Brittney","middleinitial":"","lastname":"Cooper","description":"Cultural theorist","whotheyare":"With scholarship and incisive commentary that exposes the marginalized narratives hidden within \"mainstream\" history, Brittney Cooper writes at the vanguard of cultural criticism.","whylisten":"<p>Brittney Cooper spends her days in conversation with college students about everything from feminism to hip hop. During her other waking hours, she uses digital platforms and blogging as a virtual classroom to incite her national readership to have more robust and honest conversations about racism, popular culture and how to take down the patriarchy. She is an Assistant Professor of Women&#39;s and Gender Studies and Africana Studies at Rutgers University.<\/p><p>Cooper&#39;s work and words have appeared on MSNBC, BET, NPR, PBS, the <em>New York Times<\/em>, the <em>Los Angeles Times<\/em>, TV Guide, <em>New York<\/em> Magazine,&nbsp;<a href=\"http:\/\/www.salon.com\/writer\/brittney_cooper\/\" target=\"_blank\">Salon.com<\/a>, The Root.com and Al Jazeera America, among many others. She is a regular contributor at&nbsp;<a href=\"http:\/\/www.cosmopolitan.com\/author\/13949\/brittney-cooper\/\" target=\"_blank\">Cosmpolitan.com<\/a>&nbsp;and co-founder of the Crunk Feminist Collective and blog. Cooper is author of two forthcoming books,&nbsp;<a href=\"http:\/\/geni.us\/YGcbRN\" target=\"_blank\"><em>Beyond Respectability: The Intellectual Thought of Race Women<\/em><\/a>&nbsp;(University of Illinois Press 2017) and&nbsp;<a href=\"http:\/\/geni.us\/WnGyQA\" target=\"_blank\"><em>Never Scared: One Black Feminist&#39;s Refusal to Bow Down, Back Up, or Give In<\/em><\/a>&nbsp;(St. Martin&rsquo;s Press 2017) and editor of one co-edited volume,&nbsp;<a href=\"http:\/\/geni.us\/MFTG\" target=\"_blank\"><em>The Crunk Feminist Collection<\/em><\/a>&nbsp;(The Feminist Press 2017).&nbsp;<\/p>","slug":"brittney_cooper","published_at":"2016-08-31 19:54:00","updated_at":"2017-02-21 16:09:25"}}