{"speaker":{"id":3040,"title":"","firstname":"Sandi","middleinitial":"","lastname":"Toksvig","description":"Broadcast personality, politician, author","whotheyare":"Long revered in the UK for her wit and candor, Sandi Toksvig is now lending her familiar voice to a greater cause -- equality for women.","whylisten":"<p>Sandi Toksvig OBE is an award-winning writer, broadcaster and performer. She was born in Copenhagen, Denmark but grew up traveling the world with her family as they followed the work of her father, Claus Toksvig, Danish television&#39;s most famous foreign correspondent. Toksvig&nbsp;gave her own first television interview when she was six. &nbsp;After graduating with a first class degree from Cambridge University she began her acting career first at Nottingham Playhouse and then the Open Air Theatre in Regent&#39;s Park.<\/p><p>Toksvig&#39;s first experience of live television was when she hosted and co-wrote the children&#39;s Saturday morning show &quot;No 73,&quot; which she did for six years. Other TV followed including the improvisation show, &quot;Whose Line is it Anyway?&quot; and six years as team captain on &quot;Call My Bluff.&quot; Toksvig&nbsp;is the new host of the BBC&#39;s entertainment show <em>QI<\/em> and is currently recording the eighth season hosting the game show &quot;15-1&quot; for Channel 4. She has also had recent acting cameos in &quot;Call the Midwife&quot; and &quot;Up the Women.&quot; Toksvig is well known on BBC Radio 4 for her appearances on &quot;I&#39;m Sorry I Haven&#39;t a Clue&quot; as well as hosting &quot;Excess Baggage&quot; and the News Quiz.<\/p><p>Toksvig has also produced television. The current Playhouse Presents strand on Sky Arts was conceived by her and she produced and wrote much of the content for the first three years.<\/p><p>Toksvig has written over twenty books including fact and fiction for both children and adults. Her stage play,<em> Bully Boy<\/em>, was the opening production of London&#39;s newest theatre, the St James. The piece also had a successful run in Copenhagen. Her latest novel <em>The End of the Sky<\/em>, set on the Oregon Trail in 1847, will be published in 2017. It&#39;s a sequel to her last novel <em>A Slice of the Moon<\/em> about the Irish potato famine. Her new comedy play <em>Silver Linings<\/em> deals with society&#39;s attitudes to older women. It will open at the Rose Theatre in February 2017 before going on tour. &nbsp;Toksvig&nbsp;has written a column for <em>Good Housekeeping<\/em> magazine for twenty years.<\/p><p>In March 2015, along with journalist Catherine Mayer, Toksvig&nbsp;co-founded Britain&#39;s newest political party, The Women&rsquo;s Equality Party (WEP), which in one year of existence now has over 70 branches across the UK. WEP stood candidates in the London, Welsh and Scottish elections of May 2016.<\/p><p>Toksvig has many honorary degrees. She is the President of the Women of the Year Lunch, Chancellor of the University of Portsmouth and in 2014 she was made an Officer of the British Empire by the Queen.<\/p>","slug":"sandi_toksvig","published_at":"2016-08-31 21:12:00","updated_at":"2016-11-21 16:08:55"}}