{"speaker":{"id":3045,"title":"","firstname":"Philippa","middleinitial":"","lastname":"Neave","description":"Electoral consultant","whotheyare":"Philippa Neave is senior advisor on the UN's Lexicon of Electoral Terminology.","whylisten":"<p>Philippa Neave specializes in electoral communications and education, devising information and training campaigns for voters and candidates in emerging democracies. Since 2005 she has worked in electoral assistance as a consultant for the United Nations, developing strategies to inform people on their voting rights, with particular emphasis on reaching women and people with low levels of literacy. She has worked on elections in Afghanistan, Iraq UAE, Jordan, Turkey, Cambodia, Madagascar, Southern Sudan and Tunisia.<\/p><p>An Arabic speaker, Neave initiated and conducted a three-year project to produce the first Arabic lexicon of electoral terminology. With close to 500 entries, the tri-lingual (Arabic, English and French) lexicon provides clear and accurate explanations of key concepts and terms in the field of elections. Neave&#39;s approach included a groundbreaking effort to account for Arabic language variations across the region in eight participating countries: Egypt, Iraq, Jordan, Lebanon, Libya, Palestine, Tunisia and Yemen.&nbsp;<\/p><p>Neave has always worked with words. For 15 years she was a reporter specialising in the Middle East. After a year and a half in Cairo, she became a foreign correspondent for an international features syndicate in based Rome, Paris and New York. Later, in London, she was chief editor of a magazine on arts and culture and in Paris after that, she was chief editor of European Press Network. She then left the news business and worked as Middle East Director for a British charity, based in Beirut for five years.<\/p><p>Her interest in democracy building goes back to the time when soon after leaving university, she served for several years as deputy Secretary General of the Parliamentary Association for Euro-Arab Cooperation, organising and participating in the Euro-Arab Parliamentary Dialogue.<\/p><p>Born in 1960 in France to an English father and a Danish mother, Neave grew up bilingual. She studied Arabic at Durham University in the UK and obtained a BA degree. She speaks seven languages, including Arabic, and is based in Paris.<\/p><div><br \/><\/div>","slug":"philippa_neave","published_at":"2016-09-02 20:14:00","updated_at":"2016-10-21 14:52:50"}}