{"speaker":{"id":3051,"title":"","firstname":"Michele L.","middleinitial":"","lastname":"Sullivan","description":"Social innovator","whotheyare":"Michele L. Sullivan is known for her sustainable and collaborative approach to philanthropic investing.","whylisten":"<p>Michele L. Sullivan has held various globally influential leadership positions at Caterpillar during her 29-year career. She currently is Caterpillar&#39;s Director of Corporate Social Innovation and President of the&nbsp;<a href=\"http:\/\/www.togetherstronger.com\" target=\"_blank\">Caterpillar Foundation<\/a>, the philanthropic arm of Caterpillar Inc.<\/p><p>Throughout Sullivan&#39;s career, she has dramatically grown the reach, influence and impact of each role. Her time with the Caterpillar Foundation is no different. She has taken the Caterpillar Foundation from a transactional Foundation into a global and strategic Foundation. She has moved the Foundation from Corporate Social Responsibility into Corporate Social Innovation. This strategy places the human need first, not as an afterthought of profit. Sullivan is well known for her global expertise and sustainable and collaborative approach to philanthropic investing.<\/p><p>Sullivan strongly believes monumental and sustainable change in our largest global challenges can only happen through partnerships and collaboration between public, private and non-profit entities. This strategy resulted in the Caterpillar Foundation&#39;s transformation into one of the most influential corporate foundations and, ultimately, the launch of the Foundation&#39;s collaborative impact platform,&nbsp;<a href=\"http:\/\/www.togetherstronger.com\/\" target=\"_blank\">Together.Stronger<\/a>.<\/p><p>Determination and resilience have been present throughout Sullivan;s life. She endured many years of orthopedic surgeries and other challenges. She provided leadership starting in the Little Prairie Chapter of Little People of America as a teenager. She was named by Inside Philanthropy as one of the 50 most powerful women in philanthropy and she served as a US delegate to the United Nations Commission on the Status of Women. She is a member of the ONE board of directors and chairs the Greater Peoria Local Initiatives Support Corporation (LISC) Advisory Board. She earned her MBA from Bradley University, and she is the first woman to be President of the Caterpillar Foundation.<\/p>","slug":"michele_l_sullivan","published_at":"2016-09-07 20:38:00","updated_at":"2017-03-21 14:57:33"}}