{"speaker":{"id":3077,"title":"","firstname":"Ryan","middleinitial":"","lastname":"Gravel","description":"Urban planner, designer, author","whotheyare":"Ryan Gravel is an architect and urban planner who played a key role in developing the Atlanta BeltLine.  ","whylisten":"<p>Ryan Gravel is an urban planner, designer and author working on site design, infrastructure, concept development and public policy as the founding principal at&nbsp;<a href=\"https:\/\/ryangravel.com\/sixpitch\/\" target=\"_blank\">Sixpitch<\/a>. His Master&#39;s thesis in 1999 was the original vision for the&nbsp;<a href=\"http:\/\/beltline.org\/\" target=\"_blank\">Atlanta Beltline<\/a>, a 22-mile transit greenway that, with fifteen years of progress, is changing both the physical form of his city and the decisions people make about living there. Now a $4 billion public-private investment in the early stages of implementation, the project&#39;s health and economic benefits are already evident through record-breaking use of its first section of mainline trail and $3.1 billion of private-sector investment since 2005.<\/p><p>Alongside project work at Sixpitch and research on similar &quot;catalyst infrastructure&quot; projects around the world, Gravel&#39;s new book makes a compelling case about what these unexpected assets mean for our lives and why they matter. In&nbsp;<a href=\"http:\/\/geni.us\/uWkQj\" target=\"_blank\"><em>Where We Want to Live &ndash; Reclaiming Infrastructure for a New Generation of Cities<\/em><\/a> (St. Martin&#39;s Press, 2016), he summons the streets of Paris, the spirit of Detroit, the unruly Los Angeles River and dozens of other examples to illustrate how a new cultural momentum is illuminating a brighter path forward for cities. Through insightful narrative, Gravel articulates how projects like the Atlantas Beltline, New York&#39;s High Line and Houston&#39;s Buffalo Bayou are part of this movement and how they will ultimately transform our way of life with the same magnitude that automobiles and highways did in the last century. More than discrete projects, he argues, they represent a shared vision for our future that will require us to forget tired arguments about traffic, pollution, blight and sprawl -- and&nbsp;instead leverage those conditions as assets in the creation of something far more interesting than anything we&rsquo;ve seen so far.<\/p><p>Gravel&#39;s early work as a volunteer and later across the nonprofit, public and private sectors has brought his long-term commitment to sustainable city building full circle -- from vision, to advocacy, to planning, design and implementation. He speaks internationally and has received numerous awards for his work on the project.&nbsp;<\/p><p>Gravel&#39;s latest pipedream is a nonprofit idea studio called&nbsp;<a href=\"https:\/\/ryangravel.com\/generator\/\" target=\"_blank\">Generator<\/a>, to be funded in part by a bar. While juggling two kids, amazing projects like the Atlanta City Design and&nbsp;requests for help navigating impacts from the Atlanta Beltline, he&#39;s also taking time to look up and enjoy the city he wants to live in.<\/p>","slug":"ryan_gravel","published_at":"2016-10-03 17:11:00","updated_at":"2016-12-01 15:53:55"}}