{"speaker":{"id":3080,"title":"","firstname":"Adam","middleinitial":"","lastname":"de la Zerda","description":"Biologist, electrical engineer","whotheyare":"Adam de la Zerda develops new medical imaging technologies to detect and destroy cancer.","whylisten":"<p>Adam de la Zerda is an assistant professor at the Departments of Structural Biology and Electrical Engineering (courtesy) at Stanford University &ndash; School of Medicine. He completed his undergraduate degree in computer engineering and physics from the Technion &ndash; Israel Institute of Technology in 2005 <em>Summa Cum Laude<\/em>. He received his Ph.D. in Electrical Engineering from Stanford University in 2011, where he developed the Photoacoustic Molecular Imaging technique with Sanjiv Sam Gambhir. He was then a postdoctoral fellow at the lab of Carolyn Bertozzi at UC Berkeley &ndash; Chemistry Department, before joining the Stanford faculty in 2012.<\/p><p>de la Zerda&#39;s research interests span the broad field of molecular imaging. His lab focuses on developing new optical imaging instrumentation and chemistry tools to study the complex spatiotemporal behavior of biomolecules in living subjects. The lab uses animal models for cancer and ophthalmic diseases such as age-related macular degeneration. His research efforts span both basic science and clinically translatable work.<\/p><p>de la Zerda has received many awards and honors for his work, including the Pew-Stewart Scholar for Cancer Research, the AFOSR Young Investigator Award, Baxter Faculty Scholar Award, Dale F. Frey Award, <em>Forbes<\/em> Magazine 30 Under 30 in Science and Healthcare for 2012 and 2014, NIH Director&rsquo;s Early Independence Award, Damon Runyon Cancer Research Foundation Postdoctoral Fellowship, Era of Hope Distinguished Predoctoral Poster Award, Best Poster Presentation at SPIE Photonics West, the Young Investigator Award at the World Molecular Imaging Congress, the Department of Defense Breast Cancer Research Program Award for Predoctoral researchers, the Bio-X Graduate Student Fellowship and first place at the Bay Area Entrepreneurship Contest. He has published papers in leading journals including <em>Nature Medicine<\/em>, <em>Nature Nanotechnology<\/em> and <em>PNAS<\/em>. He holds a number of patents and is the founder of a medical device company,&nbsp;<a href=\"http:\/\/www.clickdiagnostics.com\/\" target=\"_blank\">Click Diagnostics<\/a>.<\/p>","slug":"adam_de_la_zerda","published_at":"2016-10-04 00:10:00","updated_at":"2016-10-05 19:46:52"}}