{"speaker":{"id":3081,"title":"","firstname":"Alyssa","middleinitial":"","lastname":"Monks","description":"Painter","whotheyare":"Alyssa Monks transfers the intimacy and vulnerability of human experience onto a painted surface.","whylisten":"<p>Alyssa Monks blurs the line between abstraction and realism through layering different spaces and moments in her paintings. Using semi-transparent filters of glass, vinyl, steam and water to flip background and foreground in her 10-year water series, she seduced the viewer into shallow spaces. Today, she is imposing a transparent landscape of infinite space over her emotionally evocative subjects.<\/p><p>The tension in her mostly large-scale paintings is sustained not only by the composition but also by the surface treatment itself. Each brushstroke is thickly applied oil paint, like a fossil recording every gesture and decision, expressing the energetic and empathic experience of the handmade object.<\/p><p>Monks&#39;s work is represented by&nbsp;<a href=\"http:\/\/forumgallery.com\/\" target=\"_blank\">Forum Gallery<\/a>&nbsp;in New York City. She lives and paints in Williamsburg, Brooklyn. Her latest solo exhibition &quot;Resolution&quot; took place March and April of 2016 at Forum Gallery. Monks&#39;s paintings have been the subject of numerous solo and group exhibitions including &quot;<a href=\"http:\/\/www.martina-padberg.de\/ausstellungen\/intimacy-baden-in-der-kunst\/\" target=\"_blank\">Intimacy<\/a>&quot; at the Kunst Museum in Ahlen, Germany and &quot;<a href=\"http:\/\/www.tfaoi.com\/aa\/9aa\/9aa145.htm\" target=\"_blank\">Reconfiguring the Body in American Art, 1820&ndash;2009<\/a>&quot; at the National Academy Museum of Fine Arts, New York. Her work is represented in public and private collections, including the Savannah College of Arts, the Somerset Art Association, Fullerton College, the Seavest Collection and the collections of Eric Fischl, Howard Tullman, Gerrity Lansing, Danielle Steele, Alec Baldwin and Luciano Benetton.<\/p><p>Born 1977 in New Jersey, Monks began oil painting as a child. She studied at The New School in New York and Montclair State University and earned her B.A. from Boston College in 1999. During this time she studied painting at Lorenzo de&rsquo; Medici in Florence. She went on to earn her M.F.A from the&nbsp;<a href=\"http:\/\/www.nyaa.edu\/nyaa\/index.html\" target=\"_blank\">New York Academy of Art<\/a>, Graduate School of Figurative Art in 2001. She completed an artist in residency at Fullerton College in 2006 and has lectured and taught at universities and institutions nationwide. She continues to offer&nbsp;<a href=\"http:\/\/alyssamonks.com\/page\/profile\/2320\/Workshops\" target=\"_blank\">workshops<\/a>&nbsp;and lectures regularly.<\/p><p>Monks has been awarded the Elizabeth Greenshields Foundation Grant for Painting three times and serves as a member of the New York Academy of Art&#39;s Board of Trustees.<\/p>","slug":"alyssa_monks","published_at":"2016-10-04 16:07:00","updated_at":"2016-10-26 14:56:53"}}