{"speaker":{"id":3082,"title":"","firstname":"Trevor","middleinitial":"","lastname":"Copp","description":"Artistic director","whotheyare":"Trevor Copp is known for innovative social justice theater that blends physicality, image and narrative.","whylisten":"<p>Trevor Copp was a full-time ballroom dance instructor and regional Fred Astaire&#39;s Canada American Style Latin\/Ballroom Champion. He retired from teaching to pursue his love of theater and now runs&nbsp;<a href=\"http:\/\/www.totteringbiped.ca\/liquid-lead\" target=\"_blank\">Tottering Biped Theatre<\/a>, a professional theater company emphasizing social justice and highly physical work in Burlington, Ontario, Canada. Copp has performed in over 30&nbsp;international&nbsp;cities and&nbsp;theater festivals. The salsa scene keeps him dancing, however. Locally, he coaches the World Salsa Champions, and internationally he&#39;s an avid salsa tourist, having danced it in 13 countries so far.<\/p><p>Copp and Jeff Fox met as colleagues during their shared tenure with Fred Astaire&#39;s Canada and remained friends after Copp retired from teaching. They would dance at social occasions where they developed their &quot;playing fair&quot; method of sharing the lead, which caught the eye of local dramaturge, Lisa O&rsquo;Connell. Thus began the theatrical collaboration which led to the creation of a full-length Ballroom Dance\/Theatre production, &quot;First Dance,&quot; about the development of the first dance for a same sex wedding. Through building the show they formalized their &quot;Liquid Lead&quot; concept and continue to tour the piece at regional professional theaters, festivals and even as part of an international dance festival in Tirana, Albania. In 2015 Alida Esmail, a former student of Copp&#39;s, championed the TEDx Montreal proposal and graciously volunteered to help the Fox and Copp demonstrate their work on the TEDx stage.<\/p>","slug":"trevor_copp","published_at":"2016-10-10 21:24:00","updated_at":"2016-10-14 21:10:56"}}