{"speaker":{"id":3086,"title":"","firstname":"Ian","middleinitial":"","lastname":"Bremmer","description":"Political scientist, author","whotheyare":"Ian Bremmer is the president and founder of Eurasia Group, the global research firm.","whylisten":"<p>Dubbed a &quot;guru&quot; in the field of political risk by <em>The Economist <\/em>and <em>The Wall Street Journal<\/em>, Ian Bremmer&nbsp;is a foreign affairs columnist and editor at large for <em>Time<\/em> magazine and teaches at Columbia University&#39;s School of International and Public Affairs.<\/p><p>Bremmer is credited with bringing the craft of political risk to financial markets. He created Wall Street&#39;s first global political risk index (GPRI), and he established political risk as an academic discipline. His definition of emerging markets -- &quot;those countries where politics matter at least as much as economics for market outcomes&quot; -- has become an industry standard. &quot;G-Zero,&quot; his term for a global power vacuum in which no country is willing and able to set the international agenda, is widely accepted by policymakers and thought leaders.&nbsp;<\/p><p>Bremmer has published eleven books including the <em>New York Times<\/em> bestseller&nbsp;<a href=\"https:\/\/geni.us\/fP80JD\" target=\"_blank\"><em>Us vs Them: The Failure of Globalism<\/em><\/a>, which examines the rise of populism across the world. His forthcoming book,&nbsp;<a href=\"https:\/\/www.simonandschuster.com\/books\/The-Power-of-Crisis\/Ian-Bremmer\/9781982167509\" target=\"_blank\"><em>The Power of Crisis: How Three Threats -- and Our Response -- Will Change the World<\/em><\/a>, comes out May 17, 2022. He appears regularly on Fox, CNN, MSNBC and other networks.<\/p><p>Bremmer earned a PhD in political science from Stanford University in 1994 and was the youngest-ever national fellow at the Hoover Institution. In 2007, he was named a Young Global Leader of the World Economic Forum. He is the Harold J. Newman Distinguished Fellow in Geopolitics at the Asia Society Policy Institute and serves on the President&#39;s Council of the Near East Foundation, the Leadership Council for Concordia and the Board of Trustees of Intelligence Squared.&nbsp;<\/p><p>Bremmer established Eurasia Group with just 25,000 dollars in 1998. Today, the company has offices in New York, Washington, San Francisco, London, Brasilia, Sao Paulo, Singapore and Tokyo, as well as a network of experts and resources in 90 countries.<\/p>","slug":"ian_bremmer","published_at":"2016-10-20 14:29:00","updated_at":"2022-03-11 15:20:13"}}