{"speaker":{"id":3096,"title":"","firstname":"Adam","middleinitial":"","lastname":"Galinsky","description":"Social psychologist","whotheyare":"Adam Galinsky teaches people all over the world how to inspire others, speak up effectively, lead teams and negotiate successfully.","whylisten":"<p>Adam Galinsky is currently the chair of the management division at Columbia Business School. He co-authored the critically acclaimed and best-selling book, <em>Friend &amp; Foe<\/em>, which distills his two decades of research on leadership, negotiations, diversity, decision-making and ethics. The <em>New York Times<\/em> says the book performed &quot;a significant public service&quot; and the <em>Financial Times<\/em> declared that <em>Friend &amp; Foe<\/em>&nbsp;&quot;fulfills its promise of handing the reader tools to be a better friend and a more formidable foe.&quot;<\/p><p>Galinsky has received numerous national and international awards for his teaching and research. He is only the second psychologist to ever to receive the two most important mid-career Awards in Social Psychology. In 2015, he was named one of the top 50 Thinkers on Talent by Thinkers50. In recognition of the quality of his teaching and research, he was selected as one of the World&#39;s 50 Best B-School Professors by Poets and Quants (2012).&nbsp;<\/p><p>Galinsky has consulted with and conducted executive workshops for clients across the globe, including Fortune 100 firms, non-profits and local and national governments. He has served as a legal expert in multiple defamation lawsuits, including a trial where he was the sole expert witness for a plaintiff awarded $37 million in damages.&nbsp;<\/p><p>Outside of his professional life, Galinsky is the associate producer on four award-winning documentaries, including <em>Horns and Halos<\/em> and <em>Battle for Brooklyn<\/em>, which were both short-listed for Best Documentary at the Academy Awards.<\/p>","slug":"adam_galinsky","published_at":"2016-11-04 01:41:00","updated_at":"2018-08-30 19:27:01"}}