{"speaker":{"id":310,"title":"","firstname":"Lee","middleinitial":"","lastname":"Smolin","description":"Physicist","whotheyare":"Lee Smolin is a theoretical physicist, working mainly in the field of quantum gravity. He's a founding member of the Perimeter Institute for Theoretical Physics in Canada, and the author of The Trouble With Physics.","whylisten":"<p>Lee Smolin&#39;s bachelor&#39;s degree was in physics and philosophy -- twin passions that have complemented one another throughout his blazing career as a theoretical physicist. As <a href=\"http:\/\/www.thetroublewithphysics.com\/brief%20bio.html\" target=\"_blank\">his website bio<\/a>  is careful to state, &quot;<strong>His main contributions to research <em>so far<\/em> are to the field of quantum gravity.<\/strong>&quot; He&#39;s made contributions in many other fields, including cosmology, quantum mechanics, elementary particle physics and theoretical biology, and is the author of (among other books) <a href=\"http:\/\/www.thetroublewithphysics.com\/\" target=\"_blank\"><em>The Trouble With Physics<\/em><\/a>, a work that questions the very basis of the prevailing string theory.<\/p><p>Taking a step back from work on specific problems in physics, <strong>Smolin&#39;s work examines the scientific process itself and its place in the world<\/strong>. In all of his three books,&nbsp;<a href=\"http:\/\/geni.us\/3bQW\" target=\"_blank\"><em>Life of the Cosmos<\/em><\/a>,&nbsp;<a href=\"http:\/\/geni.us\/44i\" target=\"_blank\"><em>Three Roads to Quantum Gravity<\/em><\/a>&nbsp;and&nbsp;<em><a href=\"http:\/\/geni.us\/1j6L\" target=\"_blank\">The Trouble with Physics<\/a>,<\/em>&nbsp;he wrestles with the philosophical implications of what contemporary physics has shown us to be true. As we come to understand more about how the world works, he asks, how will our worldview change? <\/p><p>Smolin is a founding member of and a <a href=\"http:\/\/www.perimeterinstitute.ca\/index.phpindex.php?option=com_content&amp;task=view&amp;id=30&amp;Itemid=7&amp;view_directory=1&amp;pi=1010\" target=\"_blank\">researcher<\/a>  at the <a href=\"http:\/\/www.perimeterinstitute.ca\/index.php?lang=en\" target=\"_blank\">Perimeter Institute for Theoretical Physics<\/a>, in Ontario, Canada (whose Executive Director is 2008 TED Prize winner <a href=\"\/index.php\/speakers\/neil_turok.html\" target=\"_blank\">Neil Turok<\/a>).<\/p>","slug":"lee_smolin","published_at":"2008-11-09 14:19:00","updated_at":"2015-10-07 18:51:01"}}