{"speaker":{"id":3112,"title":"","firstname":"Abby","middleinitial":"","lastname":"Dobson","description":"Artist","whotheyare":"Passionate about using music as a tool for empathy cultivation, Abby Dobson creates music to inspire audiences to reflect on the world we live in and engage in action to promote transformative social change. ","whylisten":"<p>Abby Dobson is the 2016 artist-in-residence with the African American Policy Forum (AAPF). A sonic conceptualist artist, Dobson&#39;s sound is the alchemy of R&amp;B\/Soul, jazz, classic pop, gospel and folk, forging a gem that erases musical boundaries. Dobson has performed at venues such as S.O.B&#39;s, Kennedy Center Millennium Stage, Apollo Theater, Blue Note Jazz Club, Queens Museum and &quot;The Tonight Show.&quot; Her debut album,&nbsp;<em><a href=\"https:\/\/www.amazon.com\/Sleeping-Beauty-Have-Waiting-Volumood\/dp\/B004B4J57A\" target=\"_blank\">Sleeping Beauty: You Are the One You Have Been Waiting On<\/a>,<\/em>&nbsp;was released in 2010 to glowing reviews. Featured on Talib Kweli&rsquo;s album <em>Gravitas<\/em> on <em>State of Grace<\/em>, Dobson was also nominated for a 2014 BET Hip Hop Award for Best Impact Song.<\/p><p>Dobson received a Juris Doctorate degree from Georgetown University Law Center and a Bachelor&#39;s degree from Williams College in Political Science and History. Her interests have been deeply impacted by intersectionality discourse and critical race theory. An artist and independent scholar, Dobson&#39;s interests focus on the intersection of race and gender in the imagination, creation and consumption of music. A sampling of recent presentations include: International James Baldwin Conference at American University of Paris (2016), Association for the Study of African American History and Life Conference (2013-2015); Anna Julia Cooper Project at Tulane University (2013); and National Women&#39;s Studies Association (NWSA) Conference (2013).<\/p><p>Passionate about using music as a tool for empathy cultivation, Dobson creates music to inspire audiences to reflect on the world we live in and engage in action to promote transformative social change. She creates music to privilege black female voices and highlight the human condition. Inspired by AAPF&rsquo;s social justice work, Dobson composed and performs &quot;Say Her Name&quot; in tribute to the black women lost to state and non-state violence.<\/p><p>Dobson also volunteers with the National Organization for Women, NYC Chapter&#39;s Activist Alliance serving as a member of its Intersectionality Committee. She is currently wrapping up recording for <em>Sister Outsider<\/em>, the&nbsp;follow-up to her debut album, slated for release in 2017.<\/p>","slug":"abby_dobson","published_at":"2016-11-14 01:23:00","updated_at":"2016-11-14 16:25:04"}}