{"speaker":{"id":3113,"title":"","firstname":"Natalie","middleinitial":"","lastname":"Panek","description":"Rocket scientist, explorer","whotheyare":"Natalie Panek's work is focused on the idea that accountability for our environments never goes away.","whylisten":"<p>Natalie Panek&#39;s love of space and aviation led her to obtain a private pilot&#39;s license, design and drive a solar-powered car across North America, and build space robotics. She has participated in internships at NASA&#39;s Goddard Spaceflight Center and at NASA&#39;s Ames Research Center, where she worked on a mission to Mars. With degrees in mechanical and aerospace engineering, Panek has contributed to a number of space projects, including MDA&#39;s satellite servicing initiative and ESA&#39;s 2020 ExoMars rover program. She currently works in Mission Systems at MDA&#39;s robotics and automation division, on Canadian space robotics and other space exploration programs.<\/p><p>Panek founded her website,&nbsp;<a href=\"https:\/\/thepanekroom.com\/\" target=\"_blank\">thePanekRoom<\/a>, to encourage women to pursue challenging careers in nontraditional fields and explore the outdoors. She was featured on the editorial site &quot;Women You Should Know&quot; as a STEM Rock Star who is revolutionizing how we think about women in tech, and Canada&#39;s <em>Financial Post<\/em> describes Panek as &quot;a vocal advocate for women in technology.&quot; She is also a member of the prestigious Explorer&#39;s Club and a Fellow of Royal Canadian Geographic Society. PANEK is the 2013 recipient of the University of Calgary Graduate of the Last Decade Award and the Northern Lights Award Foundation&nbsp;<a href=\"http:\/\/www.northernlightsaward.ca\/risingstar_2013_recipient.html\" target=\"_blank\">2013 Rising Star<\/a>&nbsp;in aerospace. She also joins an elite group of women as one of WXN&#39;s Top 100 Most Powerful Women (2014), <em>Forbes<\/em>&#39; 30 Under 30 in Manufacturing and Industry (2015), Flare&#39;s inaugural 30 Under 30 list (2015) and one of Canada&#39;s Greatest Women Explorers by Canadian Geographic (2016).<\/p><p>(Photo: Genevi&egrave;ve Charbonneau)<\/p>","slug":"natalie_panek","published_at":"2016-11-18 17:18:00","updated_at":"2016-12-08 01:47:47"}}