{"speaker":{"id":3115,"title":"","firstname":"Carolyn","middleinitial":"","lastname":"Jones","description":"Photographic ethnographer","whotheyare":"Carolyn Jones creates projects that point our attention towards issues of global concern.","whylisten":"<p>Best known for her socially proactive photographs and documentary films, Carolyn Jones creates projects that point our attention towards issues of global concern. From people &quot;living positively&quot; with AIDS to women artisans supporting entire communities and nurses on the front lines of our health care system, Carolyn Jones has devoted her career to celebrating invisible populations and breaking down barriers.<\/p><p>Jones has spent the past five years interviewing more than 150 nurses from every corner of the US in an effort to better understand the role of nurses in this country&#39;s healthcare system. She published the critically-acclaimed book&nbsp;<a href=\"http:\/\/geni.us\/WA5eTY\" target=\"_blank\"><em>The American Nurse: Photographs and Interviews<\/em><\/a>&nbsp;by Carolyn Jones, for which she was interviewed on PBS NewsHour and featured in the <em>New York Times<\/em>, the <em>Washington Post<\/em> and <em>USA Today<\/em>. She directed and executive-produced the follow-up documentary film <em>The American Nurse: Healing America<\/em>, which was released in theaters nationwide and was an official selection of the 2015 American Film Showcase, a cultural diplomacy program of the US Department of State.<\/p><p>Jones has spent her career focused on telling personal stories, and her first introduction to nursing was through a very personal experience of her own, when it was a nurse who helped her get through breast cancer. That experience stuck with her, so when she started working on the American Nurse Project in 2011, she was determined to paint a rich and dynamic portrait of the profession. The goal was to cover as much territory as possible, with the hope that along the way she would capture stories touching on the kinds of issues that nurses are dealing with in every corner of the country. The project explores the American experiences of health care, poverty, childbirth, war, imprisonment and the end of life through the lens of nursing.<\/p><p>Prior to <em>The American Nurse<\/em>, her most widely acclaimed book,&nbsp;<a href=\"http:\/\/geni.us\/58SsAK6\" target=\"_blank\"><em>Living Proof: Courage in the Face of AIDS<\/em><\/a>, was published by Abbeville Press and was accompanied by shows in Tokyo, Berlin, the USA, and at the United Nations World AIDS Conference. In addition to her multiple exhibitions, book and magazine publications, Jones has collaborated on projects with Oxygen Media, PBS and the Girl Scouts of the USA. She founded the non-profit 100 People Foundation for which she travels the world telling stories that celebrate our global neighbors. As a lecturer, Jones has spoken at conferences, universities and events around the globe. In 2012 she was honored as one of 50 &quot;Everyday Heroes&quot; in the book of that title for her work with the 100 People Foundation.<\/p><p>Jones&#39; career was punctuated by two brushes with death: first, running out of gas in the Sahara as a racecar driver, and second, a breast cancer diagnosis. Her newest project, the forthcoming documentary&nbsp;<a href=\"http:\/\/hope.film\/\" target=\"_blank\"><em>Defining Hope<\/em><\/a>, is the culmination of a journey investigating how we can make better end-of-life choices.&nbsp;<\/p>","slug":"carolyn_jones","published_at":"2016-11-21 22:21:00","updated_at":"2017-05-08 15:02:19"}}