{"speaker":{"id":3168,"title":"","firstname":"Raj","middleinitial":"","lastname":"Panjabi","description":"Physician","whotheyare":"A billion people around the world lack access to health care because they live too far from a clinic. 2017 TED Prize winner Raj Panjabi aims to extend health services to the last mile.","whylisten":"<p>Raj Panjabi was nine when civil war broke out in his native country, Liberia. His family resettled in High Point, North Carolina, but he returned to Liberia as a medical student in 2005. He was shocked to find a health care system in total devastation. Only 50 doctors remained to treat a population of four million.<\/p>  <p>With a team of Liberian civil war survivors, American health workers and $6,000 he&#39;d received as a wedding gift, Panjabi co-founded&nbsp;<a href=\"http:\/\/lastmilehealth.org\/\" target=\"_blank\">Last Mile Health<\/a>. The organization saves lives in the world&#39;s most remote communities by partnering with governments to deploy, sustain and manage national networks of community health professionals. They currently support the Government of Liberia&#39;s deployment of more than 4,000 health workers to provide life-saving healthcare to 1.2 million people and protect against the next epidemic. Last Mile Health&#39;s network of community health workers can be leveraged in a crisis -- in the fight against Ebola, the organization aided government response by training health workers in southeastern Liberia.<\/p><p>Panjabi&nbsp;is a physician in the Division of Global Health Equity at Harvard Medical School, Brigham and Women&#39;s Hospital. He is a recipient of the Skoll Award for Social Entrepreneurship and was named to <em>TIME<\/em>&#39;s list of the &quot;100 Most Influential People in the World&quot;&nbsp;in 2016. As the&nbsp;<a href=\"https:\/\/go.ted.com\/CctC\" target=\"_blank\">winner of the 2017 TED Prize<\/a>, Panjabi is creating the&nbsp;<a href=\"http:\/\/lastmilehealth.org\/CHAcademy\/\" target=\"_blank\">Community Health Academy<\/a>, a global platform to train, connect and empower community health workers. The Academy aims to reinvent the education of community health workers -- and the leaders who support them -- for the digital age.<\/p>","slug":"raj_panjabi","published_at":"2016-11-28 20:39:00","updated_at":"2018-03-01 17:11:01"}}