{"speaker":{"id":3169,"title":"","firstname":"Jia","middleinitial":"","lastname":"Jiang","description":"Author, blogger, entrepreneur","whotheyare":"Jia Jiang's journey through rejection revealed a world hidden in plain sight, where people are much kinder than we imagine.","whylisten":"<p>Jia Jiang is the owner of&nbsp;<a href=\"http:\/\/rejectiontherapy.com\/\" target=\"_blank\">Rejection Therapy<\/a>, a website that provides inspiration, knowledge and products for people to overcome their fear of rejection. He is also the CEO of&nbsp;<a href=\"http:\/\/www.wujulearning.com\/\" target=\"_blank\">Wuju Learning<\/a>, a company that teaches people and trains organizations to become fearless through rejection training. In 2015, he authored a bestselling book,&nbsp;<a href=\"http:\/\/geni.us\/mFqe\" target=\"_blank\"><em>Rejection Proof: How I Beat Fear and Became Invincible Through 100 Days of Rejection<\/em><\/a>.<\/p><p>Several years after Jiang began his career in the corporate world, he took a life-altering risk and stepped into the unknown world of entrepreneurship. His result was everyone&#39;s biggest fear: rejection. This was the catalyst that set Jiang on the path to his true calling.<\/p><p>To conquer the fear of rejection, Jiang embarked on a personal quest and started a blog,&nbsp;<a href=\"http:\/\/rejectiontherapy.com\/100-days-of-rejection-therapy\/\" target=\"_blank\">100 Days of Rejection Therapy<\/a>. His journey revealed a world that was hidden in plain sight --&nbsp;a world where people are much kinder than we imagine. He discovered that rejection can be much less painful than we believe&nbsp;and that the fear of rejection is much more destructive than we know.<\/p><p>Jiang grew up in Beijing, China and migrated to the United States at age 16. He holds a Bachelor of Computer Science from Brigham Young University and a Master of Business Administration from Duke University.<\/p>","slug":"jia_jiang","published_at":"2016-11-30 17:10:00","updated_at":"2016-12-08 02:53:14"}}