{"speaker":{"id":3170,"title":"","firstname":"Veerle","middleinitial":"","lastname":"Provoost","description":"Bioethicist","whotheyare":"Veerle Provoost studies genetic and social parenthood in the context of donor conception.","whylisten":"<p>Veerle Provoost is a professor at the&nbsp;<a href=\"http:\/\/www.bioethics.ugent.be\/\" target=\"_blank\">Bioethics Institute Ghent<\/a>&nbsp;of Ghent University and a member of the&nbsp;<a href=\"http:\/\/www.familyethics.net\/\" target=\"_blank\">Network on Ethics of Families<\/a>. For her current research she coordinates a team of researchers who work on a study about genetic and social parenthood in the context of donor conception.<\/p><p>Using empirical research methods and Socratic conversation techniques, Provoost studies how professionals and ordinary people reason about health and how they make decisions in health-related contexts. In her courses on empirical research methods for ethics and bioethics, she teaches students how to look beyond mere experiences or general attitudes and to explore the principles and values that guide people&#39;s reasoning and decision-making. Her research shows that patients may bring their own sets of principles when making medical decisions, principles that may be very different from what medical staff anticipated and may feature around moral elements that may completely escape the attention of ethicists. For one, the moral reasoning of everyday people is centered more around relationships than around the principles that are at the core of scholarly bioethics.<\/p><p>In her talk TEDxGhent talk, she explains how we can gain valuable insights from families of children conceived with donor sperm and their views about what a family really is. These alternative families teach us what matters most in the decisions we all make for our children, whether or not they are genetically related to us. The parents and children she studied created their own family stories (about how their families were made) in highly diverse but very creative ways. However, some parents thought that they should strictly follow the advice of experts in their communication with their children. Because of that, they discounted their own competence. Based on her research experience, Provoost warns us for the negative effects of problematizing these families. Because no matter what a family looks like, or how it is made, parents should believe in their abilities and their creativity. As they know their families best, they are the real experts in how to find the best way to tell their own family story to their own child.<\/p>","slug":"veerle_provoost","published_at":"2016-12-02 23:04:00","updated_at":"2016-12-09 16:44:15"}}