{"speaker":{"id":3172,"title":"","firstname":"Rebecca","middleinitial":"","lastname":"Brachman","description":"Neuroscientist, writer, entrepreneur","whotheyare":"TED Fellow Dr. Rebecca Brachman is a pioneer in the field of preventative psychopharmacology, developing drugs to enhance stress resilience and prevent mental illness.","whylisten":"<p>Current treatments for mood disorders only suppress symptoms without addressing the underlying disease, and there are no known cures. The drugs Dr. Rebecca Brachman is developing would be the first to prevent psychiatric disorders such as post-traumatic stress disorder (PTSD) and depression.<\/p><p>Brachman is co-founder and director of the Social Outcomes Initiative -- a social impact organization that repurposes generic drugs for the treatment of PTSD, traumatic brain injury and other unmet medical needs -- and co-founder and Chief Scientific Officer at&nbsp;<a href=\"http:\/\/www.sunrise.bio\/\" target=\"_blank\">Sunrise<\/a>, a mission-driven initiative to cure, treat, and prevent depression.<\/p><p>Brachman obtained her PhD in Neuroscience from Columbia University, prior to which she was a fellow at the National Institutes of Health, where she discovered that immune cells carry a memory of psychological stress and that white blood cells can act as antidepressants and resilience-enhancers. She is a TED Fellow, NYCEDC Entrepreneurship Lab Fellow and member of the&nbsp;<a href=\"https:\/\/helena.co\/\" target=\"_blank\">Helena Brain Trust<\/a>. Brachman&#39;s research has been featured in <em>The Atlantic<\/em>, <em>WIRED<\/em> and <em>Business Insider<\/em>, and her work was recently described by Dr. George Slavich on NPR as a &quot;moonshot project that is very much needed in the mental health arena.&quot;<\/p><p>Brachman is also a playwright and screenwriter and previously served as the director of&nbsp;<a href=\"https:\/\/www.neuwrite.org\/\" target=\"_blank\">NeuWrite<\/a>, a national network of science-writing groups that fosters ongoing collaboration between scientists, writers, and artists.<\/p><p>(Photo: Kenneth Willardt)<\/p>","slug":"rebecca_brachman","published_at":"2016-12-08 19:49:00","updated_at":"2019-03-26 14:42:48"}}