{"speaker":{"id":3183,"title":"","firstname":"Zubaida","middleinitial":"","lastname":"Bai","description":"Women's health advocate","whotheyare":"Zubaida Bai innovates health and livelihood solutions for underserved women and girls around the world.","whylisten":"<p>Building on her expertise as a mechanical engineer, a social worker and her public speaking skills,&nbsp;<a href=\"http:\/\/www.zubaidabai.com\/\" target=\"_blank\">Zubaida Bai<\/a>&nbsp;put her unique passion to work. In the process, she built a brand and a product line, and she set in motion a movement that addresses market failures, breaks taboos and gives voice to the oft-ignored matter that is women&rsquo;s health.<\/p><p>Bai is the founder and CEO of&nbsp;<a href=\"http:\/\/www.ayzh.com\/\" target=\"_blank\">ayzh<\/a>&nbsp;(pronounced &quot;eyes&quot;), a social enterprise based in India that designs vital healthcare products to improve the health and happiness of women and girls across their reproductive lives. Bai launched her company with&nbsp;<a href=\"http:\/\/www.ayzh.com\/#janma-section\" target=\"_blank\"><em>janma<\/em><\/a>, a $3 clean birth kit in a purse, but her story goes further back to when she stood by her mother to face head-on the challenge of survival facing her family when she had just entered her teens.<\/p><p><span><em>janma<\/em><\/span>&nbsp;was conceived after traveling to one of the poorest communities in India and confronting the reality that more than one million mothers and babies lose their lives in the developing world each year due to uncleanliness at the time of childbirth. Packaged in a pink biodegradable jute bag, a design that mothers can reuse as a purse, the kit provides both cleanliness and dignity. Since beginning sales in 2012, Bai&#39;s company has sold more than 250,000 kits to more than 300 health institutions in 20 countries, touching the lives of more than 500,000 women and newborns. Bai is now expanding her product line to include kits for newborn, postpartum and menstrual health, while scaling her proven model across India and into Africa.<\/p><p>Bai was selected as a Young Global Leader by the World Economic Forum, a Maternal Health Champion by Ashoka, a TED speaker (Fellow and Resident) and the United Nations SDG Pioneer by the United Nations Global Compact (UNGC). ayzh&#39;s strategic partners from around the world who have written about Zubaida&#39;s work: TOMS shared her&nbsp;<a href=\"http:\/\/www.toms.com\/stories\/giving\/ayzh-founder-shares-her-safe-birth-story\" target=\"_blank\">safe birth story<\/a>; USAID blogged about how she&#39;s&nbsp;<a href=\"https:\/\/blog.usaid.gov\/2016\/03\/empowering-women-through-a-simple-purse\/\" target=\"_blank\">empowering women through a simple purse<\/a>; and Grand Challenges Canada recognizes her lead role in scaling&nbsp;<a href=\"http:\/\/www.grandchallenges.ca\/grantee-stars\/0607-05\/\" target=\"_blank\">life-changing kits for mothers and newborns<\/a>.<\/p><p>Bai believes that building a sustainable company takes a great team, stamina and a sturdy suitcase. She is fluent in eight languages and travels the world forging new partnerships and advocating for women&#39;s health. She has spoken at events for&nbsp;<a href=\"http:\/\/nytlive.nytimes.com\/womenintheworld\/2016\/04\/08\/pregnant-women-have-one-foot-in-the-grave-four-women-reducing-maternal-mortality\/\" target=\"_blank\">Women in the World<\/a>, Pfizer Foundation and Women Deliver. She holds a master&#39;s degree in mechanical engineering specializing in development of modular products, and an MBA in social and sustainable enterprises.<\/p>","slug":"zubaida_bai","published_at":"2016-12-12 18:04:00","updated_at":"2017-04-13 18:05:36"}}