{"speaker":{"id":3186,"title":"","firstname":"Marlon","middleinitial":"","lastname":"Peterson","description":"Human justice advocate","whotheyare":"Marlon Peterson is a writer, youth development expert and human justice advocate.","whylisten":"<p>Marlon Peterson is the host of the podcast,&nbsp;<a href=\"http:\/\/www.marlonpeterson.com\/\" target=\"_blank\">Decarcerated<\/a>, which highlights the journeys of resilience, redemption and success of formerly incarcerated people.<\/p><p>Since his release from prison in 2009, after serving 10 years, Peterson has spearheaded the creation of two youth development programs in New York City, How Our Lives Link Altogether (H.O.L.L.A!) and Youth Organizing to Save Our Streets (YO SOS). With a focus on gun violence prevention and youth advocacy, both programs have provided programming for hundreds of young people.<\/p><p>In 2015 Peterson&nbsp;left his full-time work in the nonprofit sector to create The Precedential Group, a social justice consultancy that works to address the trauma revolving around the intersections of race, gender, violence, police violence and community violence. His work through the Precedential Group has allowed him to provide support for organizations throughout the United States and Trinidad &amp; Tobago, W.I.<\/p><p>As a writer, advocate, program developer and public speaker Peterson has been recognized as a Soros Justice Fellow, Aspen Ideas Festival Scholar, Ebony Magazine Power 100 Honoree and TED Resident. His writings have appeared and been cited in The Nation, Gawker, The Atlantic, Huff Post, Black Press USA, Ebony and the Trinidad &amp; Tobago Guardian. He has contributed to Kiese Laymon&#39;s aaward-winning novel, <em>How to Slowly Kill Yourself and Others in America<\/em>&nbsp;and <em>Love Lives Here, Too<\/em> by former <em>New York Times<\/em> columnist, Sheila Rule.<\/p><p>Peterson is Brooklyn born and bred with a Trinidadian heart. He is a graduate of New York University and is currently working on his first Pulitzer, a memoir.<\/p>","slug":"marlon_peterson","published_at":"2016-12-12 18:04:00","updated_at":"2017-05-31 14:38:29"}}