{"speaker":{"id":3194,"title":"","firstname":"James","middleinitial":"","lastname":"Beacham","description":"Experimental particle physicist","whotheyare":"James Beacham is an experimental high-energy particle physicist working with the ATLAS collaboration at CERN's Large Hadron Collider.","whylisten":"<p>As part of the ATLAS collaboration at CERN&#39;s Large Hadron Collider, one of the teams that discovered the Higgs boson in 2012, James Beacham&nbsp;is on the hunt for evidence of new particles -- dark photons, gravitons, dark matter and exotic Higgs bosons among them.<\/p><p>Previously, Beacham&nbsp;was part of a small team of researchers who, in 2009, searched for the Higgs boson in an unlikely place: data taken by the ALEPH experiment at CERN&#39;s Large Electron-Positron collider, nine years after it had stopped running. He has also worked with the APEX collaboration, a groundbreaking search for dark photons using existing particle physics facilities designed for very different purposes.<\/p><p>Beacham completed his PhD at New York University in 2014 and is currently a post-doctoral researcher with the ATLAS experiment group of the Ohio State University. He has been a guest on NPR&#39;s &quot;Science Friday,&quot; participated in documentaries on the BBC and the Discovery Channel and talked particle physics with the <em>New York Times<\/em> and <em>WIRED<\/em>.<\/p><p>In addition to his ongoing research, Beacham is dedicated to making particle physics accessible to all. He has communicated science to the public with <em>Symmetry<\/em> Magazine, US\/LHC, the Science Museum in London, the Institute of Physics, the World Science Fair and on the Web.<\/p><p>In 2015, Beacham organized&nbsp;<a href=\"http:\/\/exnoisecern.ch\/\" target=\"_blank\">Ex\/Noise\/CERN<\/a>, a project colliding particle physics with experimental music to celebrate the LHC&rsquo;s switch on to 13 trillion electron volts.<\/p>","slug":"james_beacham","published_at":"2016-12-14 22:26:00","updated_at":"2016-12-22 16:46:40"}}