{"speaker":{"id":3202,"title":"","firstname":"David","middleinitial":"","lastname":"Autor","description":"Economist","whotheyare":"David Autor's work assesses the labor market consequences of technological change and globalization.","whylisten":"<p>David Autor, one of the leading labor economists in the world and a member of the American Academy of Arts and Sciences, is Ford Professor of Economics and associate department head of the Massachusetts Institute of Technology Department of Economics. He is also Faculty Research Associate of the National Bureau of Economic Research, Research Affiliate of the Abdul Jameel Latin Poverty Action Lab, Co-director of the MIT School Effectiveness and Inequality Initiative, Director of the NBER Disability Research Center and former editor in chief of the Journal of Economic Perspectives. He is an elected officer of the American Economic Association and the Society of Labor Economists and a fellow of the Econometric Society.<\/p><p>Autor&#39;s work focuses on earnings inequality, employment and feedback between labor market opportunities, household structure and the social\/intellectual development of children. He has published extensively in many major academic journals in economics.&nbsp;His best known research formally models and empirically analyzes how computerization substitutes for and complements human labor; asks how the rapid rise of import competition from China has reshaped U.S. manufacturing, upending the conventional economic wisdom that free trade is a free lunch; explores how the economic pressures of globalization are reshaping U.S. electoral politics; and conducts large-scale randomized experiments that test whether generous financial aid grants improve the odds of college completion and long-run economic security of students from low income families.&nbsp;<\/p><p>Autor has received a number of prestigious prizes, the Alfred P. Sloan Foundation Fellowship, the National Science Foundation Career award, and the Sherwin Rosen Prize for outstanding contributions in the field of Labor Economics, and the John T. Dunlop Outstanding Scholar Award in 2006 given by the Labor and Employment Relations Association, to name just a few. His teaching has earned several awards, including MIT&rsquo;s James A. and Ruth Levitan Award for excellence in teaching, the Undergraduate Economic Association Teaching Award, and the Technology and Public Policy Program&rsquo;s Best Professor Award.<\/p>","slug":"david_autor","published_at":"2016-12-16 20:41:00","updated_at":"2016-12-19 16:00:42"}}