{"speaker":{"id":3228,"title":"","firstname":"Sofia","middleinitial":"","lastname":"Jawed-Wessel","description":"Sex researcher","whotheyare":"Sofia Jawed-Wessel's teachings utilize a sex-positive and pleasure-inclusive approach to providing medically accurate, comprehensive sexuality education.","whylisten":"<p>Dr. Sofia Jawed-Wessel teaches and generates new knowledge in the area of public health through scientific studies. Her research has focused on understanding and improving the sexual health of women and couples as they transition into parenthood by documenting sexual behaviors, sexual function, relationship adjustment and overall sexual changes during pregnancy and after childbirth. Jawed-Wessel&#39;s teachings utilize a sex-positive and pleasure-inclusive&nbsp;approach to providing medically accurate, comprehensive sexuality education to undergraduate students as well as in the local Omaha, Nebraska community. She teaches graduate level courses such as Research Methods, Health Behavior Theory, and Leadership and Advocacy. Jawed-Wessel also fights for women&#39;s rights and reproductive justice. She has provided expert testimony for the Nebraska Unicameral, the Nebraska School Board of Education and the Omaha Public School Board of Education. She has successfully argued in favor of comprehensive sex education in Omaha Public Schools and fought against restrictive anti-choice legislation in Nebraska.<\/p><p>Jawed-Wessel is an Assistant Professor in the School of Health, Physical Education and Recreation at the University of Nebraska at Omaha (UNO) and the Associate Director of the Midlands Sexual Health Research Collaborative. She also holds a joint appointment with the Women and Gender Studies program at UNO and a courtesy appointment in the College of Public Health at the University of Nebraska Medical Center. Jawed-Wessel holds both a Master of Science in Public Health (MPH) degree and a Doctor of Philosophy (PhD) degree in Health Behavior from the School of Public Health at Indiana University Bloomington.&nbsp;<\/p><div><br \/><\/div>","slug":"sofia_jawed_wessel","published_at":"2016-12-21 22:26:00","updated_at":"2017-01-06 16:18:23"}}