{"speaker":{"id":3229,"title":"","firstname":"Deeyah","middleinitial":"","lastname":"Khan","description":"Filmmaker","whotheyare":"Deeyah Khan is working to create intercultural dialogue and understanding by confronting the world's most complex and controversial topics.","whylisten":"<p>Deeyah Khan is an Emmy and Peabody award-winning documentary film director and founder of&nbsp;<a href=\"http:\/\/fuuse.net\/\" target=\"_blank\">Fuuse<\/a>, a media and arts company that puts women, people from minorities and third-culture kids at the heart of telling their own stories. In 2016, Khan became the first UNESCO Goodwill Ambassador for artistic freedom and creativity. She has received many honors for her work supporting freedom of expression, human rights and peace, including the Ossietzky Prize, the University of Oslo&#39;s Human Rights Award and the Peer Gynt Prize from the Parliament of Norway.<\/p><p>Born in Norway to immigrant parents of Pashtun and Punjabi ancestry, Khan&#39;s experience of living between different cultures, both the beauty and the challenges, shapes her artistic vision. Her 2012 multi-award winning documentary,&nbsp;<a href=\"http:\/\/fuuse.net\/banaz-a-love-story\/\" target=\"_blank\"><em>Banaz: A Love Story<\/em><\/a><em>,<\/em> chronicles the life and death of Banaz Mahmod, a young British Kurdish woman murdered by her family in a so-called honor killing. Khan&#39;s second film, the Grierson and Bafta award-nominated&nbsp;<a href=\"http:\/\/fuuse.net\/jihad-a-story-of-the-others\/\" target=\"_blank\"><em>Jihad<\/em><\/a>, involved two years of interviews and filming with Islamic extremists, convicted terrorists and former jihadis. One of Fuuse&#39;s recent initiatives, born of Deeyah&rsquo;s own experiences, is&nbsp;<a href=\"http:\/\/www.sister-hood.com\/\" target=\"_blank\">sister-hood<\/a>, a digital magazine and series of live events spotlighting the voices of women of Muslim heritage. Khan has also produced a number of critically acclaimed albums, including <em>Listen to the Banned<\/em>, a compilation that brought together musicians from around the world who have been subject to persecution, &#39;censorship and imprisonment.<\/p><p>The focus of Khan&#39;s work and access to voices that are often overlooked and misunderstood has led to increasing demand as a speaker at international human rights events and platforms including the United Nations. She was described by <em>The Times<\/em> of London thus: &quot;To say Deeyah Khan is an inspiration is an understatement. She is one of the bravest, most indomitable women &hellip; facing down bullies and extremists with intelligence and unflinching spirit.&quot;<\/p><p>(Photo: Geir Dokken)<\/p>","slug":"deeyah_khan","published_at":"2017-01-04 17:19:00","updated_at":"2017-01-26 16:02:07"}}