{"speaker":{"id":3230,"title":"","firstname":"Alejandro","middleinitial":"","lastname":"Sánchez Alvarado","description":"Developmental and regeneration biologist","whotheyare":"Alejandro Sánchez Alvarado wants to understand the how and why of tissue regeneration. ","whylisten":"<p>Alejandro S&aacute;nchez Alvarado is fascinated by the fact that the natural ability to restore missing body parts after injury is broadly yet unevenly distributed across the animal kingdom. Why, for instance, can snails grow new heads after decapitation, or salamanders sprout new limbs, tails, even hearts after amputation, while we humans are so impoverished when it comes to these regenerative abilities? To attack this problem Alvarado, his team and his trainees have collectively developed methods and approaches to dissect this problem at unprecedented levels of molecular, genetic and cellular resolution.<\/p><p>Alvarado runs a&nbsp;<a href=\"http:\/\/www.hhmi.org\/\" target=\"_blank\">Howard Hughes Medical Institute<\/a>&nbsp;laboratory at the&nbsp;<a href=\"http:\/\/www.stowers.org\/\" target=\"_blank\">Stowers Institute for Medical Research<\/a>&nbsp;in Kansas City, Missouri, where he is an Investigator. Alejandro and his team of researchers are vigorously dissecting the problem of regeneration using state-of-the-art nucleic acid sequencing, genomic, proteomic, bioinformatics, light and electron microscopy, flow cytometric and histological methods. Their efforts are centered around the flatworm&nbsp;<a href=\"http:\/\/smedgd.stowers.org\/\" target=\"_blank\"><em>Schmidtea mediterranea<\/em><\/a>, an organism with astonishing regenerative capacities. Small fragments of tissue removed from these animals, for instance, can regenerate complete animals in under two weeks. The basic, discovery research efforts of Alvarado&nbsp;and his team have begun to shed much mechanistic light into the long-standing biological problem of regeneration, and they are poised to inform poorly understood aspects of our own biology.&nbsp;<\/p><p>Alvarado, a member of the&nbsp;<a href=\"https:\/\/www.amacad.org\/\" target=\"_blank\">American Academy of Arts and Sciences<\/a>, has grown concerned with the current approach of biomedical research of focusing the brunt of its efforts on a handful of randomly selected species. He believes this approach is preventing us from uncovering huge amounts of unknown and relevant biology to understand our own. As <em>Quanta<\/em> Magazine wrote &quot;Some scientists &hellip; argue that by focusing on roughly seven animals out of the estimated 9 million species on Earth, we are missing a huge chunk of interesting biology. &#39;We are due for a renaissance,&#39; said Alejandro S&aacute;nchez Alvarado. &#39;We have narrowed our focus to a handful of organisms that statistically are highly unlikely to encompass the gamut of biological activity on the planet.&#39;&quot;<\/p><div><br \/><\/div>","slug":"alejandro_sanchez_alvarado","published_at":"2017-01-06 18:22:00","updated_at":"2017-01-12 16:20:35"}}