{"speaker":{"id":3238,"title":"","firstname":"Lara","middleinitial":"","lastname":"Setrakian","description":"Journalist","whotheyare":"Lara Setrakian is building innovative news platforms that stand ready to engage and explain the complexity of our world.","whylisten":"<p>Lara Setrakian is the co-founder and CEO of&nbsp;<a href=\"https:\/\/www.newsdeeply.com\/\" target=\"_blank\">News Deeply<\/a>, a startup that creates news platforms and builds passionate communities centered on the most pressing issues of our time. Her team&#39;s inaugural site,&nbsp;<a href=\"https:\/\/www.newsdeeply.com\/syria\" target=\"_blank\">Syria Deeply<\/a>, launched in 2012 and won the 2013 Excellence in Online Journalism Award from the National Press Foundation. The team went on to launch&nbsp;<a href=\"http:\/\/www.eboladeeply.org\/\" target=\"_blank\">Ebola Deeply<\/a>,&nbsp;<a href=\"https:\/\/www.newsdeeply.com\/water\" target=\"_blank\">Water Deeply<\/a>,&nbsp;<a href=\"https:\/\/www.newsdeeply.com\/arctic\" target=\"_blank\">Arctic Deeply<\/a>,&nbsp;<a href=\"https:\/\/www.newsdeeply.com\/refugees\" target=\"_blank\">Refugees Deeply<\/a>&nbsp;and the&nbsp;<a href=\"https:\/\/www.newsdeeply.com\/womenandgirls\" target=\"_blank\">Women &amp; Girls Hub<\/a>; the model is expanding to cover new topics in environment, public health, geopolitics and social impact. Each site is staffed by beat reporters and editors with substantial experience of the subjects they cover&nbsp;and augmented by a network of contributors, commentators and area experts who share their perspectives.<\/p><p>A hard-edged optimist, Lara believes in building innovative news platforms that are rooted in public service, that stand ready to engage and explain the complexity of our world. She also believes that there are successful media business models to be built -- ones that capturing the value of specialized information and the power of targeted reader communities. By fusing news and community, journalism and product design, she is developing a way to sustain in-depth and continuous coverage of vital issues. In light of that work Inc Magazine called her one of &quot;8 Women Who Could Own the Future,&quot; while Fast Company named her one of the &quot;Most Creative People in Business.&quot;&nbsp;<\/p><p>Before starting News Deeply, Setrakian&nbsp;was Middle East correspondent for ABC News and Bloomberg Television. She grew up in New Jersey, the daughter of hard-working Armenian-Americans who raised her to value grit, resilience, and resolve. To document News Deeply&#39;s journey and lessons from other great startups in the trenche she coauthored a&nbsp;<a href=\"http:\/\/towcenter.org\/research\/seeking-the-single-subject-news-model\/\" target=\"_blank\">study of single-subject news models<\/a>&nbsp;as part of a fellowship at Columbia University&#39;s Tow Center for Digital Journalism. Her work at News Deeply has been featured in&nbsp;<a href=\"https:\/\/www.fastcompany.com\/3003585\/syria-deeply-outsmarts-news-redefines-conflict-coverage\" target=\"_blank\"><em>Fast Company<\/em><\/a>,&nbsp;<a href=\"http:\/\/mashable.com\/2016\/03\/21\/lara-setrakian-refugees-news-deeply\/\" target=\"_blank\">Mashable<\/a>,&nbsp;<a href=\"http:\/\/www.inc.com\/spencer-bokat-lindell\/this-former-business-analyst-is-changing-the-face-of-online-journalism.html\" target=\"_blank\">Inc<\/a>,&nbsp;TechCrunch, the <em>New York Times<\/em>, the <em>Wall Street Journal<\/em>, ABC News, NPR and CNN.<\/p>","slug":"lara_setrakian","published_at":"2017-01-24 21:08:00","updated_at":"2017-02-15 16:04:05"}}