{"speaker":{"id":3248,"title":"","firstname":"Nagin","middleinitial":"","lastname":"Cox","description":"Spacecraft operations engineer","whotheyare":"Nagin Cox explores Mars as part of the team that operates NASA's rovers.","whylisten":"<p>Nagin Cox has been exploring since she decided as a teenager that she wanted to work at NASA&#39;s Jet Propulsion Laboratory. She was born in Bangalore, India, and grew up in Kansas City, Kansas, and Kuala Lumpur, Malaysia. Her experiences as a child in a Muslim household showed her how easily we separate ourselves based on gender, race or nationality, and it inspired her to do something that brings people together instead of dividing them. The Space Program helps the world &quot;look up&quot; and remember that we are one world. Thus, she has known from the time she was 14 years old that she wanted to work on missions of robotic space exploration. &nbsp;<\/p><p>Cox realized her childhood dream and has been a spacecraft operations engineer at NASA\/JPL for over 20 years. She has held leadership and system engineering positions on interplanetary robotic missions including the Galileo mission to Jupiter, the Mars Exploration Rovers, the Kepler exoplanet hunter, InSight and the Mars Curiosity Rover.<\/p><p>In 2015, Cox was honored as the namesake for Asteroid 14061 by its discovers. She has also received the NASA Exceptional Service Medal and two NASA Exceptional Achievement Medals. She is a U.S. Department of State STEM Speaker and has spoken to audiences around the world on the stories of the people behind the missions. She has also served on Cornell University&rsquo;s President&#39;s Council for Cornell Women.<\/p><p>Before her time at JPL, Cox served for 6 years in the US Air Force including duty as a Space Operations Officer at NORAD\/US Space Command. She holds engineering degrees from Cornell University and the Air Force Institute of Technology as well as a psychology degree from Cornell. (Sometimes she is not sure which one she uses more: the engineering degree or the psychology degree.)<\/p><p>Cox is currently a Tactical Mission Lead on the Curiosity Rover, and every day at NASA\/JPL exploring space is as rewarding as the first. You can contact her at nagincox(at)outlook.com.<\/p>","slug":"nagin_cox","published_at":"2017-01-27 20:05:00","updated_at":"2021-09-20 20:08:43"}}