{"speaker":{"id":3249,"title":"","firstname":"Eduardo","middleinitial":"","lastname":"Briceño","description":"Learning expert","whotheyare":"Eduardo Briceño is a learner, leader, speaker and writer devoted to enabling a more learning-oriented world.","whylisten":"<p>Eduardo Brice&ntilde;o leads&nbsp;<a href=\"https:\/\/www.mindsetworks.com\/\" target=\"_blank\">Mindset Works<\/a>, the leading provider of growth mindset development services and programs for schools and businesses. The company helps organizations cultivate learning-oriented cultures and systems. Brice&ntilde;o&nbsp;started Mindset Works in 2007 with the foremost growth mindset researcher, Carol Dweck, PhD, and education expert Lisa Blackwell, PhD. Prior to his current role, he was a Principal at the Sprout Group, a venture capital firm in Silicon Valley.<\/p><p>Brice&ntilde;o is a frequent keynote speaker at leading conferences and facilitates workshops at in-house convenings for professionals and executives. His two TEDx talks, &quot;<a href=\"https:\/\/www.youtube.com\/watch?v=pN34FNbOKXc\" target=\"_blank\">The power of belief<\/a>&quot;&nbsp;and &quot;<a href=\"\/talks\/eduardo_briceno_how_to_get_better_at_the_things_you_care_about\" target=\"_blank\">How to get better at the things you care about<\/a>,&quot;&nbsp;have each been viewed more than three million times. He is a Pahara-Aspen Fellow, a member of the Aspen Institute&rsquo;s Global Leadership Network and an inductee in the Happiness Hall of Fame. He has been featured and quoted in prominent media outlets and in the documentaries <em>The Process<\/em> and <em>Rise: Voice of a New Generation<\/em>.<\/p><p>Brice&ntilde;o grew up in Caracas, Venezuela, and he now lives with his wife in San Jose, California. He holds Bachelor&#39;s degrees in economics and engineering from the University of Pennsylvania, as well as an MBA and an MA in Education from Stanford University. Most importantly, he continues to enjoy lifelong learning every day.<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>","slug":"eduardo_briceno","published_at":"2017-01-27 23:29:00","updated_at":"2019-04-24 16:56:58"}}