{"speaker":{"id":3252,"title":"","firstname":"Margaret","middleinitial":"","lastname":"Bourdeaux","description":"Physician, global health policy analyst","whotheyare":"Margaret Bourdeaux investigates the best ways to protect, recover and reconstruct health systems and institutions disrupted by war or disaster.","whylisten":"<p>Margaret Ellis Bourdeaux, MD, MPH spearheads the Threatened Health Systems Project at Harvard Medical School -- an initiative that brings together public sector leaders, health care providers, academics, military strategists and private sector stakeholders to generate creative approaches to protecting valuable health system resources in countries affected by armed conflict and acute political crisis.<\/p><p>Bourdeaux&#39;s journey in global health began when she took a year of leave from Yale Medical School to work in refugee camps during the Kosovo War in 1999. She returned on her own after the war to trace families she had befriended in the camps and find out what had happened to them. Living in villages of Kosovo&#39;s countryside, she documented how these families struggled to care for their children, find health services and make a living in a society decimated by genocide and ethnic conflict. This experience impressed upon her the stark truth that war kills people by stripping them of their personal, community and national resources and institutions. Far more people died in Kosovo from the depleted health systems and institutions than from wounds sustained during the armed conflict.<\/p><p>Later experiences in Haiti, Afghanistan, Libya, Sierra Leon, Madagascar and Liberia revealed a similar pattern: armed conflict would decimate indigenous health institutions that never recovered, leaving people helpless when later crises -- earthquakes, epidemics, renewed conflict -- invariably struck. Strong, resilient health systems are the key to making war, disasters and epidemics less deadly.<\/p><p>After completing a joint residency in Internal Medicine and Pediatrics at the Harvard Combined Med\/Peds Program, Bourdeaux was among the first graduates of Brigham and Women&#39;s Global Women&#39;s Health Fellowship. She has worked with the Office of the Secretary of Defense Policy to analyze the US Department of Defense&rsquo;s global health projects and programs. She led a joint Harvard-NATO team of analysts to evaluate the impacts, challenges and opportunities international security forces have in protecting and rebuilding health systems in conflict affected states. She joined the faculty of the Division of Global Health Equity at Brigham and Women&rsquo;s Hospital and Harvard Medical School in 2011.<\/p><p>This year she was awarded the prestigious Harvard Global Health Institute&#39;s Burke Fellowship in Global Health to investigate the responsiveness of foreign aid to health system distress and disruption. She is co-developing the first executive education course between Harvard Medical School and Harvard Kennedy School of Government for senior security policy makers on health system threat detection and response. In addition, she is launching Harvard Global Health Institute&#39;s first Summit on Threatened Health Systems in June 2017.<\/p>","slug":"margaret_bourdeaux","published_at":"2017-02-09 16:53:00","updated_at":"2017-03-22 17:41:13"}}