{"speaker":{"id":3262,"title":"","firstname":"Michael","middleinitial":"","lastname":"Botticelli","description":"Drug policy expert","whotheyare":"As Director of National Drug Control Policy, Michael Botticelli led the Obama Administration’s drug policy efforts to diminish the consequences of substance use through evidence-based prevention, treatment and recovery support services.","whylisten":"<p>Michael Botticelli was sworn in as Director of National Drug Control Policy at the White House on February 11, 2015, after being unanimously confirmed by the Senate. He joined the White House Office of National Drug Control Policy (ONDCP) as Deputy Director in November 2012 and later served as Acting Director. He is currently the Executive Director of the Grayken Center for Addiction Medicine at Boston Medical Center and also a Distinguished Policy Scholar at the Johns Hopkins Bloomberg School of Public Health in Baltimore.<\/p><p>As Director of National Drug Control Policy, Botticelli led the Obama Administration&#39;s drug policy efforts, which are based on a balanced public health and public safety approach. The Administration advanced historic drug policy reforms and innovations in prevention, criminal justice, treatment and recovery.<\/p><p>In response to the national opioid epidemic, Botticelli coordinated actions across the Federal government to reduce prescription drug abuse, heroin use and related overdoses. These include supporting community-based prevention efforts; educating prescribers and the public about preventing prescription drug abuse; expanding use of the life-saving overdose-reversal drug naloxone by law enforcement and other first responders; and increasing access to medication-assisted treatment and recovery support services to help individuals sustain their recovery from opioid use disorders.<\/p><p>Botticelli has more than two decades of experience supporting Americans affected by substance use disorders. Prior to joining ONDCP, he served as Director of the Bureau of Substance Abuse Services at the Massachusetts Department of Public Health, where he successfully expanded innovative and nationally recognized prevention, intervention, treatment and recovery services for the Commonwealth of Massachusetts. He also forged strong partnerships with local, state and Federal law enforcement agencies; state and local health and human service agencies; and stakeholder groups to guide and implement evidence-based programs.<\/p><p>Botticelli has served in a variety of leadership roles for the National Association of State Alcohol and Drug Abuse Directors. He was a member of the Advisory Committee for the Substance Abuse and Mental Health Services Administration&#39;s Center for Substance Abuse Prevention and the National Action Alliance for Suicide Prevention. He has also co-authored many peer-reviewed articles that have significantly contributed to the field.<\/p><p>Born in Upstate New York, Botticelli holds a Bachelor of Arts degree from Siena College and a Master of Education degree from St. Lawrence University. He is also in long-term recovery from a substance use disorder, celebrating more than 28 years of recovery.<\/p>","slug":"michael_botticelli","published_at":"2017-02-15 16:35:00","updated_at":"2017-03-29 14:44:28"}}