{"speaker":{"id":3263,"title":"","firstname":"Nabila","middleinitial":"","lastname":"Alibhai","description":"Place-maker","whotheyare":"Nabila Alibhai leads inCOMMONS, a new cultural production lab focused on invigorating public spaces and inspiring collective responsibility for our cultural and environmental heritage.","whylisten":"<p>Nabila Alibhai is the founder of inCOMMONS, an organization that develops and invigorates public spaces and builds collective leadership. inCOMMONS&#39;s New York-based sister company, limeSHIFT, uses the same principles and embeds artists into workplaces to make them more happy, purposeful and creative. She recently authored &quot;<a href=\"http:\/\/www.welltoldstory.com\/how-spectacular-public-art-can-heal-division-and-unite-communities\/\" target=\"_blank\">How Colour Replaces Fear<\/a>,&quot; a chapter in the book&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/B0725RPHRY\/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;tag=teco06-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=B0725RPHRY&amp;linkId=13607b21c6546789249db154287b92e9\" target=\"_blank\"><em>Art &amp; The City<\/em><\/a>, about art that heals divisions and unites communities.<\/p><p>Currently, inCOMMONS&#39;s main projects are&nbsp;<a href=\"http:\/\/www.colourinfaith.com\/\" target=\"_blank\">Colour in Faith<\/a>, a neighborhood solidarity project through art; building an inclusive sculptural space with Nairobi City County; experimenting with art and healing; and looking for partners to create urban sweet spaces for our greatest gardeners: (pollinators) bees, hummingbirds and butterflies. limeSHIFT is working with New York City&#39;s Carnegie Hall on a traveling installation called&nbsp;<a href=\"http:\/\/espejismo.art\/\" target=\"_blank\">Espejismo<\/a>.<\/p><p>Alibhai had a 13-year career working on different aspects of conflict transformation from communications to health and resilience. She has worked on projects in Afghanistan, Pakistan, Kenya, Tanzania, the United States and Switzerland. She has held positions in the Aga Khan Development Network, the United Nations and the International Organization for Migration. As a Research Fellow in MIT&#39;s Special Program for Urban and Regional Studies, she advanced her efforts to influence health, security and community solidarity through public spaces. She is now based in her home country of Kenya.&nbsp;<\/p><p>&nbsp;<\/p>","slug":"nabila_alibhai","published_at":"2017-02-17 17:17:00","updated_at":"2017-09-26 17:45:38"}}