{"speaker":{"id":3264,"title":"","firstname":"Washington","middleinitial":"","lastname":"Wachira","description":"Wildlife ecologist, nature photographer and safari guide","whotheyare":"Birder and ecologist Washington Wachira started the Youth Conservation Awareness Programme to nurture young environmental enthusiasts in Kenya.","whylisten":"<p>If you take a walk, the animals you&#39;re most likely see are birds. Birds are some of the most fascinating creatures on earth. We wake up to their songs in the morning; they&#39;re in our cities, farms and even schools. They are, however, facing many challenges, and we should do something to help them.<\/p><p>By age 14, Washington Wachira was already on a career path towards nature interpretation and conservation. Wachira holds a BSc in environmental science and is currently taking an MSc animal ecology from <a href=\"http:\/\/ku.ac.ke\/\">Kenyatta University<\/a>. Washington founded <a href=\"http:\/\/www.ycap.or.ke\/\">Youth Conservation Awareness Programme (YCAP)<\/a>&nbsp;to nurture young environmental enthusiasts in Kenya. He is a keen writer and has published multiple articles in a variety of local and international publications. As a result of his conservation passion, he has won many awards including Mr. Environment and Ambassador for Nairobi Province in 2012 and The Daisy Rothschild Award in 2015. He is a passionate and talented nature photographer featured in many publications worldwide. He has won multiple photo awards including the first position in the underwater category of the 2016 East African Wild Life Photo Competition and Honourable Mention in the Best of Nikon Kenya 2016 Photography Competition.<\/p><p>Wachira is an experienced safari guide and has led many expeditions and research projects across Kenya. He founded&nbsp;<a href=\"https:\/\/www.cisticolatours.com\/\" target=\"_blank\">Cisticola Tours<\/a>, a tour company that leads professional birding and nature tours across Kenya and the rest of East Africa. Through Cisticola Tours, he has been leading multiple&nbsp;<a href=\"http:\/\/www.cisticolatours.com\/sustainability-and-conservation\/\" target=\"_blank\">sustainability projects<\/a>&nbsp;to support bird conservation and help communities to appreciate birds and nature. He is also a member of the Bird Committee of Nature Kenya, Chair of the National Bird of Kenya Sub-committee, the Country Representative for Kenya at Youth Africa Birding and Manager for the&nbsp;<a href=\"http:\/\/kenyabirdmap.adu.org.za\/\">Kenya Bird Map Project<\/a>. He is a National Geographic Explorer for his work with African Crowned Eagles, and he is a&nbsp;birds&nbsp;of prey graduate student with&nbsp;<a href=\"https:\/\/peregrinefund.org\/\">The Peregrine Fund<\/a>.<\/p>      ","slug":"washington_wachira","published_at":"2017-02-17 17:18:00","updated_at":"2017-11-06 20:34:42"}}