{"speaker":{"id":3286,"title":"","firstname":"Stephanie","middleinitial":"","lastname":"Busari","description":"Journalist","whotheyare":"Stephanie Busari is a journalist and editor at CNN International Digital.","whylisten":"<p>Stephanie Busari moved to Lagos from London in July 2016 to pioneer CNN&#39;s first digital and multimedia bureau. She also reports on-air in breaking news situations for CNN International.<\/p><p>In April 2016 Busari exclusively obtained the&nbsp;<a href=\"http:\/\/edition.cnn.com\/2016\/04\/13\/africa\/chibok-girls-new-proof-of-life-video\/\" target=\"_blank\">&quot;proof of life&quot; video<\/a>&nbsp;that showed that the missing Chibok schoolgirls who were kidnapped in Nigeria in 2014 were still alive. She was also an instrumental member of the CNN team that won a Peabody Award in May 2015 for the network&#39;s coverage of the missing girls. Busari recently won a Gracie Award for her persistence in covering this story, and she&#39;s also a previous recipient of the Outstanding Woman in the Media Awards.<\/p><p>Busari is a passionate community activist who curated&nbsp;<a href=\"http:\/\/www.tedxbrixton.com\/\" target=\"_blank\">TEDxBrixton<\/a>&nbsp;for three years before she left London. She founded TEDxBrixton in 2013 driven by a desire to bring disparate elements of her community together and to create a platform for those who wouldn&#39;t normally have one to share their ideas worth spreading.<\/p><p>A passionate and adept public speaker, Busari is regularly invited to share her insights and host panels. She has spoken at UN Women, Said Business School, Oxford, Africa Gathering among others.<\/p><p>Over a 15-year career, Busari has worked as a news reporter, entertainment and features writer, court reporter and columnist, and she has been published in many of the UK and international media&#39;s most influential outlets, such as the BBC and Daily Mirror.<\/p><p>During a six-month stint in Northern Ireland in 2003, Busari spent time in some of the worst affected areas of &quot;The Troubles&quot; and secured interviews with a crucifixion victim, government ministers and paramilitaries. While there, she also launched and edited an award-winning lifestyle column.<\/p><p>A native Yoruba speaker, Busari also speaks fluent French and is currently learning Hausa. &nbsp;<\/p>","slug":"stephanie_busari","published_at":"2017-02-17 17:26:00","updated_at":"2017-04-24 15:17:35"}}