{"speaker":{"id":33,"title":"","firstname":"Thomas","middleinitial":"","lastname":"Barnett","description":"Military strategist","whotheyare":"Strategic planner Thomas Barnett has advised US leaders on national security since the end of the Cold War. His bold ideas about the future of warfare and the military are spelled out in his best-selling book <em>The Pentagon's New Map.<\/em>","whylisten":"<p>Thomas P.M. Barnett&#39;s <strong>bracing confidence and radical recommendations<\/strong> make him a powerful force shaping the future of the US military. <\/p><p>In his book&nbsp;<a href=\"http:\/\/geni.us\/pentagonsnewmap\" target=\"_blank\"><em>The Pentagon&#39;s New Map: War and Peace in the Twenty-First Century<\/em><\/a>,&nbsp;Barnett draws on a fascinating combination of economic, political and cultural factors to predict and <strong>explain the nature of modern warfare<\/strong>. He presents concrete, world-changing strategies for transforming the US military -- adrift in the aftermath of the Cold War and 9\/11 -- into a two-tiered power capable not only of winning battles, but of <strong>promoting and preserving international peace<\/strong>. <\/p><p>Thomas has been a senior adviser to military and civilian leaders in a range of offices, including the Office of the Secretary of Defense, the Joint Staff, Central Command and Special Operations Command. During the tumultuous period from November 2001 to June 2003, he advised the Pentagon on <strong>transforming military capabilities<\/strong> to meet future threats. He led the five-year <a href=\"http:\/\/www.thomaspmbarnett.com\/projects\/newrulesset\/nrs_index.html\" target=\"_blank\">NewRuleSet.Project<\/a>, which studied how globalization is transforming warfare. The study found, among other things, that <strong>when a country&#39;s per-capita income rises above ~$3,000, war becomes much less likely<\/strong>. <\/p><p><strong>Barnett is unusually outspoken in a field cloaked in secrecy. <\/strong>His follow-up book is <a href=\"http:\/\/geni.us\/blueprintforaction\" target=\"_blank\"><em>Blueprint for Action: A Future Worth Creating<\/em><\/a>, and he writes regular columns for <a href=\"http:\/\/www.thomaspmbarnett.com\/articles\/esquire.htm\" target=\"_blank\"><em>Esquire<\/em><\/a>  and the <a href=\"http:\/\/www.knoxnews.com\/kns\/columnist\/0,1406,KNS_364_20872,00.html\" target=\"_blank\"><em>Knoxville News Sentinel<\/em><\/a>.  He also maintains a prolific <a href=\"http:\/\/www.thomaspmbarnett.com\/\" target=\"_blank\">blog<\/a>, where he covers current global events.<\/p>","slug":"thomas_barnett","published_at":"2007-06-14 00:37:00","updated_at":"2015-07-13 17:45:35"}}