{"speaker":{"id":3309,"title":"","firstname":"Ani","middleinitial":"","lastname":"Liu","description":"Designer, artist","whotheyare":"Ani Liu explores the intersection between technology and sensory perception.","whylisten":"<p>Ani Liu is a transdisciplinary artist working at the intersection of art and science. Currently at MIT Media Lab, she creates research-based art that explores the social, cultural and ethical implications of emerging technologies. In the search to link scientific innovation with emotional tangibility, her work has spanned the scales of architectural installations, wearable prosthetics, augmented reality and synthetic biology.<\/p><p>Liu&#39;s work has been presented at the&nbsp;<a href=\"http:\/\/www.mfa.org\/\" target=\"_blank\">Boston Museum of Fine Arts<\/a>,&nbsp;<a href=\"http:\/\/www.asianart.org\/\" target=\"_blank\">Asian Art Museum<\/a>,&nbsp;<a href=\"https:\/\/mitmuseum.mit.edu\/\" target=\"_blank\">MIT Museum<\/a>, MIT Media Lab, Wiesner Gallery, Harvard University, Open Gallery, Powerhouse Alliance Conference, Buildings as Cities Inaugural Conference and TEDxBeaconStreet. Her work has been featured in several publications, including&nbsp;<a href=\"http:\/\/geni.us\/SjwAQ\" target=\"_blank\"><em>See Yourself X: Human Futures Expanded<\/em><\/a>&nbsp;and <em>Solid: Design Techniques<\/em>.<\/p><p>In 2014-15, she led the research program in Sensory Mediation at the Harvard Center for Green Buildings and Cities, which explores how information visualization, augmented reality and other emerging technologies can be harnessed to extend the human sensorium to redefine spatial experience.<\/p><p>She taught as an Associate Instructor at the Harvard Graduate School of Design, where she co-taught an advanced-level architectural studio called Architecture of Cultural Prosthetics: Tools for Communication and Expression in the Public Space with Krzysztof Wodiczko.<\/p><p>Liu has a BA from Dartmouth College and received a Masters of Architecture degree from the Harvard Graduate School of Design, earning a distinction for her thesis in wearable technologies, responsive environments and cultural prosthetics. She continually seeks to discover the unexpected, through playful experimentation, intuition and speculative storytelling.<\/p><div><br \/><\/div>","slug":"ani_liu","published_at":"2017-02-23 20:31:00","updated_at":"2017-03-31 20:10:19"}}