{"speaker":{"id":3311,"title":"","firstname":"Anab","middleinitial":"","lastname":"Jain","description":"Futurist, designer","whotheyare":"TED Fellow Anab Jain imagines and builds future worlds we can experience in the present moment. By creating new ways of seeing, being and acting, she inspires and challenges us to look critically at the decisions and choices we make today.","whylisten":"<p>We live in extraordinary times, concurrently breathtaking and deeply precarious. Anab&nbsp;Jain co-founded the vanguard laboratory, design and film studio&nbsp;<a href=\"http:\/\/superflux.in\/\" target=\"_blank\">Superflux<\/a>&nbsp;with Jon Ardern to parse uncertainties around our shared futures. She creates tangible, provocative experiences that transport people directly into possible future worlds. Through her work, Jain has discovered a powerful means of affecting change; by confronting and emotionally connecting people with future consequences in the present.<\/p><p>From climate change and growing inequality, to the emergence of artificial intelligence and the future of work, Jain and her team explore some of the biggest challenges of our times -- and investigate the potential and unintended consequences of these challenges.<\/p><p>Superflux is currently developing tools and strategies that can enable us to mitigate the shock of food insecurity and climate change. Recently, they produced a series of civilian drones -- creating a vision of a near-future city where these intelligent machines begin to display increasing autonomy within civic society.<\/p><p>Jain is also&nbsp;<a href=\"http:\/\/www.dieangewandte.at\/en\/institutes\/design\/industrial_design_2\" target=\"_blank\">Professor of Design at the University of Applied Arts in Vienna<\/a>, where she is currently curating the &quot;How Will We Work&quot; show for the Vienna Biennale, and she is a TED Fellow. Her work has won awards at UNESCO, Apple Inc., Geneva Human Rights Film Festival, Innovate UK, and exhibited at MoMA New York, V&amp;A London, National Museum of China, Vitra Design Museum and Tate Modern. &nbsp;<\/p>","slug":"anab_jain","published_at":"2017-02-26 20:55:00","updated_at":"2017-06-19 17:23:39"}}