{"speaker":{"id":3315,"title":"","firstname":"Anne","middleinitial":"","lastname":"Madden","description":"Microbiologist, inventor and strategist","whotheyare":"Whether brewing better beer, discovering novel antibiotics or chronicling the lives of the microscopic creatures living in the dust under the couch, Anne Madden seeks to understand and utilize the microbial world around us.","whylisten":"<p>Dr. Anne A. Madden studies the ways that our dimly understood microbial neighbors can yield surprising discoveries, including technological solutions, to many of our human problems. She discovers what life exists around us and how it can be employed to make our lives better, from new medications to new food and beverage flavors. She&#39;s created novel brewing technology (see more in her&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=XqWIHDPmmQ4\" target=\"_blank\">2016 TEDxCharlotte talk<\/a>), discovered novel antibiotics, named a new fungus species living inside wasp nests and cataloged the astonishing diversity of some of the microscopic and macroscopic life in diverse places such as our house dust, sourdough starters, hands and even the bodies and nests of insects and birds.&nbsp;<\/p><p>Madden is an award-winning scientist, academic researcher and entrepreneur. She is Founder and President of The Microbe Institute, a global organization that fosters microbial discovery for a better tomorrow through interdisciplinary education, art and research initiatives. She is Chief Scientific Officer at the brewing yeast company Lachancea, and she helps life sciences organizations, <em>Fortune<\/em> 500 companies and organizations such as MIT and Harvard University innovate for impact as Chief Consultant at Imnovate Consulting. (Learn more about one of her projects, HoneyDNA, in&nbsp;<a href=\"https:\/\/www.ted.com\/talks\/noah_wilson_rich_how_you_can_help_save_the_bees_one_hive_at_a_time\" target=\"_blank\">Noah Wilson-Rich&#39;s TED Talk<\/a>). Her research and interdisciplinary projects have been featured on numerous media platforms, including <em>National Geographic<\/em>, the<em> Washington Post<\/em>, the <em>New York Times<\/em>, BBC, NPR, Newsweek, <em>Scientific American<\/em> and PBS NewsHour.<\/p>","slug":"anne_madden","published_at":"2017-02-26 21:23:00","updated_at":"2020-06-12 01:34:12"}}