{"speaker":{"id":3324,"title":"","firstname":"Luma","middleinitial":"","lastname":"Mufleh","description":"Refugee activist","whotheyare":"Luma Mufleh does something revolutionary: she coaches soccer. A Jordanian immigrant and Muslim of Syrian descent, Mufleh is determined to empower refugee children everywhere.","whylisten":"<p>Luma Mufleh is the CEO and Founding Director of Fugees Family, Inc., a nonprofit organization that uses the power of soccer, education and community to empower refugee children to successfully integrate into the United States. Now, she&#39;s part principal, part tutor, the head of the first accredited private school dedicated to refugee education in the country, which encompases a summer camp and a college prep program -- and she&rsquo;s building a community and support network that could be the national model the United States needs.<\/p><p>The Fugees&#39; story began in 2004, when Luma took a wrong turn while driving through the town of Clarkston, Georgia and noticed a group of boys playing soccer in the street. She learned that these children were refugees from war-town countries including Syria, Afghanistan, Iraq, Bosnia, Burma, Somalia and Sudan. That summer, Luma made fliers announcing tryouts for the Fugees soccer team. In the years that followed, the soccer team grew into something much larger -- a school, a tutoring program, a summer camp, a college prep program, and, most importantly, a community and support network.<\/p><p>A lifelong social entrepreneur, Luma has created several programs and initiatives that have gainfully employed, educated and empowered refugees and immigrants in her community and beyond, with the Fugees Academy serving as a national model for refugee education. While only 20 percent of refugee students graduate from high school in Georgia&#39;s DeKalb County, the Fugees Academy has a 90 percent graduation rate. These types of results helped earn Luma the 2016 Cournelle Award for Social Entrepreneurship from the Manhattan Institute.<\/p><p>A Jordanian immigrant and Muslim of Syrian descent, Luma received her U.S. citizenship in 2011. Her story -- and the story of the Fugees -- illustrates both the American dream and the very real challenges of integration and discrimination that so many face today. Luma received her B.A. in Anthropology from Smith College and recently completed the Executive Program in Social Entrepreneurship at the Stanford Graduate School of Business.&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>","slug":"luma_mufleh","published_at":"2017-02-26 23:16:00","updated_at":"2017-06-23 14:16:05"}}