{"speaker":{"id":3331,"title":"","firstname":"Gretchen","middleinitial":"","lastname":"Carlson","description":"TV journalist, women's empowerment advocate","whotheyare":"Gretchen Carlson is a tireless advocate for workplace equality and women's empowerment.","whylisten":"<p>Named one of <em>TIME<\/em>&#39;s&nbsp;100 Most Influential People in the World for 2017, Gretchen Carlson is one of the nation&#39;s most highly acclaimed journalists and a warrior for women. In 2016, Carlson became the face of sexual harassment in the workplace after her lawsuit against Fox News Chairman and CEO Roger Ailes paved the way for thousands of other women facing harassment to tell their stories. Carlson&#39;s advocacy put her on the cover of <em>TIME<\/em>, and her new book,&nbsp;<a href=\"http:\/\/geni.us\/bA2l5CE\" target=\"_blank\"><em>Be Fierce: Stop Harassment and Take Your Power Back<\/em><\/a>, joined the <em>New York Times<\/em> best-seller list the week it was published. She became a columnist for <em>TIME<\/em>&#39;s&nbsp;online &quot;Motto&quot; newsletter in 2017, focusing on gender and empowerment issues.<\/p><p>Carlson&#39;s ongoing work on behalf of women includes advocating for arbitration reform on Capitol Hill; in 2018, she plans to testify before Congress about workplace inequality and forced arbitration clauses in employment contracts. Carlson also created the&nbsp;<a href=\"https:\/\/www.gretchencarlson.com\/philanthropy\/\" target=\"_blank\">Gift of Courage Fund<\/a>&nbsp;and the&nbsp;<a href=\"https:\/\/aitogether.org\/\" target=\"_blank\">Gretchen Carlson Leadership Initiative<\/a>&nbsp;to support empowerment, advocacy and anti-harassment programs for girls and underserved women.<\/p><p>Carlson hosted &quot;The Real Story&quot; on Fox News for three years; co-hosted &quot;Fox and Friends&quot; for seven years; and in her first book,&nbsp;<a href=\"http:\/\/geni.us\/mjTt\" target=\"_blank\"><em>Getting Real<\/em><\/a>, became a national best-seller. She co-hosted &quot;The Saturday Early Show&quot; for CBS in 2000 and served as a CBS News correspondent covering stories including Geneoa&#39;s G-8 Summit, Timothy McVeigh&rsquo;s execution, 9\/11 from the World Trade Center and the Bush-Gore election. She started her reporting career in Richmond, Virginia, then served as an anchor and reporter in Cincinnati, Cleveland and Dallas, where she produced and reported a 30-part series on domestic violence that won several national awards.<\/p><p>An honors graduate of Stanford University, Carlson was valedictorian of her high school class and studied at Oxford University in England. A child prodigy on the violin, she performed as a soloist with the Minnesota Symphony Orchestra at age 13, and in 1989, became the first classical violinist to win the Miss America crown.<\/p><p>Ever grateful for the opportunities provided to her and imbued with a &quot;never give up&quot; attitude, Carlson has mentored dozens of young women throughout her career. She serves as a national&nbsp;trustee for the March of Dimes, a member of the board of directors for the Catherine Violet Hubbard Animal Sanctuary in Newtown, Connecticut and a trustee of Greenwich Academy, an all-girls preparatory day school in Greenwich, Connecticut. Carlson is married to sports agent Casey Close and mom to their two children.<\/p>","slug":"gretchen_carlson","published_at":"2017-02-28 18:40:00","updated_at":"2017-11-06 15:12:56"}}