{"speaker":{"id":3338,"title":"","firstname":"Laura","middleinitial":"","lastname":"Galante","description":"Cyberspace analyst","whotheyare":"Laura Galante profiles advanced cyber threats and network breaches and investigates the political, military and financial implications of cyber operations.","whylisten":"<p>Laura Galante analyzes how states use cyberspace, or more precisely, our information space. She describes a domain where militaries, intelligence services, criminal groups and individuals actively pursue their interests -- with far fewer restraints than in the physical world.<\/p><p>A leading voice on information operations and intelligence analysis, she founded Galante Strategies in spring 2017 to assist governments and corporations in recognizing and responding to cyber and information threats.<\/p><p>Galante previously served as Director of Global Intelligence at FireEye where her teams investigated network activity, profiled advanced cyber threats and portrayed the political, military and financial implications of cyber operations. A founding member of Mandiant Intelligence, her work has included leading strategic analysis, developing intelligence capabilities and offerings and directing intelligence publications including&nbsp;<em><a href=\"https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/global\/en\/current-threats\/pdfs\/rpt-apt28.pdf\" target=\"_blank\">APT28: A Window into Russia&#39;s State Cyber Espionage<\/a>;&nbsp;<a href=\"https:\/\/www.fireeye.com\/content\/dam\/fireeye-www\/current-threats\/pdfs\/rpt-china-espionage.pdf\" target=\"_blank\">Red Line Drawn: China Recalculates its Use of Cyber Espionage<\/a><\/em>&nbsp;and&nbsp;<a href=\"https:\/\/www2.fireeye.com\/fin4.html\" target=\"_blank\">Hacking the Street? FIN4 Likely Playing the Market<\/a>&nbsp;among others.<\/p><p>In November 2016, Galante spoke at the UN Security Council&#39;s meeting on cybersecurity and international peace and security. She frequently appears on and provides commentary to&nbsp;CNN, Bloomberg, NPR, BBC, Fox News, the <em>New York Times<\/em>, the <em>Financial Times<\/em>, <em>The Wall Street Journal<\/em>, Reuters, the Associated Press and other global and industry media.<\/p><p>Prior to her work at FireEye and Mandiant, Galante led a contractor team analyzing cyber capability development and military doctrine at the US Department of Defense. She supported the 2010 US-Russia bilateral information security talks.<\/p><p>Galante holds a J.D. from the Catholic University of America and a BA in Foreign Affairs and Italian from the University of Virginia.<\/p>","slug":"laura_galante","published_at":"2017-03-06 01:40:00","updated_at":"2017-05-03 15:28:49"}}