{"speaker":{"id":3346,"title":"","firstname":"David","middleinitial":"","lastname":"Brenner","description":"Radiation scientist","whotheyare":"David Brenner is developing a unique type of light to kill viruses safely.","whylisten":"<p>David Brenner directs the&nbsp;<a href=\"https:\/\/www.crr.columbia.edu\/\" target=\"_blank\">Center for Radiological Research<\/a>&nbsp;at Columbia University Irving Medical Center in New York City and has numerous distinctions within his field, such as the Oxford University Weldon Prize and the Radiation Research Society Failla Gold Medal Award. Founded by a student of Marie Curie more than a century ago, the Columbia Center for Radiological Research is committed to exploiting all forms of radiation to improve human health and medical care.<\/p><p>Over the past eight years, Brenner and his team have been developing the use of a unique type of ultraviolet light, called far-UVC light, designed to safely kill viruses such as the SARS-CoV-2 virus that causes COVID-19, as well as drug-resistant bacteria. We have known for a long time that conventional germicidal UV light kills viruses and bacteria but the problem has always been that it can also potentially damage human skin and eyes. By contrast, far-UVC light has the potential to kill viruses safely, so that it can potentially be used to continuously kill viruses in occupied public places.&nbsp;<\/p><p>As we begin to look forward towards a post-COVID era, Brenner envisages the use of overhead far-UVC light in hospitals, nursing homes, buses, planes, trains, train stations, schools, restaurants, offices, theaters, gyms, food preparation areas -- anywhere where people move closer together.&nbsp; &nbsp;<\/p><p>The power of light, which Brenner sees as the power of physics, has the potential to be a genuinely new weapon in the fight against the SARS-CoV-2 virus as well as next year&#39;s influenza virus and the next pandemic virus, as discussed in a&nbsp;<a href=\"https:\/\/www.nature.com\/articles\/s41598-020-67211-2\" target=\"_blank\">recent paper<\/a> he coauthored in&nbsp;<em>Scientific Reports<\/em>.<\/p> ","slug":"david_brenner","published_at":"2017-03-06 19:10:00","updated_at":"2020-07-24 17:35:11"}}