{"speaker":{"id":3350,"title":"","firstname":"Titus","middleinitial":"","lastname":"Kaphar","description":"Artist","whotheyare":"Titus Kaphar's artworks interact with the history of art by appropriating its styles and mediums.","whylisten":"<p>Titus Kaphar is an artist whose paintings, sculptures and installations examine the history of representation by transforming styles and mediums with formal innovations to emphasize the physicality and dimensionality of the canvas and materials themselves. His practice seeks to dislodge history from its status as the &quot;past&quot; in order to unearth its contemporary relevance. Kaphar received an MFA from the Yale School of Art and is a distinguished recipient of numerous prizes and awards including a 2018 MacArthur Fellowship, a 2018 Art for Justice Fund grant, a 2016 Robert R. Rauschenberg Artist as Activist grant and a 2015 Creative Capital grant. Recent exhibitions include&nbsp;<em>From a tropical space<\/em> at Gagosian Gallery, NY, and <em>Titus Kaphar: New works<\/em>&nbsp;in Brussels, Belgium.<\/p><p>Kaphar&#39;s commitment to social engagement has led him to move beyond traditional modes of artistic expression to establish&nbsp;<a href=\"https:\/\/www.nxthvn.com\/\" target=\"_blank\">NXTHVN<\/a>, an arts incubator and residency program based in New Haven, Connecticut. Through intergenerational mentorship, professional development and cross-sector collaboration, NXTHVN connects early-career artists and creative professionals with the resources and networks vital to their success. NXTHVN provides an alternative model of professional development and mentorship in the arts and encourages artists, art professionals and local entrepreneurs to expand New Haven&#39;s growing creative community.&nbsp;For more information on how to support the next generation of Black and brown artists and curators,&nbsp;<a href=\"https:\/\/www.nxthvn.com\/support\/\" target=\"_blank\">check out NXTHVN&#39;s website<\/a>.<\/p>","slug":"titus_kaphar","published_at":"2017-03-07 12:58:00","updated_at":"2022-06-17 18:44:39"}}