{"speaker":{"id":3352,"title":"","firstname":"Tomás","middleinitial":"","lastname":"Saraceno","description":"Artist","whotheyare":"Tomás Saraceno invites us to consider the impossible, like spiders that play music or cities in the sky.","whylisten":"<p>Tom&aacute;s Saraceno&rsquo;s oeuvre could be seen as an ongoing research informed by the worlds of art, architecture, natural sciences, astrophysics and engineering. His floating sculptures, community projects and interactive installations propose and explore new, sustainable ways of inhabiting and sensing the environment.<\/p><p><em><a href=\"http:\/\/aerocene.org\/\" target=\"_blank\">Aerocene<\/a><\/em>, an open-source community project for artistic and scientific exploration initiated from Saraceno&#39;s vision, becomes buoyant only by the heat of the sun and infrared radiation from the surface of earth. In 2015, Saraceno achieved the world record for the first and longest certified fully-solar manned flight. During the past decade, he has initiated collaborations with renowned scientific institutions including the Massachusetts Institute of Technology, Max Planck Institute, the Nanyang Technological University of Singapore, and institutions of the Exhibition Road Cultural Group, among them Imperial College and the Natural History Museum London.<\/p><p>Saraceno lectures in institutions worldwide&nbsp;and directed the Institute of Architecture-related Art (IAK) at Braunschweig University of Technology, Germany (2014&ndash;2016). He was the first person to scan, reconstruct and re-imagine spiders&#39; weaved spatial habitats, and he possesses the only three-dimensional spider web collection to existence. He has held residencies at Centre National d&rsquo;&Eacute;tudes Spatiales (2014&ndash;2015), MIT Center for Art, Science &amp; Technology (2012&ndash;ongoing) and Atelier Calder (2010), among others. In 2009, Saraceno attended the International Space Studies Program at NASA Ames. The same year he presented a major installation at the 53rd Venice Biennale, and was later awarded the prestigious Calder Prize. Saraceno&#39;s work is included in the collections of The Museum of Modern Art, New York; SFMOMA, San Francisco; Walker Art Center, Minneapolis; Nationalgalerie, Staatliche Museen zu Berlin, Berlin; among others.<\/p>","slug":"toma_s_saraceno","published_at":"2017-03-07 16:48:00","updated_at":"2017-09-07 14:51:57"}}