{"speaker":{"id":3363,"title":"","firstname":"Sinéad","middleinitial":"","lastname":"Burke","description":"Writer, educator","whotheyare":"Sinéad Burke amplifies voices and instigates curious conversations.","whylisten":"<p>Since her first days of elementary school, Sin&eacute;ad Burke has understood the power of education to combat ignorance, to challenge the status quo and to give agency to the most vulnerable. She wanted to become a teacher -- one who ensured that children felt represented, listened to and safe in her classroom -- and she graduated at the top of her class, receiving the Vere Foster Medal from Marino Institute of Education.<\/p><p>Through writing, public speaking and social media, Burke highlights the lack of inclusivity within the fashion industry and encourages the industry to design for and with disabled people. She critiques the ways in which the media talks about and to women, offering an alternative conversation that celebrates the achievements of others with her &quot;Extraordinary Women&quot; interview series.<\/p><p>Burke has visited schools, workplaces, government agencies and the White House to facilitate honest conversations about education, disability, fashion and accessibility. She advocates for the inclusion of all and challenges officials to legislate with most marginalized in our communities.<\/p><p>Burke is currently undertaking a PhD in Trinity College, Dublin on human rights education that specifically comments on the ways in which schools allow children to have a voice. She values kindness, empathy and volunteerism, and she is an ambassador for the Irish Society for the Prevention of Cruelty to Children and the Irish Girl Guides. Burke is the host of the podcast&nbsp;<em><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/as-me-with-sin&eacute;ad\/id1468608471\" target=\"_blank\">As Me with Sin&eacute;ad<\/a><\/em>.<\/p>","slug":"sinead_burke","published_at":"2017-03-07 19:35:00","updated_at":"2019-10-30 18:30:08"}}