{"speaker":{"id":3365,"title":"","firstname":"Giorgia","middleinitial":"","lastname":"Lupi","description":"Information designer","whotheyare":"Giorgia Lupi sees beauty in data. She challenges the impersonality that data communicate, designing engaging visual narratives that re-connect numbers to what they stand for: stories, people, ideas.","whylisten":"<p>What sets Giorgia Lupi apart is her&nbsp;<a href=\"https:\/\/medium.com\/@giorgialupi\/data-humanism-the-revolution-will-be-visualized-31486a30dbfb\" target=\"_blank\">humanistic approach<\/a>&nbsp;to the world of data.<\/p><p><a href=\"http:\/\/giorgialupi.com\/\" target=\"_blank\">Her work<\/a>&nbsp;frequently crosses the divide between digital, print and handcrafted representations of information: primarily,&nbsp;<a href=\"https:\/\/medium.com\/accurat-studio\/sketching-with-data-opens-the-mind-s-eye-92d78554565\" target=\"_blank\">she draws with data<\/a>. She has a passion for and obsession with data, the material she uses to tell stories, and the lens through which she sees the world.<\/p><p>Data are often considered to be very impersonal, boring and clinical, but Lupi&#39;s work proves the opposite. She makes sense of data with a curious mind and a heterogeneous arsenal, which ranges from digital technology to exhausting and repetitive manual labor. She believes we will ultimately unlock the full potential of data only when we embrace their nature, and make them part of our lives, which will inevitably make data more human in the process.<\/p><p>Trained as an architect, Lupi has always been driven by opposing forces: analysis and intuition, logic and beauty, numbers and images. True to these dichotomies, in 2011 she started both her own company and studying for a PhD. She earned her ddoctorate in design at Politecnico di Milano, where she focused on information mapping, and she is now the design director and co-founder of&nbsp;<a href=\"http:\/\/www.accurat.nyc\/\" target=\"_blank\">Accurat<\/a>, a global, data-driven research, design and innovation firm with offices in Milan and New York. She relocated from Italy to New York City, where she now lives.<\/p><p>Thanks to her work and research, Giorgia is a prominent voice in the world of data. She has spoken at numerous events, universities and institutions around the world, including the Museum of Modern Art, the Guggenheim Museum, PopTech Conference, Eyeo Festival, Fast Company Innovation by Design, New York University, Columbia University and the New York Public Library. She has been featured in major international outlets such as the <em>New York Times<\/em>, <em>The Guardian<\/em>, the <em>Washington Post<\/em>, NPR, BBC, <em>TIME<\/em>&nbsp;magazine, <em>National Geographic<\/em>, <em>Scientific American<\/em>, <em>Popular Science<\/em>, <em>Wired<\/em>, <em>Vogue<\/em>, <em>Vanity Fair<\/em>, <em>Monocle<\/em> and more. Her work has been exhibited at the Design Museum, the Science Museum, and Somerset House in London; the New York Hall of Science and the Storefront for Art and Architecture in New York; at the Triennale Design Museum and the Design Week in Milan, among others.<\/p><p>With her company, Accurat, she has worked with major international clients including IBM, Google, Microsoft, the United Nations, the World Health Organization, the World Economic Forum, the European Union, the Louis Vuitton-Moet-Hennessy Group, Fiat Chrysler Automobiles, J.P. Morgan Asset Management, Unicredit Group and KPMG Advisory.<\/p><p>Giorgia is the&nbsp;co-author of&nbsp;<a href=\"http:\/\/geni.us\/p0ZC\" target=\"_blank\"><em>Dear Data<\/em><\/a>, an aspirational hand-drawn data visualization book that explores the more slippery details of daily life through data, revealing the patterns that inform our decisions and affect our relationships.<\/p><p>Her work is part of the&nbsp;<a href=\"https:\/\/medium.com\/@giorgialupi\/dear-data-has-been-acquired-by-moma-but-this-isnt-what-we-are-most-excited-about-bdaa3376d9db\" target=\"_blank\">permanent collection of the Museum of Modern Art<\/a>.<\/p>","slug":"giorgia_lupi","published_at":"2017-03-07 19:36:00","updated_at":"2017-04-07 15:05:58"}}