{"speaker":{"id":3366,"title":"","firstname":"Siamak","middleinitial":"","lastname":"Hariri","description":"Architect","whotheyare":"Siamak Hariri holds deep respect for the transformative potential of architecture, specializing in creating works of enduring value.","whylisten":"<p>Siamak Hariri is a founding Partner of Hariri Pontarini Architects, a 120 person practice based in Toronto. His portfolio of nationally and internationally recognized buildings has won over 60 awards, including the Governor General&rsquo;s Medal in Architecture, celebrated as one of Canada&rsquo;s Artists who mattered most by the Globe and Mail and with his Partner David Pontarini, the 2013 Royal Architectural Institute of Canada&rsquo;s Architectural Firm Award.<\/p><p>One of Hariri&#39;s earliest HPA projects, the Canadian headquarters of McKinsey &amp; Company, is the youngest building to receive City of Toronto heritage landmark designation. He has recently completed public and private projects include the award-winning Richard Ivey Building, Richard Ivey School of Business at Western University, the Jackman Law Building for the University of Toronto&rsquo;s Faculty of Law, the Schulich School of Business at York University and the Integrated Health Sciences campus, with the University of Waterloo&rsquo;s School of Pharmacy and the McMaster University Michael G. DeGroote School of Medicine in downtown Kitchener.<\/p><p>In the fall of 2016, Hariri&nbsp;completed a project he began in 2003, the &nbsp;Bah&aacute;&rsquo;&iacute; Temple of South American, located in Santiago, Chile, the last of the Bah&aacute;&rsquo;&iacute; continental temples. Won through an international call and a rigorous design competition (185 entries from 80 countries) the temple is poised to become an architectural landmark at the foothill of the Andes. It has already won some of the top architecture awards including &nbsp;the RAIC Innovation Award, the World Architecture News Best Building of the Year (selected by ninety-seven judges around the world); Architect Magazine&rsquo;s Progressive Architecture Award (architecture&rsquo;s top unbuilt projects award); the Canadian Architect&rsquo;s Award of Excellence; the International Property Awards and was profiled by National Geographic Magazine.<\/p><p>Hariri is currently working on the complex Princess Margaret Space Transformation Project and &nbsp;has recently won two international design competitions, the first, the Sprott School of Business at Carleton University, and the second, selected from over 92 international architects, for the new Tom Patterson Theatre, poised to become the heart of the Stratford Festival.<\/p><p>Born in Bonn, Germany, Hariri&nbsp;was educated at the University of Waterloo and Yale University where he completed a Master of Architecture. He has taught at the Daniels Faculty of Architecture, Landscape and Design at the University of Toronto, as well as been a lecturer and guest critic for numerous organizations across North America. Hariri&nbsp;was recently awarded an Honorary Doctorate of Architecture from Ryerson University for his contribution to architecture in Canada and abroad. The University of Toronto also honored him with an Arbor Award for his contribution to the University experience as a lecturer and adjunct professor. Hariri&nbsp;lives in Toronto with his artist wife, Sasha Rogers and their three children; Lua, Yasmin and David.&nbsp;<\/p>","slug":"siamak_hariri","published_at":"2017-03-07 19:36:00","updated_at":"2017-04-21 18:57:03"}}