{"speaker":{"id":3367,"title":"","firstname":"Michael","middleinitial":"","lastname":"Bierut","description":"Designer, critic","whotheyare":"Michael Bierut is a partner in the New York office of Pentagram, a founder of Design Observer and a teacher at Yale School of Art and Yale School of Management.","whylisten":"<p>Michael Bierut studied graphic design at the University of Cincinnati&#39;s College of Design, Architecture, Art and Planning, graduating summa cum laude in 1980. Prior to joining Pentagram in 1990 as a partner in the firm&#39;s New York office, he worked for ten years at Vignelli Associates, ultimately as vice president of graphic design.<\/p><p>His projects at Pentagram have included work for the <em>New York Times<\/em>, Saks Fifth Avenue, The Cathedral of St. John the Divine, Harley-Davidson, The Museum of Arts and Design, Mastercard, the New York City Department of Transportation, the Robin Hood Foundation, Mohawk Paper Mills, New World Symphony, the New York Jets, the Brooklyn Academy of Music and MIT Media Lab. As a volunteer to Hillary for America, he created the ubiquitous H logo that was used throughout the 2016 presidential campaign.<\/p><p>He has won hundreds of design awards and his work is represented in the permanent collections of the Museum of Modern Art and the Metropolitan Museum of Art in New York, and the Mus&eacute;e des Arts D&eacute;coratifs, Montreal. He served as president of the New York Chapter of the American Institute of Graphic Arts (AIGA) from 1988 to 1990 and is president emeritus of AIGA National. Bierut&nbsp;was elected to the Alliance Graphique Internationale in 1989, to the Art Directors Club Hall of Fame in 2003, and was awarded the profession&rsquo;s highest honor, the AIGA Medal, in 2006. In 2008, he was named winner in the Design Mind category of the Cooper-Hewitt National Design Awards. In spring 2016, Bierut&nbsp;was appointed the Henry Wolf Graphic Designer in Residence at the American Academy in Rome.<\/p><p>Bierut is a senior critic in graphic design at the Yale School of Art and a lecturer at the Yale School of Management. He writes frequently about design and is the co-editor of the five-volume series <em>Looking Closer: Critical Writings on Graphic Design<\/em> published by Allworth Press. In 2002, Bierut co-founded Design Observer, a blog of design and cultural criticism which now features podcasts on design, popular culture, and business.<\/p><p>Bierut&#39;s book <em>79 Short Essays on Design<\/em> was published in 2007 by Princeton Architectural Press. A monograph on his work, <em>How to use graphic design to sell things, explain things, make things look better, make people laugh, make people cry and (every once in a while) change the world,<\/em> was published in 2015 by Thames &amp; Hudson and Harper Collins. This accompanied the first retrospective exhibition of his work, part of the School of Visual Art&#39;s Masters Series, which was on view at the SVA Chelsea Gallery in New York City for five weeks in autumn 2015. His next book, <em>Now You See It<\/em>, is due out from Princeton Architectural Press this fall.&nbsp;<\/p><div><br \/><\/div>","slug":"michael_bierut","published_at":"2017-03-07 19:37:00","updated_at":"2018-02-28 18:07:39"}}