{"speaker":{"id":3369,"title":"","firstname":"Cynthia","middleinitial":"","lastname":"Erivo","description":"Actor, performer","whotheyare":"Known for her role in the Broadway revival of \"The Color Purple,\" Cynthia Erivo received two Academy Awards nominations in 2019 for her work on the movie \"Harriet,\" about the life of Harriet Tubman.","whylisten":"<p>Cynthia Erivo is a Tony, Emmy and Grammy Award-winning actress as well as an Academy Award, Golden Globe and SAG nominee. Erivo burst onto West End and Broadway stages in <em>The Color Purple<\/em> and has since taken the big screen by storm.&nbsp;In 2018, she made her film debut in two major films from 20th Century Fox:  Drew Goddard&#39;s Bad Times at the El Royale and Steve McQueen&#39;s Widows.<\/p><p>Erivo recently starred in Kasi Lemmons&#39; <em>Harriet<\/em> where she brought the legacy of Harriet Tubman to the big screen. Her performance was met with critical acclaim, garnering two Academy Award nominations, Golden Globe, SAG and multiple NAACP Award nominations as well as AAFCA and Society of Composers and Lyricists Award wins.<\/p><p>Erivo currently stars on the HBO series <em>The Outsider<\/em>, a series is based on the Stephen King novel of the same name. She can soon be seen as Aretha Franklin in National Geographic&#39;s Emmy-winning global anthology series &quot;Genius: Aretha.&quot; This upcoming season will be the first-ever, definitive and only authorized scripted limited series on the life of the universally acclaimed Queen of Soul.<\/p><p>Additional upcoming projects include Doug Liman&#39;s sci-fi thriller&nbsp;<em>Chaos Walking<\/em>&nbsp;and John Ridley&#39;s <em>Needle in a Timestack<\/em>. Erivo is set to executive produce and star in Warner Brothers&#39; musical take on the American folk tale &quot;Rip Van Winkle,&quot; as well as produce and star in the film adaptation of the QCode scripted thriller podcast, <em>Carrier<\/em>. Erivo will add to her producing credits the title of executive producer of the upcoming Quibi docuseries, <em>WHAT WE KEEP<\/em>.<\/p><p>Continuing to push the boundaries of her versatile career, Erivo stars in John Cameron Mitchell&#39;s music-driven podcast anthology, <em>Anthem: Homunculus<\/em>. In addition to her illustrious stage career, she is an accomplished performer with symphonies and music spaces including the Kennedy Center Honors, the 2020 Academy Awards, the 2017 Governor&#39;s Ball and the 2017 Grammy Awards. A UK native, she graduated from the famed Royal Academy of Dramatic Art in 2010.<\/p>","slug":"cynthia_erivo","published_at":"2017-03-07 20:47:00","updated_at":"2020-10-07 21:04:42"}}