{"speaker":{"id":337,"title":"","firstname":"Oliver","middleinitial":"","lastname":"Sacks","description":"Neurological anthropologist","whotheyare":"Since \"Awakenings\" stormed the bestseller lists (and the silver screen), Oliver Sacks has become an unlikely household name, single-handedly inventing the genre of neurological anthropology.","whylisten":"<p>Oliver Sacks was a ground-breaking neurologist -- and a gifted storyteller who enriched our knowledge of the infinite variations of human psychology. After his pioneering work with &ldquo;sleepy sickness&rdquo; patients (who were in fact survivors of an early-20th-century pandemic), Sacks went on to study the connections between music and the brain, as well as disorders such as Tourette&#39;s syndrome, Parkinson&#39;s disease, and many other little-understood disorders that often count Sacks as one of their first chroniclers.<br \/><br \/>Sacks was well known as a writer of such best-selling case histories as&nbsp;<a href=\"http:\/\/geni.us\/hallucinations\" target=\"_blank\"><em>Hallucinations<\/em><\/a>,&nbsp;<a href=\"http:\/\/geni.us\/manwhomistookhiswife\" target=\"_blank\"><em>The Man Who Mistook His Wife for a Hat<\/em><\/a>,&nbsp;<a href=\"http:\/\/geni.us\/anthropologistonmars\" target=\"_blank\"><em>An Anthropologist on Mars<\/em><\/a>, and his memoir of his early work,&nbsp;<a href=\"http:\/\/geni.us\/awakenings\" target=\"_blank\"><em>Awakenings<\/em><\/a>, all of which have breathed new life into the dusty 19th-century tradition of the clinical anecdote. Sacks&#39; writing, compassion and wide-ranging knowledge catapults the genre into the 21st century and brings the far frontiers of neurological experience into the view of millions of readers worldwide. Sacks died at age 82 in August 2015. <\/p><p>Read TED&#39;s <a href=\"http:\/\/blog.ted.com\/qa_with_oliver\/\" target=\"_blank\">long, wonderful Q&amp;A with Oliver Sacks &gt;&gt;<\/a> <\/p>","slug":"oliver_sacks","published_at":"2008-12-02 18:31:00","updated_at":"2015-09-21 22:11:44"}}