{"speaker":{"id":3379,"title":"","firstname":"Ted","middleinitial":"","lastname":"Halstead","description":"Policy entrepreneur, climate expert, author","whotheyare":"Ted Halstead breathed new life into US and global climate policy by mobilizing conservative leaders and CEOs around a breakthrough carbon dividends solution.","whylisten":"<p>Ted Halstead was the founder and CEO of the&nbsp;<a href=\"https:\/\/www.clcouncil.org\/\">Climate Leadership Council<\/a>, whose mission is to convene global opinion leaders around the most cost-effective, popular and equitable climate solutions.<\/p><p>Halstead also founded and led two other successful think tanks. His first, which he launched at 25, introduced new measures of progress and coordinated the&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Economists&#39;_Statement_on_Climate_Change\">Economists&rsquo; Statement on Climate Change<\/a>, signed by 18 Nobel laureate economists. His second,&nbsp;<a href=\"https:\/\/www.newamerica.org\/\">New America<\/a>, has become one of the most influential think tanks in Washington.<\/p><p>Halstead published numerous articles in the <em>New York Times<\/em>, <em>Washington Post<\/em>, <em>Financial Times<\/em>, <em>Fortune<\/em>, <em>The Atlantic<\/em>, <em>National Review<\/em>, <em>Bloomberg<\/em>, <em>Los Angeles Times<\/em> and <em>Harvard Business Review<\/em>. He also published two books, including&nbsp;<a href=\"https:\/\/www.amazon.com\/Radical-Center-Future-American-Politics\/dp\/0385720297\/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1488936754&amp;sr=1-1&amp;keywords=the+radical+center\"><em>The Radical Center: The Future of American Politics<\/em><\/a>&nbsp;(co-authored with Michael Lind).<\/p><p>From 2008 to 2012, he and his wife sailed around the world on a catamaran, with only their dog as crew. Halstead graduated Phi Beta Kappa from Dartmouth College, and received his Master&#39;s degree from Harvard&#39;s Kennedy School of Government, where he was a Montgomery Fellow. He was selected as a Young Global Leader by the World Economic Forum.<\/p>","slug":"ted_halstead","published_at":"2017-03-08 16:12:00","updated_at":"2021-02-12 18:37:24"}}