{"speaker":{"id":3387,"title":"","firstname":"John","middleinitial":"","lastname":"Koenig","description":"Writer","whotheyare":"John Koenig is writing an original dictionary of made-up words.","whylisten":"<p>John Koenig has spent the last seven years writing an original dictionary of made-up words,&nbsp;<a href=\"http:\/\/www.dictionaryofobscuresorrows.com\/\" target=\"_blank\"><em>The Dictionary of Obscure Sorrows<\/em><\/a>, which fills gaps in the language with hundreds of new terms for emotions. This project seeks to restore sadness to its original meaning (from Latin satis, &quot;fullness&quot;) by defining moments of melancholy that we may all feel, but never think to mention -- deepening our understanding of each other by broadening the emotional palette, from avenoir, &quot;the desire to see memories in advance,&quot; to zenosyne, &quot;the sense that time keeps going faster.&quot;<\/p><p>Each entry is a collage of word roots borrowed from languages all around the world. Some entries are even beginning to enter the language outright:<\/p><p><strong>sonder&nbsp;<\/strong><em>n.<\/em> The realization that each random passerby is living a life as vivid and complex as your own -- populated with their own ambitions, friends, routines, worries and inherited craziness -- an epic story that continues invisibly around you like an anthill sprawling deep underground, with elaborate passageways to thousands of other lives that you&#39;ll never know existed, in which you might appear only once, as an extra sipping coffee in the background, as a blur of traffic passing on the highway, as a lighted window at dusk.<\/p><p>His original YouTube series,&nbsp;<a href=\"http:\/\/www.youtube.com\/c\/obscuresorrows\" target=\"_blank\">The Dictionary of Obscure Sorrows<\/a>, which he writes, edits and narrates himself, has drawn acclaim from John Green and Beyonc&eacute; to Michael from Vsauce. &quot;Each episode is a soothing meditation on its subject, fortified by a hypnotic soundtrack and Koenig&rsquo;s twistingly intelligent narration,&quot;&nbsp;writes The Daily Dot.<\/p><p>He currently works as a freelance video editor, voice actor, graphic designer, illustrator, photographer, director and writer. His writing has been published in countless tattoos, stories, song titles and band names, but never on paper -- though he is currently working on publishing a book adaptation. Originally from Minnesota and Geneva, Switzerland, John lives in Budapest with his wife.<\/p>","slug":"john_koenig","published_at":"2017-03-09 20:00:00","updated_at":"2017-03-10 15:55:03"}}