{"speaker":{"id":3389,"title":"","firstname":"Peter","middleinitial":"","lastname":"Weinstock","description":"Pediatric ICU doctor","whotheyare":"Dr. Peter Weinstock is an Intensive Care Unit physician and Director of the Pediatric Simulator Program at Boston Children's Hospital\/Harvard Medical School. Peter and his team fuse medicine with state of the art special effects, puppeteering and 3D printing technologies to create lifelike simulations of complex surgeries.","whylisten":"<p>Dr. Peter Weinstock has merged his lifelong interest in human nature, medicine, theater&nbsp;and puppetry to develop one of the most advanced rehearsal spaces in medicine. Weinstock is a practicing pediatric intensive care unit physician at Boston Children&#39;s Hospital, where he serves as Senior Associate in Critical Care Medicine, Associate Professor of Anesthesia at Harvard Medical School, Chair of Pediatric Simulation and Director of the&nbsp;<a href=\"http:\/\/simpeds.org\/\" target=\"_blank\">Boston Children&#39;s Hospital Simulator Program<\/a>&nbsp;(SIMPeds). Weinstock works with his team of educators, psychologists, engineers, animators, special effects designers and 3D printers to immerse doctors, nurses, patients and their families in Hollywood-style &quot;life-like&quot; experiences -- all to optimize performance, clinical outcomes, as well as the entire healthcare journey for children and their families.<\/p><p>Weinstock received his PhD from Rockefeller University in molecular and cell biology, followed by clinical training in plastic and general surgery at the University of Pittsburgh and general pediatrics and critical care medicine at the Boston Children&rsquo;s Hospital. His passion is in developing methods that link highly realistic practice and preparedness training directly to the delivery of high quality, safe care to improve the lives of infants, children and their families. Due to its inherent emotionality, Weinstock&#39;s approach to simulation is keenly connected to emotionality and behavioral psychology as essential elements of relationships and decision-making to understand and optimize human-human and human-technology interactions. Weinstock&nbsp;has rapidly grown SIMPeds to thousands of simulations per year, and the SIMPeds method has been adopted among pediatric teaching centers around the globe.<\/p><p>Weinstock frequently lectures internationally on state of art simulation and experiential learning, and he has published sentinel articles in innovative application and approaches to simulation -- from human factors to engineering and testing of next generation of ultra-realistic training devices. He has chaired meetings worldwide and is Founding President of the International Pediatric Simulation Society.&nbsp;<\/p><div><br \/><\/div>","slug":"peter_weinstock","published_at":"2017-03-13 16:15:00","updated_at":"2017-03-20 15:03:49"}}