{"speaker":{"id":34,"title":"","firstname":"Aubrey","middleinitial":"","lastname":"de Grey","description":"Crusader against aging","whotheyare":"Aubrey de Grey, British researcher on aging, claims he has drawn a roadmap to defeat biological aging. He provocatively proposes that the first human beings who will live to 1,000 years old have already been born.","whylisten":"<p>A true maverick,  Aubrey de Grey challenges the most basic assumption underlying the human condition -- that aging is inevitable. He argues instead that aging is a disease -- one that can be cured if it&#39;s approached as &quot;an engineering problem.&quot;  His plan calls for <strong>identifying all the components that cause human tissue to age, and designing remedies for each<\/strong> of them &mdash; forestalling disease and eventually pushing back death. He calls the approach <a href=\"http:\/\/www.sens.org\/\" target=\"_blank\">Strategies for Engineered Negligible Senescence (SENS)<\/a>.<\/p><p> With his astonishingly long beard, wiry frame and penchant for bold and cutting proclamations, <strong>de Grey is a magnet for controversy<\/strong>. A computer scientist, self-taught biogerontologist and researcher, he has co-authored journal articles with some of the most respected scientists in the field.<\/p><p>But <strong>the scientific community doesn&#39;t know what to make of him<\/strong>. In July 2005, the <em>MIT Technology Review<\/em> challenged scientists to disprove de Grey&#39;s claims, offering a $20,000 prize (half the prize money was put up by de Grey&#39;s <a href=\"http:\/\/www.methuselahfoundation.org\/\" target=\"_blank\">Methuselah Foundation<\/a>) to any molecular biologist who could demonstrate that &quot;SENS is so wrong that it is unworthy of learned debate.&quot; <a href=\"http:\/\/www.technologyreview.com\/sens\/index.aspx\" target=\"_blank\">The challenge remains open<\/a>; the judging panel includes TEDsters Craig Venter and Nathan Myhrvold. It seems that &quot;SENS exists in a middle ground of yet-to-be-tested ideas that some people may find intriguing but which others are free to doubt,&quot; MIT&#39;s judges wrote. And while they &quot;don&#39;t compel the assent of many knowledgeable scientists,&quot; they&#39;re also &quot;not demonstrably wrong.&quot;<\/p>","slug":"aubrey_de_grey","published_at":"2007-02-13 21:37:00","updated_at":"2015-07-09 22:13:25"}}