{"speaker":{"id":3404,"title":"","firstname":"Katie","middleinitial":"","lastname":"Bouman","description":"Imaging scientist","whotheyare":"Katie Bouman is part of an international team of astronomers that's creating the world's largest telescope to take the very first picture of a black hole.","whylisten":"<p>It is believed that the heart of the Milky Way hosts a four-million-solar-mass black hole feeding off a spinning disk of hot gas. An image of the shadow cast by the event horizon of the black hole could help to address a number of important scientific questions. For instance, does Einstein&#39;s theory of general relativity hold in extreme conditions? Unfortunately, the event horizon of this black hole appears so small in the sky that imaging it would require a single-dish radio telescope the size of the entire Earth. Although a single-dish telescope this large is unrealizable, by connecting disjoint radio telescopes located all around the globe, Katie Bouman and a team of astronomers are creating an Earth-sized computational telescope -- the Event Horizon Telescope -- that is capable of taking the very first up-close picture of a black hole.<\/p><p>Bouman is a PhD candidate in the Computer Science and Artificial Intelligence Laboratory (CSAIL) at the Massachusetts Institute of Technology (MIT). The focus of her research is on using emerging computational methods to push the boundaries of interdisciplinary imaging. By combining techniques from both astronomy and computer science, Bouman has been working on developing innovative ways to combine the information from the Event Horizon Telescope network to produce the first picture of a black hole. Her work on imaging for the Event Horizon Telescope has been featured on&nbsp;<a href=\"http:\/\/www.bbc.com\/news\/science-environment-38937141\" target=\"_blank\">BBC<\/a>,&nbsp;<a href=\"http:\/\/www.bostonglobe.com\/metro\/2016\/06\/06\/ever-wondered-what-black-hole-looks-like-mit-here-help\/UhL2NbyNWgX3U9UY0VHVZK\/story.html\" target=\"_blank\">The Boston Globe<\/a>,&nbsp;<a href=\"https:\/\/www.washingtonpost.com\/news\/the-switch\/wp\/2016\/06\/07\/this-technology-may-finally-help-us-figure-out-what-black-holes-really-look-like\/\" target=\"_blank\">The Washington Post<\/a>,&nbsp;<a href=\"http:\/\/www.popsci.com\/new-algorithm-might-help-us-see-black-holes\" target=\"_blank\">Popular Science<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/www.marketplace.org\/shows\/marketplace-tech\/marketplace-tech-tuesday-june-7-2016\" target=\"_blank\">NPR<\/a>.<\/p>","slug":"katie_bouman","published_at":"2017-03-28 15:25:00","updated_at":"2017-04-04 15:01:58"}}