{"speaker":{"id":3406,"title":"","firstname":"Ari","middleinitial":"","lastname":"Wallach","description":"Futurist","whotheyare":"Ari Wallach helps leaders more consciously and ethically shape tomorrow.","whylisten":"<p>Ari Wallach challenges the perception that &quot;the future&quot; is solely a technology-fueled project occurring at some far off point in time. By exploring the underpinnings of civilizational potential over the ages he shows the future is actually manifesting right now -- and that it is very much human.<\/p><p>Wallach founded&nbsp;<a href=\"http:\/\/www.synthesiscorp.com\/\" target=\"_blank\">Synthesis Corp.<\/a>&nbsp;in 2008 with the belief that individuals, organizations and leaders have more power to shape what comes next than they realize. Synthesis Corp. has created and built full-scale future focused innovation labs and strategies for organizations ranging from CNN and the US State Department to Auburn Seminary and the Pew Research Center. Most recently, Wallach and his team created and launched the global innovation lab for the&nbsp;<a href=\"http:\/\/www.unhcr.org\/innovation\/\" target=\"_blank\">UN Refugee Agency<\/a>&nbsp;as well as their US focused&nbsp;<a href=\"https:\/\/www.fastcompany.com\/3063368\/future-of-philanthropy\/the-science-behind-inspiring-more-support-for-refugees\" target=\"_blank\">The Hive<\/a>. As founder of <em>Fast Company<\/em> magazine&#39;s &quot;FastCo Futures with Ari Wallach,&quot; Wallach convenes and hosts conversations with world-changing thinkers and doers focused on future-proofing their business.<\/p><p>His original&nbsp;<a href=\"http:\/\/www.wired.co.uk\/article\/forget-short-termism\" target=\"_blank\">Longpath essay<\/a>&nbsp;in <em>Wired<\/em> magazine about the need to move beyond short-termism to ensure social progress brought Wallach to the forefront of conversations in the sustainability, urban planning and long-range forecasting sectors. As an adjunct Professor at Columbia University, Wallach lectures on the impact of technology on intertemporally resilient public policy and democratic institution building.&nbsp;<\/p><p>In the summer of 2017,&nbsp;<a href=\"http:\/\/www.longpath.org\/\" target=\"_blank\">Longpath&nbsp;<\/a>will launch as a networked action-tank focused on helping individuals and organizational leaders make critical decisions that take into account transgenerational impact.<\/p>","slug":"ari_wallach","published_at":"2017-04-03 15:49:00","updated_at":"2017-04-10 14:57:21"}}