{"speaker":{"id":3408,"title":"","firstname":"Jonathan","middleinitial":"","lastname":"Marks","description":"Bioethicist, lawyer","whotheyare":"Jonathan Marks works at the intersections of ethics, law and policy -- writing and speaking about torture, obesity, fracking, health care and other pressing issues of our time.","whylisten":"<p>After studying law at Oxford University, Jonathan Marks qualified as a barrister and mediator, and he spent a decade in full-time practice in London. He became an expert on human rights, working on cases about torture (the&nbsp;<a href=\"http:\/\/icarusfilms.com\/new2002\/pino.html\" target=\"_blank\"><em>Pinochet<\/em><\/a>&nbsp;case), the protection of privacy and personal data, and the regulation of food, drugs and the environment.<\/p><p>The Greenwall Fellowship in Bioethics and Health Policy at Johns Hopkins and Georgetown Universities led to his current appointment as Director of the Bioethics Program at Penn State University, where he is also affiliated with the Rock Ethics Institute, Penn State Law and the School of International Affairs. He remains an academic member of Matrix, a London barristers&#39; chambers with offices in Geneva.<\/p><p>Marks is passionate about teaching and lecturing, as his TED talk, and an article in the&nbsp;<a href=\"http:\/\/www.nytimes.com\/2012\/10\/26\/sports\/ncaafootball\/penn-state-students-explore-sandusky-abuse-scandal.html\" target=\"_blank\"><em>New York Times<\/em><\/a>&nbsp;both attest. The talk offers a preview of his book manuscript, <em>The Perils of Partnership<\/em>. It also draws on research he conducted during his six-year affiliation with the Edmond J. Safra Center for Ethics at Harvard and during residencies at the Hastings Center and at the Brocher Foundation in Geneva.<\/p><p>Learn more about Marks&#39;s ideas from several articles, essays, and op-eds&nbsp;<a href=\"https:\/\/sites.google.com\/site\/marksjonathan\/publications\" target=\"_blank\">here<\/a>.&nbsp;<br \/>&emsp;<\/p><div><br \/><\/div>","slug":"jonathan_marks","published_at":"2017-04-05 15:44:00","updated_at":"2018-12-03 18:03:40"}}