{"speaker":{"id":3410,"title":"","firstname":"Natasha","middleinitial":"","lastname":"Hurley-Walker","description":"Astronomer","whotheyare":"Natasha Hurley-Walker uses novel radio telescopes to explore the universe at some of the longest wavelengths of light.","whylisten":"<p>Dr. Natasha Hurley-Walker recently completed an astronomical survey of the entire southern sky, revealing the radio glow of our own Milky Way galaxy as well as hundreds of thousands of distant galaxies: the GaLactic and Extragalactic All-sky Murchison Widefield Array (GLEAM) survey. Unlike previous work, GLEAM is the first &quot;radio color&quot; survey, observed across such a wide range of frequencies that the unique spectrum of every object can be used to understand its underlying physics.<\/p><p>An Early-Career Research Fellow based at the Curtin University node of the International Centre for Radio Astronomy Research, in Perth, Western Australia, Hurley-Walker is part of the international Murchison Widefield Array (MWA) collaboration, spanning thirteen institutes across six countries. At her fingertips are tens of petabytes of data collected by the MWA since 2013, which she processes using powerful supercomputers at the nearby Pawsey Centre. Hurley-Walker earned a PhD in Radio Astronomy at the University of Cambridge by commissioning and using a new radio telescope to perform its first science observations. The experience directly transferred to the MWA, which she also helped to commission.<\/p><p>The MWA is a precursor to the Square Kilometer Array (SKA), what will be the largest radio telescope in the world, set to come online in the 2020s. By developing software and techniques to deal with data from the MWA, creating pathfinding maps of the sky and training a new generation of astronomers in cutting-edge techniques, Hurley-Walker is working to lay the scientific groundwork for the commissioning of the SKA. In 2016 Hurley-Walker was awarded an Australian SKA Fellowship in order to visit the SKA headquarters and transfer lessons from her commissioning experiences as well as develop her survey into a useful calibration model for the SKA.<\/p><p>Hurley-Walker is passionate about scientific outreach and keynoted talks in 2013 and 2017 at Astrofest, Australia&#39;s largest public astronomy festival. So that anyone in the world can see the sky with the same radio eyes as her, she created the&nbsp;<a href=\"http:\/\/gleamoscope.icrar.org\/\" target=\"_blank\">GLEAMoscope<\/a> , an interactive online viewer that shows the universe at radio wavelengths compared to other frequencies, including the more familiar &quot;optical&quot; spectrum. It being the 21st century, there&#39;s also an app: check out&nbsp;<a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.icrar.gleam&amp;hl=en\" target=\"_blank\">GLEAM on the Google Play store<\/a>. In 2017 Natasha won the &quot;Best Timelapse&quot; category in the Astofest astrophotography competition with her colleague John Goldsmith for their creation of&nbsp;<a href=\"https:\/\/vimeo.com\/188100117\" target=\"_blank\">a composite video showing both the optical and radio sky<\/a>. For more detail on Hurley-Walker&#39;s work, check out&nbsp;<a href=\"http:\/\/theconversation.com\/what-the-universe-looks-like-when-viewed-with-radio-eyes-66381\" target=\"_blank\">her article on TheConversation<\/a>.<\/p><p>Working with cutting-edge data is tough, but sometimes hides serendipitous gems which Hurley-Walker has unearthed, like&nbsp;<a href=\"http:\/\/adsabs.harvard.edu\/abs\/2015MNRAS.447.2468H\" target=\"_blank\">the faintest dying radio galaxy ever discovered<\/a>,&nbsp;<a href=\"http:\/\/adsabs.harvard.edu\/abs\/2015GeoRL..42.3707L\" target=\"_blank\">whistling plasma ducts in the Earth&#39;s ionosphere<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/adsabs.harvard.edu\/abs\/2017ApJ...836..174C\" target=\"_blank\">some of the youngest and weirdest radio galaxies ever found<\/a>. View a&nbsp;<a href=\"http:\/\/bit.ly\/nhwpapers\" target=\"_blank\">complete list of Hurley-Walker&#39;s publications<\/a>.<\/p>","slug":"natasha_hurley_walker","published_at":"2017-04-12 18:29:00","updated_at":"2017-04-19 12:08:14"}}