{"speaker":{"id":3413,"title":"","firstname":"Carina","middleinitial":"","lastname":"Morillo","description":"Autism advocate","whotheyare":"Carina Morillo is an advocate for the social inclusion of people with autism.","whylisten":"<p>Carina Morillo is a founding member and president of&nbsp;<a href=\"http:\/\/www.brincar.org.ar\/en\" target=\"_blank\">Fundaci&oacute;n Brincar<\/a>, a non-profit organization in Argentina that has worked since 2010 for a better quality of life of people with autism and their families.<\/p><p>Morillo started Fundaci&oacute;n Brincar -- inspired by her son Ivan, who is currently 16 years old and has autism -- because she strongly believes that although life with autism can be challenging, her family and others like it have the right to be happy. In spite of its high prevalence, most people still don&#39;t know what autism is about or how to help someone with autism. The foundation offers support services and training to families and professionals, community awareness programs and art and skills training for children, youth and adults on the autism spectrum. Brincar has trained more than 15,000 professionals and families, and it&nbsp;currently offers support services to more than 3,000 families throughout Argentina. The foundation&#39;s free virtual library monthly reaches 400,000 people per month throughout Latin America and Spain. Brincar is also founding member of the Argentina Network of Autism, and has become one of the leading autism references for both families, health professionals and teachers in Argentina and Latin America.<\/p><p>Morillo&nbsp;is actively working on the creation of an adult life platform for living with autism. Like many parents, her main concern is who will take care of her son during his adult life. Around one-third of people with autism remain nonverbal, and one-third have an intellectual disability, requiring 24\/7 support throughout their life. Existing facilities and services in Argentina and Latin America are limited to school age, with no residence or occupation solutions for anyone older than 18.<\/p><p>Morillo has been awarded the 2016 US Ambassador in Argentina Entrepreneur Prize and the 2014 Argentine Solidarity Prize. In April 2017, Fundaci&oacute;n Brincar was declared of Social Interest by the Congress of the City of Buenos Aires for its open community services. Morillo&nbsp;holds a BS in Business Administration degree of Babson College.<\/p>","slug":"carina_morillo","published_at":"2017-04-17 18:12:00","updated_at":"2017-06-07 15:11:07"}}