{"speaker":{"id":3443,"title":"","firstname":"Matilda","middleinitial":"","lastname":"Ho","description":"Serial entrepreneur, investor","whotheyare":"TED Fellow Matilda Ho is shaping the startup landscape to create more sustainable food systems in China.","whylisten":"<p>Matilda Ho is the&nbsp;founder and managing director of&nbsp;<a href=\"http:\/\/www.bitsxbites.com\/\" target=\"_blank\">Bits x Bites<\/a>, China&#39;s first food tech accelerator and VC fund that invests in entrepreneurs tackling global food system challenges.<\/p><p>With a mission to shape the future of food, Bits x Bites is a big step forward to inspire China&rsquo;s entrepreneurial community to bring new ideas to solve global issues. It also serves as a critical catalyst to give startups the confidence and connections to prosper and make a meaningful and scalable impact. Bits x Bites has invested in companies that include a silkworm-based snack food startup, a drinkable salad CPG startup and a young company building weatherproof, cloud-connected farms to enable local food production by anyone anywhere.<\/p><p>In addition to Bits x Bites, Ho has founded Yimishiji, one of China&#39;s first online farmers markets to bring organic and local produce to families. Yimishiji stands alone as a farm-to-table e-commerce platform that has engineered food education and transparency into the entire supply chain and customer experience, effectively reshaping the relationship between Chinese consumers and farmers.<br \/>Prior to entrepreneurship, she filled leadership roles at IDEO and BCG (The Boston Consulting Group) in both Shanghai and Washington DC. She holds an MBA from the University of Chicago Booth School of Business. She currently serves as an advisor on the board of Shinho, China&rsquo;s first and largest organic condiment company.<\/p><p>Ho is an emerging voice on food sustainability and entrepreneurship. She has been featured in articles by <em>Fast Company<\/em>, <em>South China Morning Post<\/em>&nbsp;and <em>Inc.<\/em> In 2017, she was named a TED Fellow and a GLG Social Impact Fellow.<\/p>","slug":"matilda_ho","published_at":"2017-04-23 22:24:00","updated_at":"2017-11-28 21:08:00"}}