{"speaker":{"id":3448,"title":"","firstname":"Elizabeth","middleinitial":"","lastname":"Wayne","description":"Biomedical engineer","whotheyare":"TED Fellow Dr. Elizabeth Wayne is a biomedical engineer and advocate for women in higher education.","whylisten":"<div>Dr. Elizabeth Wayne received her Bachelor&#39;s degree in Physics from the University of Pennsylvania, where she was a Ronald E. McNair Scholar and Moelis Access Science Scholar. She continued her education at Cornell University, where her research on the role of immune cells in cancer progression and their potential as drug delivery carriers was supported by funding from the National Cancer Institute Physical Sciences in Oncology Network and the Howard Hughes Medical Institute. In 2016, Wayne earned her PhD in biomedical engineering, where her work in immune cell-mediated drug delivery resulted in several publications and a technology patent. Her current research uses macrophages to delivery therapeutic genes to solid tumors.<\/div><div><br \/><\/div><div>Wayne is a strong advocate for women in science. She has been a chief organizer for the Conference for Undergraduate Women in Physics (CUWIP) at Cornell as well as a panelist and workshop leader at CUWiPs held at Yale and Harvard. She has received awards for her advocacy including the Constance and Alice Cook Award.<\/div><div><br \/><\/div><div>Wayne is currently a National Cancer Institute Cancer Nanotechnology Training Program Postdoctoral Fellow in the Eshelman School of Pharmacy at UNC-Chapel Hill. She was recognized as a 2017 TED Fellow for her cancer nanotechnology research and efforts to amplify voices of women in leadership and higher education through her podcast&nbsp;<a href=\"https:\/\/phdivaspodcast.wordpress.com\/\" target=\"_blank\">PhDivas<\/a>. Wayne has been featured in various publications including <em>Bust<\/em> Magazine, <em>Cornell Chronicle<\/em> and the <em>Los Angeles Times<\/em>.<\/div><div><br \/><\/div><div>As a speaker, Wayne works with high schools, colleges and nonprofit organizations across the country to encourage the inclusion of women in science.<\/div>","slug":"elizabeth_wayne","published_at":"2017-04-23 22:28:00","updated_at":"2017-10-17 19:50:44"}}