{"speaker":{"id":3454,"title":"","firstname":"Deborah","middleinitial":"","lastname":"Lipstadt","description":"Historian","whotheyare":"Deborah Lipstadt's research focuses on the development of Holocaust denial and how to fight for the truth in an era marked by \"alternative facts.\"","whylisten":"<p>Dr. Deborah E. Lipstadt, Dorot professor of Holocaust Studies at Emory University in Atlanta, was sued for libel in 1996 by David Irving for having called him a Holocaust denier. After a ten-week trial in London in 2000, in an overwhelming victory for Lipstadt, the judge found Irving to be a &quot;neo-Nazi polemicist&quot; who &quot;perverts&quot; history and engages in &quot;racist&quot; and &quot;anti-Semitic&quot; discourse. <em>The Daily Telegraph<\/em> (London) described the trial as having &quot;done for the new century what the Nuremberg tribunals or the Eichmann trial did for earlier generations.&quot; <em>The Times<\/em> (London) described it as &quot;history has had its day in court and scored a crushing victory.&quot; According to the <em>New York Times<\/em>, the trial &quot;put an end to the pretense that Mr. Irving is anything but a self-promoting apologist for Hitler.&quot;<\/p><p>The movie&nbsp;<a href=\"http:\/\/www.imdb.com\/title\/tt4645330\/\" target=\"_blank\"><em>Denial<\/em><\/a>, starring Rachel Weisz and Tom Wilkenson with a screenplay by David Hare, tells the story of this legal battle. &nbsp;It is based on Lipstadt&#39;s book,&nbsp;<a href=\"http:\/\/geni.us\/0GkN\" target=\"_blank\"><em>History on Trial: My Day in Court with a Holocaust Denier<\/em><\/a>&nbsp;(Harper Collins, 2006), and recently reissued as&nbsp;<a href=\"http:\/\/geni.us\/EsUz4Hz\" target=\"_blank\"><em>Denial<\/em><\/a>&nbsp;(Harper Collins, 2016). The film was nominated for a BAFTA as one of the best British films of the year.<\/p><p>Lipstadt has written most recently&nbsp;<a href=\"http:\/\/geni.us\/JB0W\" target=\"_blank\"><em>Holocaust: An American Understanding<\/em><\/a>&nbsp;(Rutgers, 2016), which explores how America has understood and interpreted the Holocaust since 1945.<\/p><p>Her previous book,&nbsp;<a href=\"http:\/\/geni.us\/ybrWw\" target=\"_blank\"><em>The Eichmann Trial<\/em><\/a>, (Schocken\/Nextbook, 2011) published in commemoration of the 50th anniversary of the Eichmann trial, was called by <em>Publisher&#39;s Weekly<\/em>, &quot;a penetrating and authoritative dissection of a landmark case and its after effects.&quot; The <em>New York Times<\/em> Book Review described Lipstadt as having &quot;done a great service by &hellip; recovering the event as a gripping legal drama, as well as a hinge moment in Israel&#39;s history and in the world&#39;s delayed awakening to the magnitude of the Holocaust.&quot;<\/p><p>She has also published&nbsp;<a href=\"http:\/\/geni.us\/g3L0b\" target=\"_blank\"><em>Beyond Belief: The American Press And The Coming Of The Holocaust, 1933-1945<\/em><\/a>&nbsp;(Free Press, 1986), which surveys what the American press wrote about the persecution of the Jews in the years 1933-1945. &nbsp;She is currently writing a book, <em>The Antisemitic Delusion: Letters to a Concerned Student<\/em> which will be published in 2018.<\/p><p>At Emory, Lipstadt&nbsp;directs the website known as&nbsp;<a href=\"https:\/\/www.hdot.org\/\" target=\"_blank\">HDOT<\/a>, Holocaust Denial on Trial, which contains a complete archive of the proceedings of Irving v. Penguin UK and Deborah Lipstadt. It also provides answers to frequent claims made by deniers. Lipstadt has won the Emery Williams Teaching Award, and she was selected for the award by alumni as the teacher who had most influenced them.<\/p><p>Lipstadt was a historical consultant to the United States Holocaust Memorial Museum,&nbsp;helping design the section of the Museum dedicated to the American Response to the Holocaust. She has held a Presidential appointment to the United States Holocaust Memorial Council (from Presidents Clinton and Obama) and was asked by President George W. Bush to represent the White House at the 60th anniversary of the liberation of Auschwitz.<\/p><p>Lipstadt has a BA from the City College of New York and an MA and PhD from Brandeis University.<\/p>","slug":"deborah_lipstadt","published_at":"2017-04-27 01:28:00","updated_at":"2017-05-02 15:19:36"}}