{"speaker":{"id":3457,"title":"","firstname":"Wendy","middleinitial":"","lastname":"Troxel","description":"Sleep researcher","whotheyare":"Wendy Troxel specializes in behavioral treatments for insomnia and other sleep disorders.","whylisten":"<p>Dr. Wendy Troxel is a Senior Behavioral and Social Scientist at RAND and Adjunct Professor of Psychiatry and Psychology at the University of Pittsburgh. She is a licensed clinical psychologist specializing in behavioral treatments for insomnia and other sleep disorders across the lifespan. Her research is funded by the National Heart Lung Blood Institute of the National Institutes of Health and the Department of Defense. Troxel&#39;s research focuses on the interface between sleep, social environment and health, as well as the implications for public policy. She is considered the leading authority on how sleep affects and is affected by close relationships.<\/p><p>Troxel has received several awards and honors for her research from national and international scientific societies, and her work has been published in top-tier medical and psychological journals. Her research has been widely cited in the national and international media, including print and television interviews on CBS Sunday Morning, Good Morning America, the <em>Wall Street Journal<\/em>, the <em>New York Times<\/em>, MSNBC and CNN, and she has a regular blog on Huffington Post. Her research on sleep was also featured in two best-selling books: Arianna Huffington&#39;s <em>Sleep Revolution<\/em> and David Randall&#39;s <em>Dreamland<\/em>, and she was a featured expert in the National Geographic documentary&nbsp;<a href=\"http:\/\/channel.nationalgeographic.com\/sleepless-in-america\/videos\/sleep-after-combat\/\" target=\"_blank\"><em>Sleepless in America<\/em><\/a>. She has published several highly influential RAND reports on&nbsp;<a href=\"https:\/\/www.rand.org\/pubs\/research_reports\/RR739.html\" target=\"_blank\">sleep loss in the US military<\/a>&nbsp;and the&nbsp;<a href=\"https:\/\/www.rand.org\/pubs\/research_reports\/RR1791.html\" target=\"_blank\">global economic implications of sleep loss<\/a>. She recently was one of the co-organizers and presenters at the first-ever national conference on&nbsp;<a href=\"https:\/\/www.schoolstarttimeconference.org\/\" target=\"_blank\">Adolescent Sleep, Health, and School Start Times<\/a>, and she will serve as guest editor on an upcoming special issue in the journal&nbsp;<a href=\"http:\/\/www.sleephealthjournal.org\/article\/S2352-7218(16)30045-6\/fulltext\" target=\"_blank\"><em>Sleep Health<\/em><\/a>&nbsp;on adolescent sleep and school start times.<\/p>","slug":"wendy_troxel","published_at":"2017-05-11 15:28:00","updated_at":"2017-05-18 15:29:39"}}