{"speaker":{"id":3458,"title":"","firstname":"Nina","middleinitial":"","lastname":"Fedoroff","description":"Molecular biologist","whotheyare":"Nina Fedoroff writes and lectures about the history and science of genetically modified organisms.","whylisten":"<p>Nina Fedoroff serves as science adviser to several organizations, including&nbsp;<a href=\"http:\/\/www.ofwlaw.com\/\" target=\"_blank\">OFW Law<\/a>&nbsp;and the&nbsp;<a href=\"http:\/\/globalknowledgeinitiative.org\/\" target=\"_blank\">Global Knowledge Initiative<\/a>&nbsp;(GKI) in Washington, DC and the&nbsp;<a href=\"https:\/\/www.santafe.edu\/\" target=\"_blank\">Santa Fe Institute<\/a>&nbsp;in Santa Fe, NM. With former Secretary of Agriculture Jack Block, she recently published a <em>New York Times<\/em> editorial titled &quot;<a href=\"https:\/\/www.nytimes.com\/2016\/04\/06\/opinion\/mosquito-vs-mosquito-in-the-battle-over-the-zika-virus.html\" target=\"_blank\">Mosquito vs. Mosquito in the Battle Over the Zika Virus<\/a>.&quot;<\/p><p>Fedoroff was trained as a molecular biologist and geneticist at the Rockefeller University in New York City. The university awarded her an honorary doctorate in 2008 as one of its most distinguished alumni on the occasion of its 50th anniversary.<\/p><p>Fedoroff&#39;s early scientific accomplishments include analyzing a curious enzyme that replicates the RNA genome of a tiny RNA virus and sequencing of one the first genes ever to be sequenced. On the strength of this work, she was appointed a member of the scientific staff of the Carnegie Institution for Science&rsquo;s Department of Embryology. Her most important contributions began when she met the legendary biologist&nbsp;<a href=\"https:\/\/www.nap.edu\/read\/4990\/chapter\/11\/\" target=\"_blank\">Barbara McClintock<\/a>&nbsp;in 1978. She was intrigued by McClintock&rsquo;s pioneering work on transposable elements, commonly known as &quot;jumping genes,&quot; in corn plants.<\/p><p>McClintock&#39;s work was purely genetic, hence Fedoroff set out to study her jumping genes at the molecular level. That meant figuring out how to clone plant genes, none of which had yet been cloned. In fact, people had begun to wonder whether plant genes could be cloned at all. Solving the technical problems, Fedoroff and her students unraveled the molecular details of how these mobile DNA sequences move and how the plants exert epigenetic control of their movement. This work led to her election to the National Academy of Sciences in 1990. Her capstone book on transposable elements entitled&nbsp;<em><a href=\"http:\/\/geni.us\/p5kzScG\" target=\"_blank\">Plant Transposons and Genome Dynamics in Evolution<\/a>&nbsp;,<\/em>was published in 2013.<\/p><p>Fedoroff moved the Penn State University in 1995 as the Director of the Biotechnology Institute and Vern M. Willaman Chair in Life Sciences. Here she organized a multidisciplinary graduate and research program now known as the&nbsp;<a href=\"https:\/\/www.huck.psu.edu\/\" target=\"_blank\">Huck Institute of the Life Sciences<\/a>. Her laboratory research shifted to understanding how plants respond to stress and how they process small regulatory RNAs from larger precursors. She also began to dance Argentine tango. And she wrote a book with science writer Nancy Marie Brown titled&nbsp;<a href=\"http:\/\/geni.us\/DEamyA\" target=\"_blank\"><em>Mendel in the Kitchen: A Scientist&rsquo;s View of Genetically Modified Foods<\/em><\/a>.<\/p><p>The year 2007 was marked by two extraordinary events in Fedoroff&#39;s life. She was named a&nbsp;<a href=\"https:\/\/www.nationalmedals.org\/laureates\/nina-v-fedoroff\/\" target=\"_blank\">National Medal of Science<\/a>&nbsp;laureate for 2006 and she was appointed as the&nbsp;<a href=\"http:\/\/science.psu.edu\/news-and-events\/2007-news\/Fedoroff7-2007-2.htm\" target=\"_blank\">Science and Technology Adviser to the Secretary of State<\/a>&nbsp;by then-Secretary of State Condoleeza Rice. The science advisory position gave her an unexpected bully pulpit to talk about the importance of science in diplomacy, about which she was&nbsp;<a href=\"http:\/\/www.nytimes.com\/2008\/08\/19\/science\/19conv.html\/\" target=\"_blank\">interviewed<\/a>&nbsp;by Claudia Dreifus of the <em>New York Times<\/em>. It also gave her many opportunities to talk about genetic modification and GMOs all over the world. Realizing that development efforts would benefit from increased involvement of scientists, she organized the GKI, an NGO that builds collaborative networks around problems requiring scientific and technological input.<\/p><p>Completing her advisory work at the State Department in 2010, Fedoroff was recruited to the new&nbsp;<a href=\"https:\/\/www.kaust.edu.sa\/en\/\" target=\"_blank\">King Abdullah University of Science<\/a>&nbsp;and Technology (KAUST) as a Distinguished Professor of the Life Sciences. At KAUST, Fedoroff organized a&nbsp;<a href=\"https:\/\/cda.kaust.edu.sa\/Pages\/Home.aspx\/\" target=\"_blank\">Center for Desert Agriculture<\/a>, seeking to address the difficulties facing agriculture in increasingly populous dryland areas.<\/p><p>Today Fedoroff continues write and lecture internationally, most recently keynoting the 2017&nbsp;<a href=\"https:\/\/us.eventbu.com\/mantua\/food-science-festival-mantova-5-6-7-maggio-2017\/2665190.amp\/\" target=\"_blank\">Mantua Food and Science Festival<\/a>&nbsp;in Mantua, Italy. She continues to dance tango, traveling to Buenos Aires each of the past couple of years.&nbsp;<\/p>","slug":"nina_fedoroff","published_at":"2017-05-23 18:54:00","updated_at":"2017-06-02 14:58:47"}}