{"speaker":{"id":3461,"title":"","firstname":"Nikki","middleinitial":"","lastname":"Webber Allen","description":"Multimedia producer","whotheyare":"Nikki Webber Allen is working to create a safe space for honest conversations about mental health in communities of color.","whylisten":"<p>Nikki Webber Allen is a two-time Emmy winner with 20 years of experience producing content for media outlets including Warner Bros., HBO, ABC, 20th Century Fox and BET.<\/p><p>In 2013, while working as the vice president of casting and talent relations for the cable network TV One, Webber Allen lost her 22-year old nephew, Paul, to suicide after his years of struggle with depression and anxiety. Since then, she&#39;s become a passionate mental health advocate.<\/p><p>In Paul&#39;s honor, she launched the nonprofit I LIVE FOR... FOUNDATION, INC. to create a safe space for honest, unapologetic conversations about mental health in communities of color, where the cultural stigma of mental illness discourages far too many people from seeking help. Michael Eric Dyson, advisor to the foundation, has called I LIVE FOR&hellip; &quot;an incredibly important organization that offers much-needed support to those who too often suffer in silence.&quot;<\/p><p>Webber Allen is currently producing and directing a documentary film featuring a diverse group of compelling young men and women who reject the stigma of mental illness and share candid stories about their experiences living with depression and anxiety. The film is being scored by her husband, musician Jeffrey Allen of the Grammy-nominated R&amp;B band Mint Condition.<\/p><p>In 2016, Webber Allen was one of only 47 people chosen out of more than 1,000 applicants worldwide to receive a coveted scholarship to Marie Forleo&#39;s B-School for social entrepreneurs. She has an M.A. in media studies from The New School University in New York, NY and a B.A. in communications from Rutgers University in New Brunswick, NJ.<\/p>","slug":"nikki_webber_allen","published_at":"2017-06-05 18:51:00","updated_at":"2017-10-05 14:45:07"}}