{"speaker":{"id":3466,"title":"","firstname":"Duarte","middleinitial":"","lastname":"Geraldino","description":"Journalist","whotheyare":"Duarte Geraldino is working on a multi-year project that chronicles the lives of citizens who lose people to deportation.","whylisten":"<p>Duarte Geraldino is an American journalist who travels the country documenting how culture is being changed and challenged by shifting demographics, business&nbsp;and technology. He leads a team of skilled journalists who produce multimedia reports and short films that have been distributed around the world through national and global news networks. He&nbsp;is currently working on a multi-year project that chronicles the lives of citizens who lose people to deportation called <em>Hear Our Stories Now<\/em>.&nbsp;<\/p><p>He is currently a special correspondent for&nbsp;<a href=\"http:\/\/www.pbs.org\/newshour\/author\/duarte-geraldino\/?aaaaaa\" target=\"_blank\">PBS NewsHour<\/a>. At the NewsHour, he reports and writes long-form television stories about business trends like the housing crisis that is gripping many American cities and developments in labor laws that some see as choking middle and low-income workers.<\/p><p>In 2017, one of Geraldino&#39;s short documentaries,&nbsp;<a href=\"http:\/\/www.dominicanfilmfestival.com\/movies\/ordered-out\/\" target=\"_blank\"><em>Ordered Out<\/em><\/a>, was screened in New York&#39;s Times Square as part of the Dominican Film Festival New York. It explores the impact of American identity and immigration and tells the story of a family being torn apart by US laws. In the same year, he was selected as a&nbsp;<a href=\"\/profiles\/7302745\" target=\"_blank\">TED Resident<\/a>.&nbsp;During his residency at TED&#39;s global headquarters, he started developing a digital journalism project to document the lives of US citizens who have lost people to deportation.<\/p><p>Previously, Geraldino worked as a National Correspondent for Al Jazeera America and as a local news reporter in New York, Ohio, Texas and Maryland.<\/p>","slug":"duarte_geraldino","published_at":"2017-06-05 18:55:00","updated_at":"2017-09-19 20:12:19"}}