{"speaker":{"id":3476,"title":"","firstname":"Carlos","middleinitial":"","lastname":"Bautista","description":"Entrepreneur, creative technologist","whotheyare":"TED Resident Carlos Bautista wants to close the information and technology gap for people in developing countries.","whylisten":"<p>Carlos Bautista is working to develop MineSafe: a crowd-sourced information system for people in landmine-affected areas around the world. MineSafe aimsto&nbsp; analyze and deliver safe paths and reliable information for their daily commutes.<\/p><p>Bautista in an entrepreneur and creative technologist who has collaborated with other professionals to create a number of companies and research projects, ranging from a tailored shoe&nbsp;company&nbsp;to an&nbsp;<a href=\"http:\/\/augmentedapm.com\/\" target=\"_blank\">augmented reality app<\/a>&nbsp;that helps military personnel to deactivate landmines. He&#39;s worked with start-ups in New York City, helping them to develop and implement technological tools to enhance their educational services, using human-centered design methodologies.<\/p><p>As a professor, Bautista&nbsp;coached a team of young women during the summer of 2017, guiding them through the design thinking process at the Cornell and CUNY&nbsp;<a href=\"https:\/\/tech.cornell.edu\/impact\/witny\" target=\"_blank\">Women in Technology in NY<\/a>&nbsp;(WiTNY) program. This experience allowed students to experiment with the use of empathy to develop successful technological products. Bautista has also taught classes at the Polit&eacute;cnico Grancolombiano in interactive design, 3D design and animation, web design, augmented reality and descriptive geometry. Bautista&nbsp;led the process of opening the Industrial Design program in Polit&eacute;cnico Grancolombiano, which opened in 2015.<\/p><p>Bautista&nbsp;is based in NYC working as a research associate at Tandon School of Engineering&#39;s computer science department, under the supervision of professor&nbsp;<a href=\"http:\/\/engineering.nyu.edu\/people\/claudio-silva\" target=\"_blank\">Claudio Silva<\/a>, Interim Director of Center for Data Science. Together they are working to develop MineSafe to help people in rural areas of the world to move freely and safely without worrying about landmines.<\/p>","slug":"carlos_bautista","published_at":"2017-06-05 19:03:00","updated_at":"2017-10-26 19:58:57"}}