{"speaker":{"id":348,"title":"","firstname":"Jill","middleinitial":"","lastname":"Tarter","description":"Astronomer","whotheyare":"SETI's Jill Tarter has devoted her career to hunting for signs of sentient beings elsewhere. Winner of the 2009 TED Prize, almost all aspects of her field have been affected by her work.","whylisten":"<p>Astronomer Jill Tarter is director of the SETI (Search for Extraterrestrial Intelligence) Institute&#39;s Center for SETI Research, and also holder of the Bernard M. Oliver Chair for SETI. She led Project Phoenix, a decade-long SETI scrutiny of about 750 nearby star systems, using telescopes in Australia, West Virginia and Puerto Rico. While no clearly extraterrestrial signal was found, this project was the most comprehensive targeted search for artificially generated cosmic signals ever undertaken. <\/p><p>Tarter serves on the management board for the Allen Telescope Array, a massive instrument that will eventually include 350 antennas, and that has already increased the speed and the spectral range of the hunt for signals by orders of magnitude. With&nbsp;<a href=\"\/participate\/ted-prize\/prize-winning-wishes\/setilive\" target=\"_blank\">the 2009 TED Prize<\/a>, Tarter launched SETILive, a citizen project that allowed volunteers to stream live data from the array and help with the search.&nbsp;<\/p> <p>Tarter&#39;s life work is chronicled in the book,&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/1681774410\/ref=as_li_tl?ie=UTF8&amp;tag=teco06-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=1681774410&amp;linkId=82bcad9e0f879b6fefb467a058a66ed7\" target=\"_blank\"><em>Making Contact: Jill Tarter and the Search for Extraterrestrial Intelligence<\/em><\/a>. She&#39;s deeply committed to the education of future citizens and scientists. Beyond her scientific leadership at NASA and the SETI Institute, Tarter has been actively involved in developing curriculum for children. She was Principal Investigator for two curriculum development projects funded by NSF, NASA, and others. One project, the <em>Life in the Universe<\/em> series, created 6 science teaching guides for grades 3-9. The other project, <em>Voyages Through Time<\/em>, is an integrated high school science curriculum on the fundamental theme of evolution in six modules: Cosmic Evolution, Planetary Evolution, Origin of Life, Evolution of Life, Hominid Evolution and Evolution of Technology. She also created the TED-Ed lesson, <a href=\"http:\/\/ed.ted.com\/lessons\/calculating-the-odds-of-intelligent-alien-life\" target=\"_blank\">&quot;Calculating the Odds of Intelligent Alien Life.<\/a>&quot;<\/p> ","slug":"jill_cornell_tarter","published_at":"2008-12-03 17:55:00","updated_at":"2017-11-15 17:41:51"}}