{"speaker":{"id":3481,"title":"","firstname":"Cheyenne","middleinitial":"","lastname":"Cochrane","description":"Storyteller","whotheyare":"Cheyenne Cochrane is an ambassador for the natural hair movement.","whylisten":"<p>Cheyenne Cochrane is a storyteller who leverages digital and social media to share her ideas and experiences with her followers and subscribers, seasoned with a dash of humor. A Chicago native and Howard University Graduate, Cochrane lives to inspire, inform and connect with diverse audiences. She is currently the development manager for a national education non-profit. When she&#39;s not raising funds to support educational equity for underserved students around the country, she is the creator and visionary behind&nbsp;<a href=\"http:\/\/www.onmylevelchey.com\/\" target=\"_blank\">The Level Up<\/a>&nbsp;blog, as well as her social media brand,&nbsp;<a href=\"https:\/\/www.instagram.com\/onmylevel_chey\" target=\"_blank\">@onmylevel_chey<\/a>.<\/p><p>Cochrane began documenting her natural hair journey in 2014, while struggling to maintain the integrity of her hair after so many years of applying heat and harsh chemicals. She wanted to adopt a new routine, but like so many other women of color&nbsp;she&#39;d been programmed to believe that straight, long hair was the most appealing, most professional and widely accepted look for a black woman. She knew that deciding to &quot;go natural&quot; would be a journey of self-exploration and would require her to let go of the conventional standards of beauty that she&#39;d adhered to for so many years. What she did not know, however, was how many other women she&#39;d inspire and empower along the way by sharing her journey.<\/p><p>Today, Cheyenne continues to share her natural hair story and lessons with women around the world via her social media platforms and YouTube channel. She also maintains a blog where she posts about all things natural hair and beauty, millennial culture and features young entrepreneurs of color.<\/p><a href=\"http:\/\/www.onmylevelchey.com\/\" target=\"_blank\"><\/a> ","slug":"cheyenne_cochrane","published_at":"2017-06-08 16:37:00","updated_at":"2017-06-22 15:08:10"}}