{"speaker":{"id":349,"title":"","firstname":"José Antonio","middleinitial":"","lastname":"Abreu","description":"Maestro","whotheyare":"José Antonio Abreu founded El Sistema in 1975 to help Venezuelan kids learn to play musical instruments and be part of an orchestra. The TED Prize winner's bold idea has seeded hundreds of youth orchestras -- and many happy lives.","whylisten":"<p>In Venezuela, the gulf between rich and poor is one of the starkest in the world. Jos&eacute; Antonio Abreu -- economist, musician and reformer --&nbsp;founded El Sistema (&quot;the system&quot;) in 1975 to help Venezuelan kids take part in classical music. Four decades on, El&nbsp;Sistema is a nationwide network of youth orchestras, choirs and music centers -- and more than 750,000 young musicians.&nbsp;<\/p><p>El Sistema uses music education to help kids from impoverished circumstances achieve their full potential and learn values that favor their growth. Several El Sistema students have gone on to major international careers, including Gustavo Dudamel, music director of the Los Angeles Philharmonic, and the bassist Edicson Ruiz, who at 17 became the youngest musician ever to join the Berlin Philharmonic. These talented musicians are a source of national pride<strong>.&nbsp;<\/strong><\/p><p>There is a simple concept behind Abreu&#39;s work: for him an orchestra is a place where children learn to listen to each other and to respect one another. This idea has rippled out to 55 countries -- from Afghanistan to Wales. With the&nbsp;<a href=\"\/participate\/ted-prize\/prize-winning-wishes\/sistema-fellows-program\" target=\"_blank\" onclick=\"window.open('','','');return false;\">2009 TED Prize<\/a>, Abreu created the&nbsp;<a href=\"http:\/\/necmusic.edu\/archives\/sistema-program\" target=\"_blank\" onclick=\"window.open('','','');return false;\">Sistema Fellows Program<\/a>, an iniative to train music educators passionate about social justice in the United States. Sistema Fellows have planted youth orchestras in 20 American cities, teaching more than 5,000 students.&nbsp;<\/p>","slug":"jose_antonio_abreu","published_at":"2009-02-18 01:00:00","updated_at":"2018-03-26 17:38:33"}}