{"speaker":{"id":3495,"title":"","firstname":"Tricia","middleinitial":"","lastname":"Wang","description":"Technology ethnographer","whotheyare":"With astronaut eyes and ethnographer curiosity, Tricia Wang helps corporations grow by discovering the unknown about their customers.","whylisten":"<p>For Tricia Wang, human behavior generates some of the most perplexing questions of our times. She has taught global organizations how to identify new customers and markets hidden behind their data, amplified IDEO&#39;s design thinking practice as an expert-in-residence, researched the social evolution of the Chinese internet, and written about the &quot;elastic self,&quot; an emergent form of interaction in a virtual world. Wang is the co-founder of&nbsp;<a href=\"http:\/\/suddencompass.com\/\" target=\"_blank\">Sudden Compass<\/a>, a consulting firm that helps companies unlock new growth opportunities by putting customer obsession into practice.<\/p><p>Wang&#39;s work has been featured in The Atlantic, Al Jazeera, and The Guardian. Fast Company spotlighted her work in China: <a href=\"https:\/\/www.fastcompany.com\/1842561\/what-twitter-can-learn-weibo-field-notes-global-tech-ethnographer-tricia-wang\" target=\"_blank\">&quot;What Twitter Can Learn From Weibo: Field Notes From Global Tech Ethnographer Tricia Wang.&quot;<\/a>&nbsp;In her latest&nbsp;<a href=\"http:\/\/www.slate.com\/blogs\/future_tense\/2015\/12\/15\/proposals_to_stop_terrorists_on_social_media_could_harm_privacy_anonymity.html\" target=\"_blank\">op-ed on Slate<\/a>, she discusses how attempts to stop terrorists on social media can harm our privacy and anonymity. Her Medium post,&nbsp;<a href=\"https:\/\/medium.com\/ethnography-matters\/why-big-data-needs-thick-data-b4b3e75e3d7\" target=\"_blank\">&quot;Why Big Data Needs Thick Data,&quot;<\/a>&nbsp;is a frequently cited industry piece on the importance of an integrated data approach. One of her&nbsp;<a href=\"https:\/\/www.triciawang.com\/updates\/2012\/8\/1\/new-article-dumplings-for-sale-what-migrant-work-is-really-l.html\" target=\"_blank\">favorite essays<\/a>&nbsp;documents her day in the life of working as a street vendor in China.<\/p><p>Known for her lively presentations that are grounded in her research and observations about human behavior and data, Wang has spoken at organizations such as Proctor &amp; Gamble, Nike, Wrigley, 21st Century Fox and Tumblr.&nbsp;Her most recent talk at&nbsp;<a href=\"https:\/\/2017.enterpriseux.net\/\" target=\"_blank\">Enterprise UX<\/a>&nbsp;delved into why corporate innovation usually doesn&rsquo;t work and what to do about it. She delivered the&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=gw3SddWa9DQ\" target=\"_blank\">opening keynote at The Conference<\/a>&nbsp;to a crowd of marketers and creatives, delving into the wild history of linear perspective and its influence on how we think and form organizations.<\/p><p>Wang holds affiliate positions at Data &amp; Society, Harvard University&#39;s Berkman Klein Center for Internet Studies and New York University&#39;s Interactive Telecommunication Program. She oversees&nbsp;<a href=\"http:\/\/ethnographymatters.net\/\" target=\"_blank\">Ethnography Matters<\/a>, a site that publishes articles about applied ethnography and technology. She co-started&nbsp;<a href=\"https:\/\/ethnographymatters.net\/blog\/2016\/01\/25\/we-have-a-slack-join-us-at-ethnography-hangout-to-discuss-applied-ethnography\/\" target=\"_blank\">a Slack community<\/a>&nbsp;for anyone who uses ethnographic methods in industry.<\/p><p>Wang began her career as a documentary filmmaker at NASA, an HIV\/AIDS activist, and an educator specializing in culturally responsive pedagogy. She is also proud to have co-founded the first national hip-hop education initiative, which turned into the Hip Hop Education Center at New York University, and to have built after-school technology and arts programs for low-income youth at New York City public schools and the Queens Museum of Arts. Her life philosophy is that you have to go to the edge to discover what&rsquo;s really happening. She&#39;s the proud companion of her internet famous dog,&nbsp;<a href=\"https:\/\/www.instagram.com\/ellethedog_\/\" target=\"_blank\">#ellethedog<\/a>.<\/p>","slug":"tricia_wang","published_at":"2017-06-22 19:34:00","updated_at":"2017-12-04 21:23:56"}}