{"speaker":{"id":3501,"title":"","firstname":"Tania","middleinitial":"","lastname":"Douglas","description":"Biomedical engineering professor","whotheyare":"Tania Douglas imagined how biomedical engineering could help address some of Africa's health challenges.","whylisten":"<p>Tania Douglas&#39;s research interests included medical imaging and image analysis, the development of contextually appropriate technology to improve health and health innovation management, particularly the mechanisms of medical device innovation in South Africa.<\/p><p>Douglas engaged in capacity building for biomedical engineering and needs-based health technology innovation at universities across the African continent; two such projects are &quot;Developing Innovative Interdisciplinary Biomedical Engineering Programs in Africa,&quot; in collaboration with Northwestern University and the Universities of Lagos and Ibadan, and &quot;African Biomedical Engineering Mobility,&quot; in collaboration with Kenyatta University, Cairo University, Addis Ababa University, the Mbarara University of Science and Technology, the University of Lagos, and the University of Pisa.&nbsp;<\/p><p>Douglas was the founding Editor-in-Chief of Global Health Innovation, an electronic open-access journal focusing on social and technological innovation for improved health. The journal aims to serve as a platform for disseminating research on health innovation in developing settings.&nbsp;<\/p><p>Douglas was a Humboldt Research Fellow at the Max Planck Institute for Neurological Research in Cologne and at the Free University of Berlin, an Honorary Senior Research Fellow at University College London, a Visiting Professor at Kenyatta University, and a Visiting Scholar at Northwestern University. She was a fellow of the South African Academy of Engineering, a member of the Academy of Science of South Africa, and a Fellow of the International Academy for Medical and Biological Engineering.<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>","slug":"tania_douglas","published_at":"2017-07-07 15:23:00","updated_at":"2021-03-31 14:31:59"}}