{"speaker":{"id":3502,"title":"","firstname":"Sethembile","middleinitial":"","lastname":"Msezane","description":"Artist","whotheyare":"Sethembile Msezane deconstructs the act of public commemoration -- how it creates myths, constructs histories, includes some and excludes others.","whylisten":"<p>With masked face and powerful gestures, Sethembile Msezane disrupts and deconstructs the process of commemorative practice in South Africa, demanding space next to colonial-era statues for her country&#39;s, and her gender&#39;s, erased histories. In one iconic work, she performed at the removal of the John Cecil Rhodes statue at the University of Cape Town (&quot;Chapungu: The Day Rhodes Fell,&quot; 2015), and starting in 2013 she performed a series of pieces called &quot;Public Holiday&quot; that place her body in contrast to colonial-era monuments in Cape Town&#39;s CBD.<\/p><p>Msezane is a ANTI Festival International Prize for Live Art nominee (2017). She is the TAF &amp; Sylt Emerging Artist Residency Award winner (2016), and she is the first recipient of the Rising Light award at the Mbokodo Awards. She is also a a Barclays L&rsquo;Atelier Top 10 Finalist (2016). Her 2017 solo show at Gallery MOMO is titled &quot;<a href=\"https:\/\/www.gallerymomo.com\/exhibition\/sethembile-msezane-i-kwasuka-sukela-re-imagined-bodies-of-a-south-african-90s-born-woman\/\" target=\"_blank\">Kwasuka Sukel: Re-imagined Bodies of a (South African) &#39;90s Born Woman<\/a>&quot;, and features sculptural work that places colonial images in the context of Victorian-style furniture and dress, reframing and reclaiming a part of colonial history. She was one of the selected artists for gallery solo projects at the FNB Joburg Art Fair (2017), and her work is currently housed in the Zeitz MOCAA&nbsp;collection as well as Iziko South African National Gallery&#39;s collection.<\/p><p>Selected group shows include &quot;Women&#39;s Work and The Art of Disruptions&quot; at the Iziko South African National Gallery (2016), &quot;Dis(colour)ed Margins&quot; at the National Gallery of Zimbabwe (2017), &quot;Re[as]sisting Narratives&quot; at Framer Framed, Amsterdam (2016), &quot;Dance, if you want to enter my country!\/ Global Citizen&quot; at GoetheOnMain, Johannesburg (2016), &quot;Nothing Personal&quot; at SMAC Gallery, Cape Town, #theopening at Greatmore Studios, Cape Town (2016) and &quot;Translations&quot; at Emergent Art Space and Reed College, Portland, Oregon (2015).<\/p>","slug":"sethembile_msezane","published_at":"2017-07-07 15:50:00","updated_at":"2017-09-20 13:23:36"}}