{"speaker":{"id":3508,"title":"","firstname":"Natsai Audrey","middleinitial":"","lastname":"Chieza","description":"Founder, designer","whotheyare":"Operating at the intersection of design, nature and technology, Natsai Audrey Chieza is an internationally recognized leader in the rapidly emerging field of biodesign.","whylisten":"<p>Natsai Audrey Chieza is founder and creative director of&nbsp;<a href=\"https:\/\/faberfutures.com\/\" target=\"_blank\">Faber Futures<\/a>, an innovation lab and creative agency exploring the potential of living systems and biotechnologies to generate new models for sustainable futures. The studio advocates a shift in thinking away from resource extraction to material systems that are grown within planetary boundaries. Working with partners in academia and industry, she is at the forefront of defining the future of design in the context of the Anthropocene and the advent of enabling technologies like synthetic biology.<\/p><p>Chieza holds an MA in architecture from the University of Edinburgh and an MA in material futures from Central Saint Martins. She began her career in design research at Textile Futures Research Centre while pursuing her own research interests in biofabrication at the Ward Lab, University College London. During this time. she cocurated exhibitions and public programs including Big Data, Designing with the Materials of Life 2015, Alive En Vie, Fondation EDF, 2014 and Postextiles, London Design Festival 2011.<\/p><p>Chieza has been a designer in residence at Ginkgo Bioworks, IDEO, Machines Room, Swedish Arts Grants Committee and the Ward Lab, University College London. Her work has been widely exhibited at world-renowned galleries and museums, including the Victoria and Albert Museum, Science Gallery Dublin, Bauhaus Dessau, Audax Textile Museum and at industry institutions like Microsoft Research and Fondation EDF.<\/p><p>Chieza has taught degree programs that are transitioning to biomaterials and sustainable design at Central Saint Martins, The Bartlett and Istituto Marangoni. Her own body of work on biopigmented textiles has been featured in a number of leading publications, including <em>WIRED<\/em>, <em>Next Nature<\/em>, <em>IDEO<\/em>, <em>Huffington Post<\/em>, <em>Viewpoint<\/em>, <em>Frame<\/em>, <em>Domus<\/em>, <em>LSN Global<\/em>, <em>Protein<\/em> and <em>FORM<\/em>.<\/p>","slug":"natsai_audrey_chieza","published_at":"2017-07-07 19:03:00","updated_at":"2021-03-22 16:54:00"}}