{"speaker":{"id":3524,"title":"","firstname":"Kym","middleinitial":"","lastname":"Worthy","description":"Prosecutor","whotheyare":"Kym Loren Worthy is the prosecutor of Wayne County, Michigan, home to Detroit.","whylisten":"<div>Kym Loren Worthy is the first African-American woman to serve as a county prosecutor in Michigan. She became internationally recognized for prosecuting then Detroit Mayor Kwame Kilpatrick at the beginning of March 2008.<\/div><div>&nbsp;<\/div><div>Worthy started as an assistant prosecutor in the Wayne County Prosecutor&#39;s&nbsp;office in 1984. She served in this position for ten years, becoming the first African-American special assignment prosecutor under Prosecutor John O&#39;Hair. Her most notable prosecution was the trial of Walter Budzyn and Larry Nevers in the beating death of Malice Green. Worthy had an over 90 percent conviction rate. From 1994 to January 2004, Worthy was a judge on the Wayne County Circuit Court Criminal Division. In 2004, Worthy was appointed by the judges of the Wayne County Circuit Court bench to replace Detroit mayor Mike Duggan, who had resigned to become the head of the Detroit Medical Center.<\/div><div><br \/><\/div><div>The Wayne County Prosecutor&#39;s Office is by far the busiest in Michigan. There are 83 counties in Michigan, but Worthy&#39;s office handles 52 percent of all felony cases in Michigan and 64 percent of all serious felony cases that go to jury trial. In 2013, Worthy sued Wayne County, alleging that Wayne County Executive Robert A. Ficano had provided her with an insufficient budget to fulfill her duties as outlined in the Michigan State Constitution. In June 2014, Worthy backed Warren Evans in his successful race to oust then Wayne County Executive Robert A. Ficano in the Democratic Primary.<\/div><div><br \/><\/div><div>Worthy is currently working on resolving a massive backlog of unprocessed rape test kits in Detroit. In 2009, one of her assistants discovered a stockpile of kits sitting in a warehouse that the Detroit Police Department had used as an overflow storage facility for evidence. Eventually, over 11,431 rape test kits -- some of which had been sitting unprocessed for a decade or more -- were discovered in the warehouse. In one case, a 2002 rape was linked to a man who was incarcerated for three murders he committed in the seven years after the rape. She is currently featured in the documentary produced by Mariska Hargitay,&nbsp;<a href=\"https:\/\/www.iamevidencethemovie.com\/\" target=\"_blank\"><em>I Am Evidence<\/em><\/a>.<\/div>","slug":"kym_worthy","published_at":"2017-07-10 15:29:00","updated_at":"2018-09-26 14:58:52"}}