{"speaker":{"id":3536,"title":"","firstname":"DK","middleinitial":"","lastname":"Osseo-Asare","description":"Designer","whotheyare":"DK Osseo-Asare creates architecture with and for the people that design overlooks.","whylisten":"<p>Africa today has the youngest population and fastest rate of urbanization on the planet. How can we amplify indigenous innovation continent-wide to accommodate the needs of Africa&rsquo;s next billion urban dwellers? Collaborating with thousands of young people in West Africa over the past decade, DK Osseo-Asare has pioneered new approaches to design and deliver architecture and inclusive innovation to people living in resource-constrained environments: reframing the micro-architectures of &quot;kiosk culture&quot; as urban infrastructure for resilience; experimenting with &quot;bambots,&quot; or bamboo architecture robots; and prototyping off-grid in the Niger Delta an open-source model of hybrid rural\/urban development for Africa.<\/p><p>In 2012, Osseo-Asare and Yasmine Abbas launched the&nbsp;<a href=\"https:\/\/qamp.net\/\" target=\"_blank\">Agbogbloshie Makerspace Platform<\/a>&nbsp;(AMP), a community-based project to empower grassroots makers in Africa and beyond. Co-designed with over a thousand youth in and around Agbogbloshie scrapyard in Accra, Ghana -- infamously mischaracterized as &quot;the world&#39;s largest e-waste dump&quot; -- AMP Spacecraft is an open architecture for &quot;crafting space&quot; that links a mobile structure with modular toolsets to help makers make more and better, together. AMP has deployed three spacecraft to date, with the goal of networking a pan-African fleet of maker kiosks that enable youth to reimagine (e-)waste as raw material for building digital futures, recycle better and unlock their creative potential to remake the world.<\/p><p>Osseo-Asare is co-founding principal of&nbsp;<a href=\"https:\/\/www.lowdo.net\/\" target=\"_blank\">Low Design Office<\/a>&nbsp;(LOWDO), a trans-Atlantic architecture and integrated design studio based in Ghana and Texas. He co-founded the&nbsp;<a href=\"http:\/\/www.ashesi.edu.gh\/about\/8-academics\/business-administration16\/2452-department-of-business-administration-d-lab.html\" target=\"_blank\">Ashesi Design Lab<\/a>&nbsp;as Chief Maker and is&nbsp;<a href=\"https:\/\/stuckeman.psu.edu\/faculty\/dk-osseo-asare\" target=\"_blank\">Assistant Professor<\/a>&nbsp;of Architecture and Engineering Design at Penn State University, where he runs the Humanitarian Materials Lab (HuMatLab) and serves as Associate Director of Penn State&rsquo;s Alliance for Education, Science, Engineering and Design with Africa (AESEDA).<\/p>","slug":"dk_osseo_asare","published_at":"2017-07-14 20:14:00","updated_at":"2018-08-15 16:10:45"}}