{"speaker":{"id":3539,"title":"","firstname":"Olúfẹ́mi","middleinitial":"","lastname":"Táíwò","description":"Historian, philosopher","whotheyare":"Drawing on a rich cultural and personal history, Olúfẹ́mi Táíwò studies philosophy of law, social and political philosophy, Marxism, and African and Africana philosophy.","whylisten":"<p>Ol&uacute;fẹ́mi T&aacute;&iacute;w&ograve; is professor of African political thought at the Africana Studies and Research Center at Cornell University in the US. As he writes: &quot;I was born in Nigeria. I lived there all my life save for the five unbroken years that I sojourned in Canada in search of the proverbial Golden Fleece. By itself, my living in Nigeria does not warrant comment. But the discovery that I speak of put that life in a completely different light; hence these remarks. All my life in Nigeria, I lived as a Yor&ugrave;b&aacute;, a Nigerian, an African, and a human being. I occupied, by turns, several different roles. I was a hugely successful Boy Scout. I was a well-read African cultural nationalist. I was a member of the Nigerian province of the worldwide communion of the Church of England who remains completely enamored of the well-crafted sermon and of church music, often given to impromptu chanting from memory of whole psalms, the Te Deum or the Nunc Dimittis. I was a student leader of national repute. I was an aspiring revolutionary who once entertained visions of life as a guerilla in the bush. I was a frustrated journalist who, to his eternal regret, could not resist the call of the teaching profession. I was an ardent football player of limited talent. I was a budding spiritualist who has since stopped professing faith. Overall, I always believed that I was put on Earth for the twin purposes of raising hell for and catching it from those who would dare shame humanity through either ignorance or injustice or poverty.&quot;<\/p><p>T&aacute;&iacute;w&ograve; is the author of <em>Legal Naturalism: A Marxist Theory of Law<\/em> (1996\/2015), <em>How Colonialism Preempted Modernity in Africa<\/em> (2010) and <em>Africa Must Be Modern: A Manifesto<\/em> (2012\/2014).<\/p>","slug":"olu_fe_mi_ta_i_wo","published_at":"2017-07-15 15:59:00","updated_at":"2017-09-19 15:08:10"}}