{"speaker":{"id":3542,"title":"","firstname":"Chika","middleinitial":"","lastname":"Ezeanya-Esiobu","description":"Indigenous knowledge expert","whotheyare":"Working across disciplines, Chika Ezeanya-Esiobu explores homegrown and grassroots approaches to the sustainable advancement of Sub-Saharan Africa.","whylisten":"<p>Chika Ezeanya-Esiobu is convinced of the ability of Africans to transform the continent by acknowledging the significance of its indigenous knowledge in all fields of human endeavor. A researcher, fiction and non-fiction writer, public intellectual and teacher, Ezeanya-Esiobu has published several research papers on aspects of Africa&#39;s indigenous knowledge. She has also been commissioned to conduct indigenous knowledge-based research by the International Development Research Center Canada, United Nations University World Institute for Development Economics Research,(UNU-WIDER) United Nations Research Institute for Social Development (UNRISD) and The Swedish International Development Agency (Sida), among others.&nbsp;<\/p><p>Ezeanya-Esiobu is the author of the historical fiction book&nbsp;<a href=\"http:\/\/geni.us\/5eYwj\" target=\"_blank\"><em>Before We Set Sail<\/em><\/a>. In its manuscript form, <em>Before We Set Sail<\/em> was one of six shortlisted out of over 250 submissions, made to the Penguin Publishers Award for African Writing in 2010. Following her TEDGlobal 2017 talk, Ezeanya-Esiobu shared an alphabet book series she had written for her daughter:&nbsp;<em>Dr. Chika&#39;s ABC for the African Child<\/em> (2017).<\/p><p>Ezeanya-Esiobu has lived and worked in four countries across three continents, and through her travels she has learned to value integrity, dignity, respect for self and others ... to be open to knowledge, to be happy and to smile a lot with her heart. Her lifetime passion is to contribute to efforts that would see to the unleashing of the suppressed creative and innovative energies buried deep in the hearts and minds of all Africans. She blogs at&nbsp;<a href=\"https:\/\/chikaforafrica.com\/\" target=\"_blank\">chikaforafrica.com<\/a>.<\/p>","slug":"chika_ezeanya_esiobu","published_at":"2017-07-15 16:15:00","updated_at":"2017-10-02 17:18:51"}}