{"speaker":{"id":3552,"title":"","firstname":"Kevin","middleinitial":"","lastname":"Njabo","description":"Conservation biologist","whotheyare":"Kevin Njabo is coordinating the development of UCLA's newly established Congo Basin Institute (CBI) in Yaoundé, Cameroon.","whylisten":"<p>Dr. Kevin Yana Njabo is the Associate Director and the Africa Director for the Center for Tropical Research (CTR), a part of the University of California, Los Angeles&rsquo; (UCLA) Institute of the Environment and Sustainability. He also holds a joint Assistant Professor appointment at both Institute of the Environment and Sustainability, and the Department of Environmental Health Sciences. He is responsible for supervising CTR&rsquo;s research teams in Africa and coordinating the development of UCLA&rsquo;s newly established Congo Basin Institute (CBI) in Yaound&eacute;, Cameroon. Dr. Njabo also serves as a Visiting Professor at the National University of Rwanda and the Higher Institute of Environmental Sciences, Yaound&eacute;, Cameroon.<\/p><p>His research interests are examining the link between biodiversity and human health where he attempts to address the underlying causes of this emergence and how they relate to changes in biodiversity. His area of research focuses on Africa as a platform for case studies of these relationships with the hope that this work will help develop new interdisciplinary tools and methods to forecast and mitigate risks to biodiversity and health, creating sound strategies to enhance the societal benefits of conserving biodiversity. He serves on several professional bodies including the Board of Governors and Global Vice President of the Society for Conservation Biology; Council Member of the Pan African Ornithological Congress Committee and member of the editorial board for Austin Environmental Sciences, a newly initiated peer-reviewed open access journal with an aim to develop a platform for innovative researchers working in the areas of Environmental Sciences.<\/p>","slug":"kevin_njabo","published_at":"2017-07-20 14:19:00","updated_at":"2018-01-10 17:00:37"}}