{"speaker":{"id":3554,"title":"","firstname":"Ronald","middleinitial":"S","lastname":"Sullivan Jr.","description":"Clinical professor of law","whotheyare":"Ronald Sullivan is a leading theorist in the areas of criminal law, criminal procedure, trial practice and techniques, legal ethics and race theory. ","whylisten":"<p>Professor Ronald Sullivan is the faculty director of the Harvard Criminal Justice Institute and the Harvard Trial Advocacy Workshop. Sullivan also serves as Faculty Dean of Winthrop House at Harvard College. He is the first African American ever appointed Faculty Dean in Harvard&#39;s history. He is a founding member and Senior Fellow of the Jamestown Project.<\/p><p>Sullivan has merged legal theory and practice over the course of his career in unique and cutting-edge ways. In 2014, he was tasked to design and implement a Conviction Review Unit (CRU) for the newly elected Brooklyn District Attorney. The CRU, designed to identify and exonerate wrongfully convicted persons, quickly became regarded as the model conviction integrity program in the nation. In its first year of operation alone, Sullivan discovered over 10 wrongful convictions, which the DA ultimately vacated. Some of the exonerated citizens had served more than 30 years in prison before they were released.<\/p><p>In 2008, Sullivan served as Chair, Criminal Justice Advisory Committee for then-Senator Barack Obama&#39;s presidential campaign. In this capacity, his committee made policy recommendations on a range of issues in an effort to put into practice some of the best research in the field. He also served as a member of the National Legal Advisory Group for the Barack Obama Presidential Campaign. Finally, Sullivan was appointed Advisor to the Department of Justice Presidential Transition Team.<\/p><p>In 2007, in the wake of Hurricane Katrina, Sullivan was asked to create a system to solve a criminal justice crisis. More than 6,000 citizens were incarcerated in and around New Orleans without representation and with all official records destroyed by Hurricane Katrina. Sullivan designed an indigent defense delivery system that resulted in the release of nearly all the 6000 inmates.<\/p><p>Sullivan still maintains an appellate and trial practice. He has represented persons ranging from politicians to professional athletes to recording artists to pro bono clients in criminal jeopardy. &nbsp;Representative clients include: The family of Michael Brown, former New England Patriot Aaron Hernandez and the family of Usaamah Rahim.&nbsp;<\/p><p>Sullivan is a Phi Beta Kappa graduate of Morehouse College and the Harvard Law School, where he served as President of the Harvard Black Law Students Association and as General Editor of the Harvard BlackLetter Law Journal.<\/p>","slug":"ronald_sullivan","published_at":"2017-07-26 21:57:00","updated_at":"2017-08-15 19:35:19"}}