{"speaker":{"id":3562,"title":"","firstname":"Jason","middleinitial":"","lastname":"Yang","description":"Violinist","whotheyare":"Jason Yang is recognized for his versatility on multiple instruments as well as his abilities in composing and producing.","whylisten":"<p>Jason Yang has become one of the most popular sensations on the acoustic and electric violin circuits in the US and abroad. With more than 197,000 subscribers and 35 million views on his YouTube channel, he reaches extremely diverse audiences through multiple genres of music.<\/p><p>Yang has performed all over the world with Madonna as her violinist. In 2012, he completed the MDNA Tour, which consisted of 88 sold-out shows throughout Europe, North America, South America and the Middle East. He also performed alongside Madonna and Stevie Wonder in the memorial tribute to Prince at the 2016 Billboard Music Awards.<\/p><p>Yang enjoys engaging in performances and projects in a wide spectrum, from playing a violin-soloing Joker in full prosthetic makeup for Warner Bros.&#39; &quot;Batman: Arkham City&quot; to delivering an emotional rendition of Cyndi Lauper&#39;s &quot;Girls Just Want to Have Fun&quot; on Glee. In 2013, he was contracted by HBO to score an arrangement from the &quot;Game of Thrones&quot; soundtrack to be performed by himself with a chamber orchestra at the official Season 2 release event in New York City. A few days later, he performed on The Colbert Report with fellow MDNA dancer, Lil Buck.<br \/>&nbsp;<br \/>In the corporate world, Yang has performed for clients such as Panasonic, Mazda, Adidas, Ford, Paul Mitchell, Hilton, Skechers, Frito-Lay, Wendy&rsquo;s, Telemundo, La Prairie and Amway Global.<br \/>&nbsp;<br \/>The New Jersey native is currently based in Los Angeles, where he graduated from the University of Southern California with a major in international relations and a minor in music industry.<\/p><div><br \/><\/div>","slug":"jason_yang","published_at":"2017-08-09 15:37:00","updated_at":"2017-08-11 10:40:19"}}