{"speaker":{"id":3564,"title":"","firstname":"Benjamin","middleinitial":"","lastname":"Grant","description":"Artist, author","whotheyare":"Through his mesmerizing satellite photographs, Benjamin Grant offers us a new way of seeing of our planet and ourselves. ","whylisten":"<p>By curating and composing high-resolution aerial imagery, Benjamin Grant has repurposed a medium once reserved for security experts into a tool that provides us with a thought-provoking look at human impact on our planet. As the founder of&nbsp;<a href=\"http:\/\/www.dailyoverview.com\/\" target=\"_blank\">Daily Overview<\/a>, he tells a story not only of man&#39;s relationship to the earth but also of how a determined search for novel perspectives can shift our psychology, inspire greater collaboration and stimulate visions for a better future.<\/p><p>Grant has grown Daily Overview into one of the most popular blogs on social media, garnering the largest following on Instagram (currently 556,000+ followers) of any brand with an environmental focus. His best-selling book&nbsp;<a href=\"http:\/\/geni.us\/pxBY\" target=\"_blank\"><em>Overview: A New Perspective of Earth<\/em><\/a>&nbsp;has been critically-acclaimed by the <em>New York Times<\/em>, <em>The Economist<\/em>, <em>Fast Company<\/em>, CNN and was selected as one of the &quot;Best Books of 2016&quot; by Amazon, The Smithsonian and the <em>Los Angeles Times<\/em>. First published in October 2016, the book has been translated into seven languages.<\/p><p>Images from Daily Overview have been featured in hundreds of publications around the world including the <em>New York Times<\/em>, <em>Washington Post<\/em>, <em>WIRED<\/em>, <em>The Economist<\/em>, VICE and more. Grant has shown large-format prints at numerous exhibitions around the world with noteworthy installations in Munich, San Francisco, New York, Tel Aviv, Los Angeles and Hjo, Sweden.<\/p>","slug":"benjamin_grant","published_at":"2017-08-10 14:15:00","updated_at":"2017-12-06 20:31:51"}}