{"speaker":{"id":3565,"title":"","firstname":"Chance","middleinitial":"","lastname":"Coughenour","description":"Digital archaeologist","whotheyare":"Chance Coughenour is recreating heritage and culture that's been lost throughout the world.","whylisten":"<p>Chance Coughenour enjoys the innovations made possible by uniting science and archaeological research, which was part of the inspiration in the founding of Rekrei. His previous work on a EU-funded project connected him with Matthew Vincent, an archaeologist and web developer, who together launched Rekrei (formally Project Mosul) on March 8 of 2015 after witnessing the destruction of heritage in northern Iraq. Their open-source, volunteer initiative strives for the digital reconstruction of lost heritage using crowdsourced images and photogrammetry, the process of using 2D images to create 3D models.<\/p><p>From the start, Rekrei aimed to crowdsource the virtual reconstruction of the destroyed objects in the Mosul Cultural Museum and eventually release a virtual museum to digitally preserve its memory. This has already been accomplished thanks to the&nbsp;<a href=\"http:\/\/www.economist.com\/blogs\/prospero\/2016\/05\/virtual-reality\" target=\"_blank\">Economist Media Lab<\/a>. The project has also expanded globally and continues to increase its activities thanks to our growing collaboration with public and private organizations, all of which has been achieved without any funding resources to date. The key ingredient to Rekrei is the online platform, which provides a simple user interface for identifying locations of destroyed heritage, uploading and sorting images, and a&nbsp;<a href=\"http:\/\/rekrei.org\/gallery\" target=\"_blank\">3D gallery<\/a>&nbsp;of completed reconstructions.<\/p><p>Coughenour has worked on research projects throughout Europe and the Americas. One of which is demonstrated in the documentary&nbsp;<a href=\"http:\/\/www.imdb.com\/title\/tt5671140\/?ref_=fn_al_tt_1\" target=\"_blank\"><em>Scanning the End<\/em><\/a>. He is a PhD candidate at the Institute for Photogrammetry at the University of Stuttgart. Coughenour&nbsp;joined&nbsp;<a href=\"https:\/\/www.google.com\/culturalinstitute\/beta\/\" target=\"_blank\">Google Arts &amp; Culture<\/a>&nbsp;where he coordinates cultural heritage preservation efforts on a global scale. He&#39;s responsible for organizing partnerships and leading projects which employ emerging technology for cultural heritage documentation, dissemination and education.<\/p>","slug":"chance_coughenour","published_at":"2017-08-10 21:05:00","updated_at":"2017-08-31 19:25:59"}}