{"speaker":{"id":3569,"title":"","firstname":"Erin Marie","middleinitial":"","lastname":"Saltman","description":"Policy researcher","whotheyare":"Dr. Erin Marie Saltman manages Facebook's counterterrorism and counter-extremism policy work for Europe, the Middle East and Africa. ","whylisten":"<p>Dr. Erin Marie Saltman&#39;s background and expertise includes both Far Right and Islamist extremist processes of radicalization within a range of regional and socio-political contexts. Her research and publications have focused on the&nbsp;<a href=\"https:\/\/preventviolentextremism.info\/sites\/default\/files\/Jihad%20Trending-%20A%20Comprehensive%20Analysis%20of%20Online%20Extremism%20and%20How%20to%20Counter%20it.pdf\" target=\"_blank\">evolving nature of online extremism and terrorism<\/a>,&nbsp;<a href=\"http:\/\/www.isdglobal.org\/wp-content\/uploads\/2016\/02\/Till_Martyrdom_Do_Us_Part_Gender_and_the_ISIS_Phenomenon.pdf\" target=\"_blank\">gender dynamics within violent extremist organizations<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/www.isdglobal.org\/wp-content\/uploads\/2016\/06\/YouthCAN-UN-PVE-Survey.pdf\" target=\"_blank\">youth radicalization<\/a>. Saltman has previously held senior research positions at Quilliam Foundation and the Institute for Strategic Dialogue, where she managed international programs. She has also worked with local activists, artists and techies to challenge violent extremism.<\/p><p>As Facebook&#39;s Counterterrorism Policy Manager based in London, Saltman regularly speaks with both governments and NGOs on issues related to&nbsp;<a href=\"https:\/\/newsroom.fb.com\/news\/2017\/06\/how-we-counter-terrorism\/\" target=\"_blank\">how Facebook counters terrorism<\/a>&nbsp;and violent extremism. She has also helped establish the&nbsp;<a href=\"https:\/\/newsroom.fb.com\/news\/2017\/06\/global-internet-forum-to-counter-terrorism\/\" target=\"_blank\">Global Internet Forum to Counter Terrorism<\/a>, bringing together leading industry partners (Facebook, Google, Microsoft and Twitter) with smaller startups and tech companies to create cross-platform knowledge sharing, technology solutions and research.&nbsp;<\/p><p>Saltman remains a Research Fellow at the Institute for Strategic Dialogue. She is a graduate of Columbia University (BA) and University College London (MA and PhD). View her articles and publications&nbsp;<a href=\"https:\/\/erinmariesaltman.wordpress.com\/articles-publications\/\" target=\"_blank\">here<\/a>.<\/p>","slug":"erin_marie_saltman","published_at":"2017-08-14 14:31:00","updated_at":"2017-09-05 19:55:46"}}