{"speaker":{"id":3573,"title":"","firstname":"Jennifer","middleinitial":"","lastname":"Granick","description":"Surveillance and cybersecurity counsel","whotheyare":"Jennifer Granick fights for civil liberties in the age of surveillance and powerful digital technology.","whylisten":"<p>As surveillance and cybersecurity counsel with the ACLU&#39;s Speech, Privacy and Technology Project, Jennifer Granick litigates, speaks and writes about privacy, security, technology and constitutional rights. Granick is the author of the book&nbsp;<a href=\"http:\/\/geni.us\/y3v2s\" target=\"_blank\"><em>American Spies: Modern Surveillance, Why You Should Care, and What To Do About It<\/em><\/a>, published by Cambridge Press and winner of the 2016 Palmer Civil Liberties Prize.&nbsp;<\/p><p>Granick spent much of her career helping create Stanford Law School&#39;s Center for Internet and Society. From 2001 to 2007, she was Executive Director of CIS and founded the Cyberlaw Clinic, where she supervised students in working on some of the most important cyberlaw cases that took place during her tenure. She was the primary crafter of a 2006 exception to the Digital Millennium Copyright Act which allows mobile telephone owners to legally circumvent the firmware locking their device to a single carrier. From 2012 to 2017, Granick was Civil Liberties Director specializing in and teaching surveillance law, cybersecurity, encryption policy and the Fourth Amendment. In that capacity, she has published widely on US government surveillance practices&nbsp;and helped educate judges and congressional staffers on these issues. Granick also served as the Civil Liberties Director at the Electronic Frontier Foundation from 2007-2010. Earlier in her career, Granick spent almost a decade practicing criminal defense law in California.&nbsp;<\/p><p>Granick&rsquo;s work is well-known in privacy and security circles. Her keynote, &quot;Lifecycle of a Revolution&quot; for the 2015 Black Hat USA security conference electrified and depressed the audience in equal measure. In March of 2016, she received Duo Security&rsquo;s Women in Security Academic Award for her expertise in the field as well as her direction and guidance for young women in the security industry. Senator Ron Wyden (D-Ore) has called Granick an &quot;NBA all-star of surveillance law.&quot;<\/p><a href=\"http:\/\/geni.us\/y3v2s\" target=\"_blank\"><\/a> ","slug":"jennifer_granick","published_at":"2017-08-18 15:26:00","updated_at":"2017-09-01 02:10:11"}}