{"speaker":{"id":3606,"title":"","firstname":"Azim","middleinitial":"","lastname":"Khamisa","description":"Author, peace activist","whotheyare":"Azim Khamisa speaks to students and adults on nonviolence, forgiveness and peace-building, and he is a founder of two nonprofit organizations that target youth violence.","whylisten":"<p><a href=\"http:\/\/www.azimkhamisa.com\/\" target=\"_blank\">Azim Khamisa<\/a> writes: &quot;I emigrated to the USA in 1974 to escape violence in Kenya, where we were a targeted minority. But 22 years ago, my only son, Tariq, who was a university student and worked a part-time job as a pizza delivery man, was killed by a 14-year-old gang member in a gang initiation ritual. Tariq was only 20 years old when he died, and needless to say it brought my life to a crashing halt. He was a good and a generous kid!<br \/><br \/>&quot;However, even clouded in a deeply painful tragedy I saw that there were victims on both sides of the gun. Nine months after Tariq died, I founded the <a href=\"http:\/\/tkf.org\/\" target=\"_blank\">Tariq Khamisa Foundation (TKF)<\/a>. Our mission is to save lives of children, empower the right choices and teach the principles of nonviolence &mdash; of empathy, compassion, forgiveness and peacemaking. I forgave my son&#39;s killer and <a href=\"http:\/\/theforgivenessproject.com\/stories\/azim-khamisa-ples-felix-usa\/\" target=\"_blank\">invited his grandfather to join me<\/a> in TKF&#39;s work. With the grace of God, TKF is 22 years old and has a safe school model and is successfully keeping kids away from gangs, weapons, drugs, crime and violence. The grandfather and I are still together doing this work, and the kid who killed my son is now 36 years old and he will join us when he is paroled in October 2018. I have authored <a href=\"https:\/\/www.amazon.com\/gp\/product\/0345506030\/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&amp;tag=teco06-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=0345506030&amp;linkId=d9c466f81180f0ee965d087ed91b05df\" target=\"_blank\">four books<\/a> and speak worldwide to students and adults. I am a passionate peace activist and a teacher of nonviolence, forgiveness and spawning peacemakers.&quot;<\/p>","slug":"azim_n_khamisa","published_at":"2017-09-10 20:02:00","updated_at":"2018-03-13 19:19:29"}}