{"speaker":{"id":3611,"title":"","firstname":"Hank Willis","middleinitial":"","lastname":"Thomas","description":"Artist","whotheyare":"Hank Willis Thomas is a conceptual artist working primarily with themes related to identity, history and popular culture. ","whylisten":"<p>Hank Willis Thomas&#39;s work has been exhibited throughout the U.S. and abroad including, the International Center of Photography, Guggenheim Museum Bilbao, Mus&eacute;e du quai Branly, and the Cleveland Museum of Art. His work is in numerous public collections including the Museum of Modern Art New York, the Solomon R. Guggenheim Museum, the Whitney Museum of American Art, the Brooklyn Museum, the High Museum of Art and the National Gallery of Art in Washington DC, among others.<\/p><p>Thomas&#39;s collaborative projects include&nbsp;<a href=\"http:\/\/questionbridge.com\/\" target=\"_blank\">Question Bridge: Black Males<\/a>,&nbsp;<a href=\"http:\/\/insearchofthetruth.net\/\" target=\"_blank\">In Search Of The Truth (The Truth Booth)<\/a>, and&nbsp;<a href=\"http:\/\/www.forfreedoms.org\/\" target=\"_blank\">For Freedoms<\/a>. For Freedoms was recently awarded the 2017 ICP Infinity Award for New Media and Online Platform. Thomas is also the recipient of the 2017 Soros Equality Fellowship and the 2017 AIMIA | AGO Photography Prize. Current exhibitions include&nbsp;<a href=\"https:\/\/www.prospectneworleans.org\/exhibition-description\/\" target=\"_blank\">Prospect 4: The Lotus in Spite of the Swamp<\/a>&nbsp;in New Orleans and All Things Being Equal at Zeitz Museum of Contemporary Art Africa. In 2017, Thomas also unveiled his permanent public artwork &quot;<a href=\"http:\/\/illuminatesf.com\/posts\/sto\/love-over-rules-yerba-buena\" target=\"_blank\">Love Over Rules<\/a>&quot; in San Francisco and &quot;<a href=\"http:\/\/www.miamiherald.com\/news\/local\/community\/miami-dade\/miami-gardens\/article180611461.html\" target=\"_blank\">All Power to All People<\/a>&quot; in Opa Locka, Florida. Thomas is a member of the Public Design Commission for the City of New York. He received a BFA in Photography and Africana studies from New York University and an MFA\/MA in Photography and Visual Criticism from the California College of Arts. He has also received honorary doctorates from the Maryland Institute of Art and the Institute for Doctoral Studies in the Visual Arts. He lives and works in New York City.<\/p>","slug":"hank_willis_thomas","published_at":"2017-09-10 21:28:00","updated_at":"2017-12-20 13:46:06"}}