{"speaker":{"id":3630,"title":"","firstname":"Naoko","middleinitial":"","lastname":"Ishii","description":"Environmental policy expert","whotheyare":"Naoko Ishii leads the Global Environment Facility (GEF), a public financial institution that provides around US$1 billion every year to help tackle our planet’s most pressing environmental problems.","whylisten":"<p>Since taking the helm at the&nbsp;GEF in 2012, Naoko Ishii, an economist by training, has steered the development and implementation of a new long-term strategy that addresses the underlying drivers of environmental degradation. She has put protecting the global commons -- our air, water, biodiversity, forests, land, oceans and a stable climate -- at its center.<\/p><p>Previously, Ishii was Deputy Vice Minister of Finance in Japan and has also worked at the World Bank and the IMF. As a sustainable development leader, Ishii strives to be build coalitions that address the &quot;<a href=\"http:\/\/www.thegef.org\/news\/defining-moment\" target=\"_blank\">defining moment<\/a>&quot; that we&#39;re in for the future of the planet. She is a leading advocate on&nbsp;<a href=\"https:\/\/www.thegef.org\/news\/reflections-25-years-gef-ceo-naoko-ishii\" target=\"_blank\">the need to make the environment everybody&#39;s business<\/a>, and she believes&nbsp;<a href=\"https:\/\/www.theguardian.com\/gef-partner-zone\/2016\/jul\/07\/safeguarding-the-global-commons-is-the-wisest-investment-we-can-make\" target=\"_blank\">safeguarding the global commons is, quite simply, the wisest investment we can make<\/a>.<\/p><p>Ishii has been&nbsp;<a href=\"https:\/\/www.greenbiz.com\/article\/meet-9-badass-women-fighting-climate-change-cities\" target=\"_blank\">profiled for her pioneering work<\/a>&nbsp;on cities and climate change, and she has highlighted&nbsp;<a href=\"http:\/\/sustainability.thomsonreuters.com\/women\/naoko-ishii-social-norms-and-the-barriers-to-progression\/\" target=\"_blank\">the role of women<\/a>&nbsp;in driving sustainable change around the world.<\/p>","slug":"naoko_ishii","published_at":"2017-09-17 02:56:00","updated_at":"2018-03-02 02:52:53"}}