{"speaker":{"id":3631,"title":"","firstname":"Per Espen","middleinitial":"","lastname":"Stoknes","description":"Psychologist, economist","whotheyare":"Per Espen Stoknes weaves together psychology and economics in imaginative ways, often revolving around our human relationships to the natural world and to each other. ","whylisten":"<p>Are humans inevitably short-term? This question has guided Per Espen Stoknes&#39;s research over the last decades, from psychology through economics to strategic business scenarios. But gradually, he&#39;s reframed it into a more positive twist: Under what conditions will humans take action for the long term in their everyday behaviors?<\/p><p>Stoknes works as the director for&nbsp;<a href=\"https:\/\/www.bi.edu\/research\/find-departments-and-research-centres\/research-centres\/centre-for-green-growth\/\" target=\"_blank\">Center for Green Growth<\/a>&nbsp;at the Norwegian Business School in Oslo. He&#39;s received several &quot;Best Professor&quot; awards for his original teaching style. As both an economist, author and psychologist, he&#39;s been working closely with organizational and business leaders throughout Scandinavia, the European Union as well as the Americas and Asia. In 2017-2018 he&rsquo;s representing the Green Party in the Norwegian parliament.<\/p><p>His latest book is&nbsp;<a href=\"http:\/\/geni.us\/I4zz\" target=\"_blank\"><em>What We Think About When We Try Not To Think About Global Warming<\/em><\/a>, which won the American Libraries Association&rsquo;s &quot;Outstanding Academic Title&quot; award for 2015.<\/p><p>Educated as a psychologist at the University of Oslo, Stoknes has since supplemented this with studies in organizational theory, philosophy and a PhD in economics. He has worked both as a clinical psychologist and strategy consultant, bringing imagination and creative expression into these spheres.&nbsp;<\/p><p>A popular speaker throughout Scandinavia, Stoknes lives in central Oslo. But he heads off to northern mountains or to his forest cabin in order to feel the free winds and get awe-struck as often as occasion allows.<\/p>","slug":"per_espen_stoknes","published_at":"2017-09-17 02:57:00","updated_at":"2017-11-19 16:31:15"}}