{"speaker":{"id":3651,"title":"","firstname":"Naomi","middleinitial":"","lastname":"McDougall Jones","description":"Actress, writer, producer, activist","whotheyare":"Naomi McDougall Jones is a vocal advocate and activist for bringing gender parity to film, both on and off screen.","whylisten":"<p>Naomi McDougall Jones is a storyteller and change maker.<\/p><p>McDougall Jones&#39; debut book,&nbsp;<a href=\"https:\/\/geni.us\/4Mt4\" target=\"_blank\"><em>The Wrong Kind of Women: Inside Our Revolution to Dismantle the Gods of Hollywood<\/em><\/a>, published by Beacon Press and expanding on her TED Talk, is available in hardcover, audiobook and e-book wherever books are sold.<\/p><p>McDougall Jones&#39;s award-winning second feature film,&nbsp;<a href=\"http:\/\/www.bitemethefilm.com\/\" target=\"_blank\"><em>Bite Me<\/em><\/a>, which she wrote, stars in and was a producer on, is a subversive romantic comedy about the real-life subculture of people who believe that they&#39;re vampires and the IRS agent who audits them. The film premiered at Cinequest, won Best Feature Film at VTXIFF and then went on to the innovative, paradigm-shifting Joyful Vampire Tour of America in summer 2019, a 51-screening, 40-city, three-month, RV-fueled eventized tour that involved Joyful Vampire Balls, capes, a docu-series and a whole lot of joy. The film is now available to watch on Seed&amp;Spark, Amazon, GooglePlay and iTunes.<\/p><p>McDougall Jones&#39;s first film, <em>Imagine I&#39;m Beautiful<\/em> (2014), which she also wrote, produced and starred in, took home 12 awards on the film festival circuit, including four Best Pictures and, for McDougall Jones, three Best Actress Awards and The Don Award for Best Independently Produced Screenplay of 2014. <em>Imagine I&#39;m Beautiful<\/em> is a &quot;haunting and empathetic&quot; psychological drama that dissects the fine line between self-invention and destruction. The film received a 10-city theatrical and digital release and is now available on iTunes, Amazon and GooglePlay.<\/p><p>McDougall Jones&#39; first book, <em>The Wrong Kind of Women: Inside Our Revolution to Dismantle the Gods of Hollywood<\/em>, will be published by Beacon Press in February 2020 and is now available for pre-order on all major platforms.<\/p><p>She is also currently at work on her third feature screenplay, <em>Hammond Castle<\/em>, a magical realism film that explores themes of identity, legacy and gender through a modern-day seven-month pregnant woman&#39;s unexpected interaction with the brilliant, eccentric and deceased inventor John Hays Hammond, Jr.,&nbsp;for which she received a place as the first artist-in-residence at Ernest Hemingway&#39;s final home in Sun Valley, Idaho.<\/p><p>She lives in Atlanta with her husband, Stephen. She grew up in Aspen, Colorado and attended Cornell University before graduating from The American Academy of Dramatic Arts.&nbsp;<\/p><p>(Photo:&nbsp;Alexandra Turshen)<\/p>","slug":"naomi_mcdougall_jones","published_at":"2017-09-19 15:09:00","updated_at":"2020-05-06 15:37:34"}}