{"speaker":{"id":3652,"title":"","firstname":"Marco","middleinitial":"","lastname":"Alverà","description":"Businessman, fairness crusader","whotheyare":"Marco Alverà is an Italian\/American businessman and CEO of Snam, Europe’s largest natural gas utility.","whylisten":"<p>Marco Alver&agrave; has 20 years of experience in Italy&#39;s most important energy companies. He holds a degree in Philosophy and Economics from the London School of Economics and started his career working at Goldman Sachs in London.&nbsp;<\/p><p>In 2002, Alver&agrave;&nbsp;joined Enel as Director of Group Corporate Strategy and a member of the management committee, contributing significantly to the development of the company&#39;s gas strategy. In 2004, he became Chief Financial Officer of Wind Telecom and oversaw the sale of Wind to Orascom.&nbsp;<\/p><p>In 2005, Alver&agrave;&nbsp;moved to Eni where he worked for 10 years holding various positions. He joined the company as Director of Supply &amp; Portfolio Development at the Gas &amp; Power Division, successfully navigating the group through the gas Russia-Ukraine gas crisis in the Winter of 2006. In 2008 he moved to Eni&#39;s Exploration &amp; Production Division as Executive Vice President for Russia, Northern Europe, and North and South America. In 2010 he was appointed Chief Executive Officer of Eni Trading and Shipping. In 2013, he took on responsibility for the Midstream business unit, which consolidates the results of Eni&#39;s Gas &amp; Power Division and brings together all of the supply, logistics and trading activities linked to energy commodities. He was later appointed Chief Retail Market Gas &amp; Power Officer at Eni.<\/p><p>Alver&agrave; is a Visiting Fellow of the University of Oxford. He currently serves as President of GasNaturally, non-executive director of S&amp;P Global and member of the General Council of the Giorgio Cini Foundation in Venice.<\/p>","slug":"marco_alvera","published_at":"2017-09-20 16:26:00","updated_at":"2018-02-14 12:21:17"}}