{"speaker":{"id":3657,"title":"","firstname":"Amel","middleinitial":"","lastname":"Karboul","description":"Education pioneer","whotheyare":"Dr. Amel Karboul builds bridges between the private, public sector and civil society to solve today’s global challenges in education.","whylisten":"<p>Amel Karboul nurtures and inspires a new generation of responsible leaders, teams and organizations to create breakthroughs in their thinking, to transform themselves and to work towards a just and sustainable future.<\/p><p>Together with the&nbsp;<a href=\"http:\/\/educationcommission.org\/\">Education Commission<\/a>&nbsp;team, she has played a leading role in a major global initiative engaging world leaders, policymakers and researchers, and she has developed a renewed and compelling investment case and financing pathway for achieving equal educational opportunity for children and young people.<\/p><p>Karboul has also built&nbsp;<a href=\"http:\/\/www.magef.org\/\">The Maghreb Economic Forum<\/a>&nbsp;(MEF) as a non-partisan think- and do-tank, and with her team she has engaged a new type of conversation between public and private audiences and nurtured new solutions for education (including de-radicalisation), employment, leadership and gender equality. She also co-lead the establishment of first democratic society in Arab nation, began economic reform and created and deployed effective pioneering digital media engagement between government and citizen on very limited budget as cabinet minister.<\/p><p>Karboul published her book,&nbsp;<a href=\"http:\/\/geni.us\/YxFPlFX\" target=\"_blank\"><em>Coffin Corner<\/em><\/a>, outlining a new leadership culture suited to the complexity and dynamics of the 21st century. Nominated as one of ten leading young African politicians, her professional brand is first and foremost that of a highly intelligent, well connected, creative and inspirational go-getter with a track record of making things happen.<\/p><p>Karboul received a Master&#39;s degree with honors in mechanical engineering from Karlsruhe Institute of Technology (KIT) in Germany and holds a Doctorate in Coaching and Mentoring from Oxford Brookes University in the United Kingdom. She has held leadership roles at numerous firms including Mercedes-Benz, DaimlerChrysler and worked in senior consultant roles at the Boston Consulting Group (BCG) and Beratergruppe Neuwaldegg as well as visiting faculty at DukeCE. Her two daughters, meditation and yoga keep her sane.<\/p>","slug":"dr_amel_karboul","published_at":"2017-09-20 17:19:00","updated_at":"2017-11-03 14:53:48"}}