{"speaker":{"id":3689,"title":"","firstname":"G.T.","middleinitial":"","lastname":"Bynum","description":"Mayor of Tulsa, Oklahoma","whotheyare":"G.T. Bynum is using data-driven outcomes and trackable goals to break down historic lines of division.","whylisten":"<p>G.T. Bynum&nbsp;the 40th Mayor of Tulsa,&nbsp;Oklahoma. Prior to his election as Mayor, Bynum served for eight years on the Tulsa City Council. During that time, he was elected as the youngest City Council Chairman in Tulsa history.<\/p><p>Throughout his time in Tulsa city government, Bynum has focused on fiscal restraint, public safety and infrastructure. He led the successful effort to enact the largest streets improvement package in the city&#39;s history, authored the first city sales tax cut in Tulsa history, doubled the number of police academies to increase manpower, authored legislation creating the first municipal rainy day fund in Oklahoma and coordinated efforts to establish the first municipal veterans treatment court in the United States.<\/p><p>In 2011, Bynum was selected as an Aspen Institute Rodel Fellow, a program which seeks to bring together 24 of the nation&#39;s most promising young elected leaders on a bipartisan basis, explore the responsibilities of public leadership and assist them in achieving their fullest potential in public service.<\/p><p>In 2014, Bynum was selected as the only city councilor in the nation to participate in the Moneyball for Government Fellowship Program, which aims to assist local governments in achieving better results with limited budgets through increasing the use of data, evidence and evaluation when spending taxpayer money.<\/p><p>Bynum is a proud graduate of two institutions operated by the Augustinian Order of the Catholic Church: Cascia Hall Preparatory School in Tulsa and Villanova University, where he served as Student Body President. He previously worked as the managing partner of Capitol Ventures, and before that in the United States Senate for Senators Don Nickles and Tom Coburn.&nbsp;<\/p><p>Mayor Bynum comes from a family dedicated to public service and he and his wife, Susan, are the proud parents of Robert and Annabel --the sixth generation of Bynums to call Tulsa home.<\/p>","slug":"g_t_bynum","published_at":"2017-10-18 18:30:00","updated_at":"2017-11-30 20:43:41"}}