{"speaker":{"id":3691,"title":"","firstname":"Luvvie","middleinitial":"","lastname":"Ajayi Jones","description":"Author, speaker, podcast host","whotheyare":"Luvvie Ajayi Jones is a two-time New York Times bestselling author, podcast host and sought-after speaker who thrives at the intersection of humor, media and justice.","whylisten":"<p>Luvvie Ajayi Jones&#39; critically acclaimed books,&nbsp;<a href=\"https:\/\/geni.us\/3qOQEk\" target=\"_blank\"><em>Professional Troublemaker: The Fear-Fighter Manual<\/em><\/a><em>&nbsp;<\/em>and&nbsp;<a href=\"http:\/\/geni.us\/FQsSyB\" target=\"_blank\"><em>I&#39;m Judging You: The Do-Better Manual<\/em><\/a>, were instant bestsellers and established her as a literary force with a powerful pen. An 18-year blogging veteran, she writes on her site,&nbsp;<a href=\"https:\/\/luvvie.org\/\" target=\"_blank\">Luvvie.org<\/a>,&nbsp;covering all things culture with a critical yet humorous lens. She connects with her audience through her social network, LuvvNation, a safe space for elevated conversations in a dumpster fire world. Additionally, she hosts a podcast called&nbsp;<em>Professional Troublemaker&nbsp;<\/em>where she talks with trailblazers who have committed to living life loudly -- with courage and conviction.<\/p><p>Ajayi Jones is an internationally recognized speaker who takes on dozens of stages every year around the globe and has spoken at some of the world&#39;s most innovative companies and conferences, including Google, Facebook, Amazon, Twitter, MAKERS and SXSW. She has received numerous accolades, including being chosen by Oprah Winfrey as part of her inaugural SuperSoul100 list as someone who &quot;elevates humanity.&quot; Her alma mater, the University of Illinois at Urbana-Champaign, honored her with the Outstanding Young Alumni Award and the Council of Urban Professionals presented her with their Breakthrough Award. Her work has been featured in outlets such as the <em>New York Times<\/em>, NPR, <em>Forbes<\/em>, <em>Inc<\/em>, <em>Fortune<\/em>, <em>Essence<\/em>, <em>Chicago Tribune<\/em> and more.<\/p><p>Born in Nigeria, bred in Chicago and comfortable everywhere, Ajayi Jones enjoys laying around in her plush robe, eating a warm bowl of jollof rice in her free time. Her love language is shoes.<\/p>","slug":"luvvie_ajayi","published_at":"2017-10-23 15:31:00","updated_at":"2022-03-21 15:01:50"}}