{"speaker":{"id":3694,"title":"","firstname":"Jason","middleinitial":"","lastname":"Webb","description":"Musical director","whotheyare":"Jason Webb is a writer, musical director, arranger, orchestrator, lecturer and a lover of music.","whylisten":"<p>From conducting orchestras in Broadway pits to writing and arranging music for a presidential inauguration, Jason&nbsp;Michael Webb has dedicated his life to using music to heal, uplift and encourage.<\/p><p>Webb;s early musical training consisted of formal classical study, playing in small churches and listening to pop music. By 21, he had a degree in classical piano, played in the biggest churches in New York City and made his orchestral solo debut with the Queens Symphony Orchestra. He then went on to become Musical Director of the six-time Grammy-winning Brooklyn Tabernacle, for whom he co-wrote and produced four albums for The Brooklyn Tabernacle Choir, leading to two Stellar Award nominations and a Dove Award win. His arrangement of BTC&#39;s &quot;The Battle Hymn of the Republic&quot; was featured at the 2013 inauguration of President Barack Obama and simultaneously heard by over one billion people worldwide.<\/p><p>Webb also recently served as musical director of the Tony- and Grammy-winning 2016 Broadway Revival of Oprah Winfrey&#39;s &quot;The Color Purple&quot;, directed by John Doyle and based on the timeless novel by Alice Walker. Webb is now currently the US Music Supervisor of the tour, as well as Music Director\/Arranger for Cynthia Erivo, who won a 2016 Tony Award as Celie in the Broadway Revival.<\/p><p>Mr. Webb&rsquo;s writing can also be heard on the TV series &quot;Empire&quot;, Netflix&rsquo;s film <em>Juanita<\/em>, and numerous recording projects and original musicals, including &quot;The First Noel&quot; (produced annually at the world famous Apollo Theater in Harlem, NYC) and the South African musical &quot;Ilathi,&quot; which premiered July 2017 at the New York Musical Festival. Webb has conducted live and recording orchestras from New York to LA, including pianist Lang Lang&#39;s 2016 love letter to NYC, &quot;New York Rhapsody&quot;, which featured performances by Rufus Wainwright, Regina Spektor and Suzanne Vega.<\/p>","slug":"jason_webb","published_at":"2017-10-24 01:10:00","updated_at":"2017-10-26 22:25:17"}}