{"speaker":{"id":3698,"title":"","firstname":"Mindy","middleinitial":"","lastname":"Scheier","description":"Fashion designer","whotheyare":"Mindy Scheier is the founder of the Runway of Dreams Foundation. Prior to launching the nonprofit, Mindy spent over 20 years working in fashion as a key member of the design team for the INC collection and stylist for Saks Fifth Avenue in New York City. ","whylisten":"<p>Mindy Scheier&#39;s career path took a new direction when her son Oliver, who has a rare form of muscular dystrophy that causes physical disabilities, wanted to wear jeans to school like his friends. She used her background in design to adapt a pair that not only met his needs&nbsp;but increased his confidence. She soon realized that millions of people around the globe were also struggling to access fashionable clothing and went on to conduct extensive research and focus groups with people of all abilities to better understand the challenges faced by the community. She used her experience in fashion to develop modifications -- including magnetic closures, adjustability of waistbands, pant and sleeve lengths and alternative ways to get in and out of the clothing -- to meet a wide variety of needs within the differently-abled community. After pounding the fashion pavement, Runway of Dreams collaborated with Tommy Hilfiger on the first ever-mainstream adaptive clothing line for kids in Spring 2016.<\/p><p>Scheier&#39;s work with Runway of Dreams Foundation expands beyond adaptive clothing. Founded on the basis that clothing is a basic human need, the Runway of Dreams Foundation develops, delivers and supports initiatives to broaden the reach of mainstream adaptive clothing and promote the differently-abled community in the fashion industry. Through adaptive clothing donations, employment opportunity initiatives, adaptive design workshops, awareness building campaigns and scholarships programs, the Runway of Dreams Foundation is empowering people with disabilities with opportunity, confidence, independence and style. Envisioning a world where fashion is mainstream and accessible for all, Scheier continues to break down barriers and challenge industry norms.<\/p>","slug":"mindy_scheier","published_at":"2017-11-08 22:57:00","updated_at":"2018-01-09 15:36:09"}}