{"speaker":{"id":3726,"title":"","firstname":"Amber","middleinitial":"","lastname":"Galloway-Gallego","description":"Sign language interpreter","whotheyare":"Amber Galloway-Gallego is a world-renowned ASL interpreter specializing in music. ","whylisten":"<p>Amber&nbsp;Galloway-Gallego has more than 18 years of sign language interpreting experience and has a master&#39;s in ASL\/English interpreting. Her certifications are National Certification RID CT&amp;CI, NIC, Texas BEI Level V, Oral Certified: Comprehensive. She has been featured in <em>Rolling Stone<\/em>, <em>Oprah<\/em>&nbsp;and <em>Out<\/em> magazines. <em>Vibe<\/em> Magazine referred to her the as the most recognized sign language interpreter and &quot;<a href=\"https:\/\/www.vibe.com\/photos\/meet-jay-z-hip-hop-sign-language\" target=\"_blank\">The Jay Z of Hip-Hop Sign Language<\/a>.&quot; On television, she has been featured in &quot;Totally Biased with W. Kamau Bell,&quot; &quot;Jimmy Kimmel Live&quot; and recently she was featured on &quot;The Steve Harvey Show.&quot; Galloway-Gallego uses her status to fight for access and equality in the Deaf community.<\/p><p>Frequently praised for her ability to passionately convey the connection between lyrics and sounds, Galloway-Gallego&#39;s music interpretations demonstrate the emotional bonds which have driven music lovers to concerts for years. Her interpretations bring the music to life in a way that&#39;s not often seen in music interpreting. Deaf audience members have often said they are able to connect to music performance more than they ever had in the past. Her interpretations delighted and inspired hearing music aficionados to learn sign language. Galloway-Gallego has always loved music and the Deaf community, but it was not until she saw the San Antonio Deaf Dance Company and the Wild Zappers perform that she realized that she could hone her interpreting skills to bridge the access gap in the music industry.<\/p>","slug":"amber_galloway_gallego","published_at":"2017-11-10 20:28:00","updated_at":"2018-12-14 14:06:29"}}