{"speaker":{"id":3758,"title":"","firstname":"Danielle","middleinitial":"","lastname":"Wood","description":"Space engineer and development scholar","whotheyare":"Danielle Wood designs satellites and space technology applications that contribute to sustainable development. ","whylisten":"<p>Dr. Danielle Wood has published extensive, novel research findings on emerging space activity in Africa, Latin America and South East Asia; advised senior leaders in the US government on technology policy and led teams of engineers and scientists to create satellite systems that contribute to public safety. As of January 2018, Dr. Wood directs the Space Enabled Research Group and serves as an Assistant Professor at the Media Lab in the Massachusetts Institute of Technology in Cambridge, Massachusetts, USA. The Mission of the&nbsp;<a href=\"https:\/\/www.media.mit.edu\/groups\/space-enabled\/overview\/\" target=\"_blank\">Space Enabled research group<\/a>&nbsp;is to advance justice in earth&#39;s complex systems using designs enabled by space. At Space Enabled, Wood designs innovative systems that harness space technology that support work toward the United Nations&nbsp;<a href=\"http:\/\/www.un.org\/sustainabledevelopment\/sustainable-development-goals\/\" target=\"_blank\">Sustainable Development Goals<\/a>.<\/p><p>Wood&#39;s research also develops systems analysis tools to improve decision making during the design of complex systems. Most recently, she worked as the Applied Sciences Manager within the Earth Science Division of Goddard Space Flight Center. Previously, she served as Special Assistant and Advisor to the Deputy Administrator at NASA Headquarters in Washington, DC. Prior to working at NASA, Wood held positions at the Aerospace Corporation, Johns Hopkins University and the&nbsp;<a href=\"http:\/\/www.unoosa.org\/\" target=\"_blank\">United Nations Office of Outer Space Affairs<\/a>. She studied at the Massachusetts Institute of Technology, where she earned a PhD in engineering systems, SM in aeronautics and astronautics, SM in technology policy and SB in aerospace engineering.<\/p>","slug":"danielle_wood","published_at":"2017-11-15 21:53:00","updated_at":"2018-02-02 13:15:03"}}