{"speaker":{"id":376,"title":"","firstname":"Jay","middleinitial":"","lastname":"Walker","description":"Entrepreneur","whotheyare":"Jay Walker is fascinated by intellectual property in all its forms. His firm, Walker Digital, created Priceline and many other businesses that reframe old problems with new IT. In his private life, he's a bibliophile and collector on an epic scale.","whylisten":"<p>It&#39;s befitting that an entrepreneur and inventor so prolific and acclaimed would curate a library devoted, as he says, to the astonishing capabilities of the human imagination. <em>TIME<\/em> twice named him one of the &quot;50 most influential business leaders in the digital age,&quot; and he holds more than 200 patents. Jay Walker&#39;s companies -- under Walker Digital -- have alone served tens of millions of people and amassed billions in value.&nbsp;<\/p><p>A chunk of his net worth went into building this enchanting library space, whose exhibits (please touch!) go back, roughly, to the point our species learned to write, with a slight post-moveable type bias. Brimming with exquisitely illustrated books and artifacts (Enigma machine; velociraptor skeleton), the library itself is a marvel. Is it the glowing etched glass panels, or the Vivaldi piped from hidden speakers that gives it that je ne sais quoi? Maybe it&#39;s Walker himself, whose passion for the stuff just glows. It&#39;s apparent to those lucky enough to snag a tour. <\/p><p>At the 2008 TED Conference, Walker lent many of his priceless and geeky artifacts to decorate the stage -- including a real Sputnik artificial satellite, a Star Wars stormtrooper helmet and a Gutenberg bible. After you&#39;ve watched his <a href=\"\/index.php\/talks\/jay_walker_s_library_of_human_imagination.html\" target=\"_blank\">talk<\/a>, the <a href=\"http:\/\/www.wired.com\/techbiz\/people\/magazine\/16-10\/ff_walker?currentPage=all\" target=\"_blank\"><em>WIRED<\/em> article<\/a> is a must-read. <\/p>","slug":"jay_walker","published_at":"2008-12-12 17:53:00","updated_at":"2009-04-08 15:28:00"}}