{"speaker":{"id":3797,"title":"","firstname":"Jeremy","middleinitial":"","lastname":"Forbes","description":"Life preserver","whotheyare":"Through his charity HALT, Jeremy Forbes aims to break through the stigma attached to mental health, raise awareness through education and empower men to open up conversations around mental health and suicide prevention.","whylisten":"<a href=\"https:\/\/jeremyforbes.com.au\/\" target=\"_blank\"><\/a><p style=\"white-space: normal\"><a href=\"https:\/\/jeremyforbes.com.au\/\" target=\"_blank\">Jeremy Forbes<\/a>&nbsp;is the co-founder&nbsp;of&nbsp;<a href=\"http:\/\/thehaltbrekky.com\/\" target=\"_blank\">HALT (Hope Assistance Local Tradies)<\/a>, which aims to build the bridge between the tradespeople or &quot;tradie&quot; community and both local and national support services. HALT facilitates this through &quot;Save Your Bacon&quot; meetings in hardware stores, where tradies feel socially included and comfortable.&nbsp;<\/p><p>Forbes and his co-founder Catherine Pilgrim&nbsp;founded HALT in 2013 after the suicide of a local tradesman in the Castlemaine, Australia area. HALT has now held over 200 events across Australia, reaching over 10,000 tradies, apprentices and community members. HALT has now expanded and is reaching out to sporting clubs, farming communities, building and construction apprentices, miners, corporate organizations and private businesses with a powerful message of suicide prevention.&nbsp;&nbsp;<\/p><p>Forbes travels across Australia and the world to tell his story and encourage and empower men to open up and have the tough conversations, as well as giving them the awareness of where to go to access help or help a mate if they need help. He was awarded a Westpac Social Change Fellowship through the Westpac Bicentennial foundation in 2016 and traveled to London and Oxford to talk about HALT and discover what the Uk were doing in the suicide prevention field. HALT was awarded a state award by Worksafe Victoria for its innovative approach to mental health and suicide prevention.<\/p>","slug":"jeremy_forbes","published_at":"2017-11-20 20:20:00","updated_at":"2018-05-24 19:53:53"}}