{"speaker":{"id":3827,"title":"","firstname":"Gautam","middleinitial":"","lastname":"Bhan","description":"Urbanist","whotheyare":"Gautam Bhan studies how cities produce and reproduce poverty and inequality.","whylisten":"<p>Gautam Bhan&#39;s work is based in and emerges from particular cities that for a long time were thought to be &quot;peripheral&quot; -- Delhi, Mumbai, Cairo, Lagos, Jakarta and Johannesburg -- cities of what is sometimes today called the &quot;global south.&quot; He feels passionate about producing knowledge not just about these cities&nbsp;but doing so from them. For too long, he says, &quot;Southern cities have been places for others to come and fix, rather than places with their own ways of getting things done that work for us.&quot;<\/p><p>Bhan believes that urbanization in the global south is one of the most profound challenges of the 21st century. It&#39;s in these cities that many of the battles of sustainability and equity will either be won or lost. He found his way to these questions in his own city -- New Delhi -- through forced evictions, the brutal demolition of the homes of the city&#39;s poorest who lived in informal settlements that brought him to his work on housing and the right to the city. His research is informed by his own political engagement both as an anti-eviction activist as well as someone working with the government to prevent evictions from occurring in the first place.&nbsp;<\/p><p>Bhan teaches as the Indian Institute for Human Settlements in Bangalore, a new educational institution that shares his intent of bringing together teaching, research and practice on the city as well as producing knowledge from the south. In 2017, he authored&nbsp;<a href=\"http:\/\/geni.us\/Ikvmb\" target=\"_blank\"><em>In the Public&rsquo;s Interest: Evictions, Citizenship and Inequality in Contemporary Delhi<\/em><\/a>&nbsp;(Orient Blackswan\/University of Georgia Press), as well as co-edited the&nbsp;<a href=\"http:\/\/geni.us\/1y0FW\" target=\"_blank\"><em>Routledge Companion to Planning in the Global South<\/em><\/a>&nbsp;(Routledge). He writes as much publicly as academically and is a frequent columnist in Indian newspapers, blogs and online. He is also the co-founder of&nbsp;<a href=\"http:\/\/newtext.in\/\" target=\"_blank\">New Text<\/a>, and he&#39;s deeply involved in sexuality rights movements in India.<\/p>","slug":"gautam_bhan","published_at":"2017-11-24 17:47:00","updated_at":"2017-12-12 00:35:36"}}