{"speaker":{"id":3845,"title":"","firstname":"Alvin","middleinitial":"","lastname":"Irby","description":"Educator, comedian, social entrepreneur, author","whotheyare":"Whether speaking to barbers about early literacy, entertaining strangers at comedy clubs, or reading to kindergarteners at a local school, TED Resident Alvin Irby endeavors to make learning relevant and engaging.","whylisten":"<p>Alvin Irby is a former kindergarten teacher turned social entrepreneur. He is founder and chief reading inspirer at&nbsp;<a href=\"https:\/\/barbershopbooks.org\/\" target=\"_blank\">Barbershop Books<\/a>, a nonprofit organization that creates child-friendly reading spaces in barbershops and provides early literacy training to barbers. His work connecting reading to male-centered spaces and involving men in boys&rsquo; early reading experiences earned him the National Book Foundation&#39;s 2017 Innovations in Reading Prize.<\/p><p>As a cultural competency specialist, Irby trains educators and administrators to translate learning objectives for children or adults into relevant and engaging communication and experiences. Irby&#39;s nationally recognized keynotes and workshops excavate his eclectic professional and personal life to better understand and address one of American education&rsquo;s greatest challenges - cultivating children&rsquo;s intrinsic motivation to read.&nbsp;&nbsp;<\/p><p>Irby&#39;s debut children&rsquo;s book,&nbsp;<a href=\"http:\/\/geni.us\/IB1aP2\" target=\"_blank\"><em>Gross Greg<\/em><\/a>, combines his passion for early literacy and comedy; it is a laugh-out-loud story that captures the hilariously gross behavior of kids everywhere. His clever social commentary and astute observations shine through in his 2012 comedy album&nbsp;<a href=\"http:\/\/geni.us\/f9NBF7b\" target=\"_blank\"><em>They Know Too Much<\/em><\/a>. One of the highlights of Irby&#39;s comedy career was being selected as a 2015 StandUp NBC national finalist and performing at the legendary Hollywood Improv in Los Angeles, CA.&nbsp;<\/p><p>Irby holds a Masters in Childhood Education from the Bank Street Graduate School of Education, a Masters in Public Administration from the Wagner School of Public Service at New York University, and a Bachelors in Sociology from Grinnell College.<\/p>","slug":"alvin_irby","published_at":"2017-11-27 23:18:00","updated_at":"2018-03-13 18:57:22"}}