{"speaker":{"id":387,"title":"","firstname":"Greg","middleinitial":"","lastname":"Lynn","description":"Designer","whotheyare":"Greg Lynn is the head of Greg Lynn FORM, an architecture firm known for its boundary-breaking, biomorphic shapes and its embrace of digital tools for design and fabrication.","whylisten":"<p>Who says great architecture must be proportional and symmetrical? Not Greg Lynn. He and his firm, Greg Lynn FORM, have been pushing the edges of building design, by <strong>stripping away the traditional dictates of line and proportion<\/strong> and looking into the heart of what a building needs to be. <\/p><p>A series of revelations about building practice -- &quot;<a href=\"http:\/\/www.indexmagazine.com\/interviews\/greg_lynn.shtml\" target=\"_blank\">Vertical structure is overrated<\/a>&quot;; &quot;<a href=\"http:\/\/www.basilisk.com\/R\/renw_d_novlty_symmtry_576.html\" target=\"_blank\">Symmetry is bankrupt<\/a>&quot; -- helped Lynn and his studio conceptualize a new approach, which uses calculus, sophisticated modeling tools, and an embrace of new manufacturing techniques <strong>to make buildings that, at their core, enclose space in the best possible way<\/strong>. The New York Presbyterian church that Lynn designed with Douglas Garofalo and Michael McInturf, collaborating remotely, is <a href=\"http:\/\/www.flickr.com\/photos\/archidose\/350479649\/in\/photostream\/\" target=\"_blank\">a glorious example<\/a>  of this -- as a quiet industrial building is transformed into a space for worship and contemplation with soaring, uniquely shaped and tuned elements.<\/p> <p>In a sort of midcareer retrospective, the book <a href=\"http:\/\/geni.us\/greglynnform\" target=\"_blank\"><em>Greg Lynn Form<\/em><\/a>  (<a href=\"http:\/\/www.youtube.com\/watch?v=WS70VA69QxM&amp;feature=channel_page\" target=\"_blank\">watch the video<\/a>) was released in October 2008; recently, Lynn has collaborated with the video team Imaginary Forces on the <a href=\"http:\/\/www.youtube.com\/watch?v=Zb6VJUDZjIY&amp;feature=channel_page\" target=\"_blank\">New City<\/a>  installation as part of the MOMA exhibit &quot;<a href=\"http:\/\/www.imaginaryforces.com\/featured\/3\/435\" target=\"_blank\">Design and the Elastic Mind<\/a>.&quot; In November 2008, FORM won a Golden Lion at the Venice Bienniale for its exhibition <a href=\"http:\/\/www.youtube.com\/watch?v=tDbr4WYgP3o\" target=\"_blank\">Recycled Toy Furniture<\/a>.<\/p>","slug":"greg_lynn","published_at":"2009-01-09 01:00:00","updated_at":"2015-07-13 17:58:22"}}