{"speaker":{"id":3892,"title":"","firstname":"Marily","middleinitial":"","lastname":"Oppezzo","description":"Behavioral and learning scientist","whotheyare":"Marily Oppezzo studies how the movement of the body can affect the movement of the mind. ","whylisten":"<p>Inheriting an energetic passion for health from her dad, Marily Oppezzo&#39;s past research has investigated ways to use the world to motivate healthy brains and healthy behaviors. She is currently an Instructor of Medicine at the Stanford Prevention Research Center. She is also working with Dr. Dan Schwartz to find out if fidgeting in the classroom may be a desirable cognitive tool rather than an irritating hallmark of inattention, and she&#39;s working with Dr. Margaret Neale and Dr. Jodi Prochaska to discover how walking may improve negotiation outcomes.<\/p><p>Along her way, Oppezzo has collected several souvenir lessons from her range of work and educational experiences:<\/p><p>Bartending:<br \/>1. The environment has incredible power to elicit and shape behaviors; and<br \/>2. Everyone has at least one interesting story in them.<br \/>&nbsp;<br \/>Dietetics:<br \/>1. Biochemistry is fascinating;<br \/>2. We grant food immense powers. It can be simultaneously viewed as a vehicle of health, morality, social bonding, government conspiracy, inequality and pleasure; and<br \/>3. A plateful of knowledge doesn&#39;t always help the medicine go down.&nbsp;&nbsp;<br \/>&nbsp;<br \/>Teaching \/ education:<br \/>1. Watching people learn, grow, and change is a deep gratification unique to teaching and behavior change work; and<br \/>2. Learning, like behavior change, takes distributed practice to become part of you. (We can&rsquo;t binge-watch knowledge any more than we should pull flossing all-nighters).<br \/>&nbsp;<br \/>Cardiac rehab:<br \/>1. Everyone has the capacity to be an inspiration and in surprising, unexpected ways; and<br \/>2. Health becomes incredibly valuable once you experience a true loss of it; and<br \/>3. Exercise is the ultimate multitasker: it can heal the brain, the heart and the body all at once.<\/p>","slug":"marily_oppezzo","published_at":"2018-01-03 01:56:00","updated_at":"2018-01-11 20:49:52"}}