{"speaker":{"id":3917,"title":"","firstname":"Tanya","middleinitial":"","lastname":"Menon","description":"Organizational psychologist","whotheyare":"Tanya Menon speaks, writes and consults on collaboration. Her research focuses on how people think about their relationships and the habits that allow them to build positive connections with other people.","whylisten":"<p>Tanya Menon is fascinated that in a time when we can instantaneously connect with nearly the whole world, we often instead filter our relationships even more narrowly. As such, we often get stuck in dead ends, missing out on new people, ideas and opportunities. Menon and her collaborators have studied the often mundane feelings and innocuous daily habits that cause people to remain in their social comfort zone and produce this polarization. And they have also explored ways that we can be more intentional about navigating the social world.<\/p><p>Menon is Associate Professor at the Ohio State University&rsquo;s Fisher College of Business. Her research has been cited in the <em>Wall Street Journal<\/em>, <em>Boston Globe<\/em>, <em>Chicago Tribune<\/em>&nbsp;and <em>The Financial Times<\/em>. She is Associate Editor at <em>Management Science<\/em> journal, an award-winning teacher, and she has done keynotes, consulting and training for organizations all over the world. Her book with Dr. Leigh Thompson,&nbsp;<a href=\"http:\/\/geni.us\/EMB5q\" target=\"_blank\"><em>Stop Spending, Start Managing: Strategies to Transform Wasteful Habits<\/em><\/a>&nbsp;(2016, Harvard Business Review Press) explores various social traps people face in business, and how to overcome them.<\/p><p>Menon earned a bachelor&#39;s degree in sociology from Harvard University in 1995 and her Ph.D. from the Stanford Graduate School of Business. Her goal as a researcher, educator, consultant and parent is to create new ways for people to connect with each other so that they can live richer and more creative lives. She hopes that her work will help&nbsp;people intentionally create new habits to live a wider life and also share them widely.<\/p>","slug":"tanya_menon","published_at":"2018-02-02 16:42:00","updated_at":"2018-02-16 15:47:07"}}