{"speaker":{"id":3932,"title":"","firstname":"Giada","middleinitial":"","lastname":"Gerboni","description":"Biomedical engineer","whotheyare":"Giada Gerboni works in surgical robotics, supporting surgeons with new flexible robotic devices in order to make once impossible operations a reality.","whylisten":"<p>Giada Gerboni is a postdoctoral scholar at Stanford University, in the&nbsp;<a href=\"http:\/\/charm.stanford.edu\/\" target=\"_blank\">Collaborative Haptics and Robotics in Medicine (CHARM) Lab<\/a>. Gerboni is working on the design and control of needle-sized flexible robots, work that aims to improve current percutaneous tumor ablation procedures. As she says: &quot;One of the most exciting parts of this research is to enable surgical operations in ways that, not long ago, had not yet been conceived.&quot;<\/p><p>Gerboni received BE and MS degrees in biomedical engineering from the&nbsp;University of Pisa and a PhD in biorobotics from The BioRobotics Institute of Sant&rsquo;Anna School of Advanced Studies in Pisa, Italy. During her PhD, she specialized in surgical robotics, studying and developing innovative strategies for the actuation and sensing of soft and flexible instruments for applications in MIS (Minimally Invasive Surgery).<\/p><p>A new branch of robotics, called &quot;soft robotics,&quot; is expanding the&nbsp;boundaries of robotic applications. Soft robotics faces the grand challenge of increasing the capabilities of robots to make them more suitable for physical interactions with the real world. It involves use of soft and flexible materials, deformable sensors and very different control strategies than traditional robots, which are designed to work in well-defined and confined environments. Gerboni has been involved in this field from the time of her PhD, and since then she has been exploring its potential in the medical\/surgical area, where safe robot-environment interaction is crucial.&nbsp;<\/p>","slug":"giada_gerboni","published_at":"2018-02-10 22:28:00","updated_at":"2018-06-14 14:42:22"}}