{"speaker":{"id":3935,"title":"","firstname":"Jason B.","middleinitial":"","lastname":"Rosenthal","description":"Advocate, artist","whotheyare":"When Jason B. Rosenthal's wife died, he says: \"as clichéd as it sounds, I started working on living each day as it comes, to get through the complexities of life.\"","whylisten":"<p>Jason B. Rosenthal writes: &quot;I have practiced law and developed real estate in Chicago for half of my life. But that is only what I did 9 to 5. What made me better at my profession -- and as a human being getting through each day -- was realizing my thirst for learning and doing. I practiced yoga intensely; I traveled the world with my wife and my family; I learned to paint and made a home studio; and I developed a passion for cooking. I would not have called myself the most passionate student when I was in school, but in my adult life I have read with a thirst for knowledge -- everything from the most meaty fiction, fascinating nonfiction and magazines. My family is what makes me who I am today.<\/p><p>&quot;I was married to the most amazing woman for half of my life. We raised three incredible children in Chicago, a culturally vibrant and livable city with people of good midwestern values. When my bride died of ovarian cancer after 26 years of marriage, I got in touch with real pain. I immediately reevaluated my life&#39;s work. I had talked for years about whether my chosen career path gave me real fulfillment. I am now the executive director of a nonprofit organization created in Amy&#39;s name, the&nbsp;<a href=\"https:\/\/www.amykrouserosenthalfoundation.org\/\" target=\"_blank\">Amy Krouse Rosenthal Foundation<\/a>. I am fueled by its mission to provide programs that encourage child literacy and funding for early detection of ovarian cancer. My future is a blank space waiting to be filled.&quot;<\/p><p>Rosenthal published a memoir,&nbsp;<a href=\"https:\/\/geni.us\/ZpFkPl\" target=\"_blank\"><em>My Wife Said You May Want to Marry Me<\/em><\/a>, in April 2020.<\/p>","slug":"jason_b_rosenthal","published_at":"2018-02-10 23:10:00","updated_at":"2020-04-28 02:46:50"}}