{"speaker":{"id":3937,"title":"","firstname":"Kai-Fu","middleinitial":"","lastname":"Lee","description":"Chairman and CEO, Sinovation Ventures","whotheyare":"Kai-Fu Lee has spent more than three decades at the cutting edge of artificial intelligence research, development and investment both in the US and China.","whylisten":"<p>Dr. Kai-Fu Lee is chairman and CEO of Sinovation Ventures, a leading venture capital firm that manages a 2.5 billion USD fund focused on developing the next generation of Chinese high-tech companies. He is also president of Sinovation Ventures Artificial Intelligence Institute, which works to infuse AI inside traditional companies and venture build AI startups.&nbsp;<\/p><p>Previously, Lee was the president of Google China and a senior executive at Microsoft, SGI and Apple. He&#39;s the cochair of the Artificial Intelligence Council for the World Economic Forum&#39;s Center for the Fourth Industrial Revolution and a fellow of the Institute of Electrical and Electronics Engineers (IEEE). He was named one of the most influential people in the world by <em>Time<\/em> magazine in 2013 and a <em>Wired<\/em> 25 Icons in 2018.&nbsp;<\/p><p>Lee received a bachelor&#39;s degree in computer science from Columbia University and a PhD in computer science from Carnegie Mellon University. While at Carnegie Mellon, he built a program that defeated the world champion at Othello in 1988, one of the first examples of a computer beating the best human player at a game. He also developed the world&#39;s first large-vocabulary, speaker-independent continuous speech recognition system.&nbsp;<\/p><p>As an executive, Lee founded Microsoft Research China, later renamed Microsoft Research Asia, that has trained the majority of AI leaders in China, including CTOs and AI heads at Baidu, Tencent, Alibaba, Lenovo, Huawei and Haier. While at Apple, he led AI projects in speech recognition and natural language processing that were featured on <em>Good Morning America<\/em> and the front page of the&nbsp;<em>Wall Street Journal<\/em>.&nbsp;<\/p><p>Lee is the author of the <em>New York Times <\/em>and the&nbsp;<em>Wall Street Journal<\/em> bestseller <em>AI Superpowers<\/em>, which examines the role of the US and China in the future of artificial intelligence as well as its impact on society. His latest book, coauthored with award-winning science-fiction writer Chen Quifan, is called&nbsp;<a href=\"https:\/\/www.ai2041.com\/\" target=\"_blank\"><em>AI2041: Ten Visions for Our Future<\/em><\/a>. It presents a roadmap to educate and explore the opportunities and challenges presented by AI over the coming decades.<\/p>","slug":"kai_fu_lee","published_at":"2018-02-10 23:18:00","updated_at":"2021-09-02 16:03:38"}}