{"speaker":{"id":394,"title":"","firstname":"Barry","middleinitial":"","lastname":"Schuler","description":"Entrepreneur","whotheyare":"Barry Schuler's multimedia firm Medior built key interactive technologies for AOL, helping millions connect to the Internet through a simple, accessible interface. Now, through venture capital (and wine appreciation), he wants to do the same for genomics.","whylisten":"<p>If in the mid-&#39;90s tech revolution you found yourself intimidated by command lines (or computers in general), chances are you had your first encounter with email through America Online. Above those first-month-free CDs, the main appeal was its easy-as-a-microwave interface, which Barry Schuler and his team at Medior designed. While the other techies were complaining of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Eternal_September\" target=\"_blank\">eternal September<\/a>, Schuler remained a populist, <strong>passionate about spreading accessibility to the next generation of services<\/strong> that he foresaw changing the world. (Earlier, he had developed and marketed color desktop apps for Apple.)<\/p><p>Schuler later served as AOL&#39;s CEO when it acquired Time Warner. But now, as high-tech democratization continues, Schuler wants to <strong>direct the momentum toward genomics<\/strong>. As managing director of Draper Fisher <a href=\"\/index.php\/talks\/steve_jurvetson_on_model_rocketry.html\" target=\"_blank\">Jurvetson<\/a>, he&#39;s funding next-thing projects in tech, and he also serves on the board of <a href=\"\/index.php\/talks\/craig_venter_is_on_the_verge_of_creating_synthetic_life.html\" target=\"_blank\">Synthetic Genomics<\/a>. A lover of wine (and a proponent of using genetics to enhance wine grapes), he owns <a href=\"http:\/\/www.meteorvineyard.com\/\" target=\"_blank\">Meteor Vineyard<\/a>  in Napa Valley. He&#39;s currently CEO of <a href=\"http:\/\/www.raydiance-inc.com\/about-us\/the-raydiance-team\/\" target=\"_blank\">Raydiance<\/a>, which is developing laser technology for healthcare use. <\/p>","slug":"barry_schuler","published_at":"2009-01-22 01:09:00","updated_at":"2009-01-22 07:04:55"}}