{"speaker":{"id":3945,"title":"","firstname":"Penny","middleinitial":"","lastname":"Chisholm","description":"Microbial oceanographer, author","whotheyare":"Penny Chisholm studies an extremely tiny microorganism that plays an enormous role in ocean ecosystems. Discovered only three decades ago, it has defined her career and inspired her to think differently about life on Earth.","whylisten":"<p>Penny Chisholm (whose&nbsp;<a href=\"https:\/\/scholar.google.com\/citations?user=Y8FpsToAAAAJ&amp;hl=en\" target=\"_blank\">scientific works<\/a>&nbsp;are published under the name Sallie Chisholm) has been studying microscopic plants called phytoplankton since she was an undergraduate.&nbsp; After she joined the MIT faculty, in the 1980s she was lucky enough to be involved in the discovery of the smallest and most abundant phytoplankter on the planet: <em>Prochlorococcus<\/em>. Less that 1\/100th the width of a human hair, this tiny photosynthetic microbe thrives in the sunlit surface waters across large swaths of the global ocean, where it uses the sun&#39;s energy to release oxygen, consume carbon dioxide and grow. There are an estimated three billion billion billion of these tiny cells in the global ocean where they provide sustenance for other microorganisms and fuel ocean food webs. &quot;<em>Prochlorococcus<\/em> has been my muse for more than 30 years,&quot; Chisholm says. &quot;It has taught me an enormous amount about the role of photosynthesis in shaping our planet, and about the power of diversity. Most important, it has taught me to be humbled by the mind-blowing complexity of the natural world.&quot;&nbsp;<\/p><p>Chisholm is one of ten&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/List_of_Institute_Professors_at_the_Massachusetts_Institute_of_Technology\" target=\"_blank\">Institute Professors<\/a>&nbsp;at MIT and has received many honors for her research on <em>Prochlorococcus<\/em>, including the 2011&nbsp;<a href=\"https:\/\/www.nationalmedals.org\/laureates\/sallie-w-chisholm\" target=\"_blank\">National Medal of Science<\/a>&nbsp;awarded by President Obama at the White House. She has also co-authored&nbsp;<a href=\"https:\/\/thesunlightseries.com\/\" target=\"_blank\">a series of children&#39;s books<\/a>&nbsp;about the role of photosynthesis in shaping our world.<\/p>","slug":"penny_chisholm","published_at":"2018-02-11 00:43:00","updated_at":"2018-07-02 15:18:03"}}