{"speaker":{"id":3952,"title":"","firstname":"Vishaan","middleinitial":"","lastname":"Chakrabarti","description":"Architect and author","whotheyare":"Vishaan Chakrabarti believes that cities -- if they are designed to be sustainable, equitable and joyous -- are the best hope for humanity.","whylisten":"<p>Vishaan&nbsp;Chakrabarti designs and advocates for a sustainable, attainable and equitable urban future centered around human connectedness. As founder and creative director of the global architecture studio&nbsp;<a href=\"https:\/\/pau.studio\/\" target=\"_blank\">Practice for Architecture and Urbanism<\/a>&nbsp;(PAU), he leads complex projects such as&nbsp;I.M. Pei&#39;s Rock and Roll Hall of Fame in Cleveland, Princeton&#39;s Hobson College, Brooklyn&#39;s Domino Sugar Refinery and Ford Motor Company&#39;s Michigan Central Station project in Detroit&#39;s Corktown. In his 2013 book,<em>&nbsp;<\/em><a href=\"http:\/\/geni.us\/d8jK\" target=\"_blank\"><em>A Country of Cities: A Manifesto for an Urban America<\/em><\/a><em>,<\/em>&nbsp;he illustrates through hard data and soft cartoons why Americans would be more prosperous, sustainable, joyful and socially mobile in a more urban nation. His forthcoming book, <em>The Architecture of Urbanity: Designing Cities for Pluralism and Planet<\/em>, will be published by Princeton University Press.&nbsp; &nbsp;<\/p><p>Chakrabarti served under Mayor Bloomberg as the director of planning for Manhattan in the aftermath of 9\/11, collaborating on efforts to save the High Line and rebuild the World Trade Center. He has served as the William W. Wurster Dean of the College of Environmental Design at University of California, Berkeley, prior to which he was a professor at Columbia University for a decade. He lectures internationally, contributes articles and op-eds to the <em>New York Times<\/em> and has appeared on CBS, MSNBC and National Public Radio. Born in Calcutta, Chakrabarti holds degrees from Cornell, MIT and Berkeley.<\/p>","slug":"vishaan_chakrabarti","published_at":"2018-02-11 16:21:00","updated_at":"2021-12-06 16:14:58"}}