{"speaker":{"id":3954,"title":"","firstname":"Will","middleinitial":"","lastname":"MacAskill","description":"Moral philosopher, writer","whotheyare":"Will MacAskill is a cofounder of the effective altruism movement, a philosophy that tries to answer the question: How can we do as much good as possible?","whylisten":"<p>Will MacAskill is the author of <a href=\"https:\/\/www.amazon.com\/Doing-Good-Better-Effective-Difference-ebook\/dp\/B00OYXWL4W\" target=\"_blank\"><em>Doing Good Better<\/em><\/a> and the cofounder of the organization <a href=\"https:\/\/www.givingwhatwecan.org\/\" target=\"_blank\">Giving What We Can<\/a> and the social-impact-career advice project <a href=\"https:\/\/80000hours.org\/\" target=\"_blank\">80,000 Hours<\/a>. He is a trustee of the <a href=\"https:\/\/www.effectivealtruism.org\/\" target=\"_blank\">Centre for Effective Altruism<\/a>. As he writes: &quot;I&#39;m an associate professor of moral philosophy at Oxford University. I helped to create the philosophy of <a href=\"https:\/\/www.effectivealtruism.org\/\" target=\"_blank\">effective altruism<\/a>:&nbsp;the use of evidence and reason to figure out how to do the most good we can.<\/p><p>&quot;While growing up, I tried my best to do good things: I donated to high street charities, I worked at an old folks&#39; home, I taught English in Ethiopia. But when I was a graduate student I realized that I&#39;d never asked myself the question of whether these were the truly best ways of improving the world. So, being a nerd, I started doing some research to try to find out what activities would do the most to make the world a better place. Ten years later, I&#39;m still asking that question.<\/p><p>&quot;I&#39;m still far from certain about what the best ways of doing good are, but I have learned that each and every one of us can do a tremendous amount to make the world a better place, whether that&#39;s by donating to buy bednets to protect children from malaria, campaigning to improve living conditions for animals in factory farms or working to ensure that the benefits of new technology are harnessed while avoiding the risks.&quot;<\/p>","slug":"will_macaskill","published_at":"2018-02-13 22:41:00","updated_at":"2018-09-12 14:36:23"}}