{"speaker":{"id":3964,"title":"","firstname":"Elizabeth","middleinitial":"","lastname":"Streb","description":"Action and hardware architect","whotheyare":"Elizabeth Streb is an extreme action specialist who flies, crash-lands and invents hardware to get higher, faster, sooner, harder.","whylisten":"<p>Elizabeth Streb is known for her unique brand of movement, &quot;Pop Action,&quot; which intertwines dance, athletics, boxing, rodeo, the circus, stunt work and the invention of action gizmos. In 1985, she founded STREB Extreme Action Company to push the limitations of the human body and, in 2003, she established SLAM (STREB Lab for Action Mechanics) in Brooklyn. For the 2012 London Olympic Games, the company was commissioned to create <a href=\"https:\/\/www.liftfestival.com\/events\/one-extraordinary-day\/\" target=\"_blank\">One Extraordinary Day<\/a>, a series of events across the city that included dancers &quot;bungee dancing&quot; off Millennium Bridge and abseiling down City Hall. The 2016 film <em><a href=\"https:\/\/www.oxdmovie.com\/\" target=\"_blank\">OXD<\/a><\/em>, directed by Craig Lowy, follows these events. In 2017, STREB was commissioned by Bloomberg LLP to create a series of events to open the new corporate headquarters in London and to launch the CityLab Conference in Paris.<\/p><p>Streb is the recipient of numerous honors including a MacArthur Fellowship (1997) and a Guggenheim Fellowship (1987). She lectures regularly across the country and her book, <a href=\"https:\/\/www.feministpress.org\/books-n-z\/streb?rq=streb%203\" target=\"_blank\"><em>STREB: How to Become an Extreme Action Hero<\/em><\/a>, was published by Feminist Press in 2010. In 2014, <em><a href=\"https:\/\/www.amazon.com\/Born-Fly-Elizabeth-Streb-Gravity\/dp\/B00VHAGG46\" target=\"_blank\">Born to Fly: STREB vs. Gravity<\/a><\/em> a documentary directed by Catherine Gund, premiered at Film Forum NYC, was aired on PBS and nominated for an Emmy. It is available on iTunes and Netflix. STREB&#39;s rehearsals at SLAM are always open to the public.<\/p>","slug":"elizabeth_streb","published_at":"2018-02-17 14:27:00","updated_at":"2018-06-29 20:25:15"}}