{"speaker":{"id":3969,"title":"","firstname":"Luhan","middleinitial":"","lastname":"Yang","description":"Biologist, geneticist","whotheyare":"Dr. Luhan Yang is the co-founder and chief scientific officer at eGenesis, working to make xenotransplantation a routine medical procedure for the delivery of safe and effective human transplantable cells, tissues and organs.","whylisten":"<p>With the mission to translate scientific innovation into a life-saving medical procedure, Dr. Luhan Yang is leading a team of world-renowned scientists to leverage CRISPR technology and its potential to deliver safe and effective human transplantable organs to the hundreds of thousands of patients worldwide who are in dire need.<\/p><p>In the US alone, more than 116,000 people annually are in need of a lifesaving organ transplant, and 20 people die every day waiting for a transplant. To address this issue, scientists have been trying to engineer animal organs for human transplantation for more than 100 years. However, concern for issues such as pig-to-human immunological compatibility and cross-species transmission of porcine endogenous retroviruses (PERV) have proven to be two insurmountable obstacles -- until now.<br \/><br \/>In a breakthrough paper published in&nbsp;<em>Science<\/em>, Yang and her team demonstrated for the first time the inactivation of PERV to prevent cross-species viral transmission, an important milestone for xenotransplantation. As co-founder and chief scientific officer, Yang has been at the center of eGenesis&#39; success. In addition to recruiting and leading a high-caliber scientific team, she has played an integral role in daily management of the company, business strategy and planning, as well as negotiating with investors for early round funding.<\/p><p>Yang holds BS degrees in biology and psychology from Peking University and a PhD in human biology and translational medicine from Harvard Medical School.<\/p>","slug":"luhan_yang","published_at":"2018-02-17 14:48:00","updated_at":"2018-09-07 16:31:11"}}