{"speaker":{"id":3973,"title":"","firstname":"Robin","middleinitial":"","lastname":"Steinberg","description":"Public defender, activist","whotheyare":"Robin Steinberg is the CEO of The Bail Project, an organization designed to combat mass incarceration in the United States by disrupting the money bail system -- one person at a time. As she says: \"I hate injustice and simply can't sit still when I see it.\"","whylisten":"<p>Robin Steinberg is the CEO of The Bail Project and a senior fellow at the UCLA Law Criminal Justice Program. As she writes: &quot;When I started my career, all I wanted was to be a great public defender for my clients. I vowed to fight for their rights, dignity and humanity in a system that seemed intent on crushing them, their families and their communities. It was hard work, but I woke up everyday inspired and with a sense of purpose -- even when the unfairness of the system made me cry. I was doing my part in the larger struggle for social justice -- one client at a time. But the need to do more, to rethink the very nature of public defense and challenge the larger systemic issues that fueled the cycle of criminalization and poverty led me to start The Bronx Defenders in 1997. For 20 years, I worked to create a new vision of public defense, extending legal representation and advocacy beyond criminal court with the goal of breaking that cycle. That process led to the founding of several new initiatives, including Still She Rises, a public defender office dedicated exclusively to the representation of women in the criminal justice system, and The Bronx Freedom Fund, a revolving bail fund that used philanthropic dollars to pay bail for clients who couldn&rsquo;t buy their freedom.<br \/><br \/>&quot;As it turns out, what I love most is getting people out of jail so they can be home with their families and have a fighting chance in court. My new organization, <a href=\"https:\/\/bailproject.org\" target=\"_blank\">The Bail Project<\/a>, will take the lessons we learned in the Bronx and go to dozens of high-need jurisdictions with the goal of paying bail for 160,000 people over the next five years, disrupting the bail system, reducing the human suffering it causes and continuing the fight to decarcerate America.&quot;<\/p>","slug":"robin_steinberg","published_at":"2018-02-17 15:01:00","updated_at":"2020-05-12 14:15:49"}}