{"speaker":{"id":398,"title":"","firstname":"Peter","middleinitial":"","lastname":"Ward","description":"Paleontologist","whotheyare":"Peter D. Ward studies life on Earth -- where it came from, how it might end, and how utterly rare it might be.","whylisten":"<p>Paleontologist and astrobiologist Peter D. Ward studies the Cretaceous-Tertiary extinction event (the one that killed the dinosaurs) and other mass extinctions. <strong>He is a leader in the intriguing new field of astrobiology<\/strong>, the study of the origin, distribution and evolution of life in the universe.<\/p><p>In his book <a href=\"http:\/\/www.powells.com\/biblio\/17-9780387987019-0\" target=\"_blank\"><em>Rare Earth<\/em><\/a>  he theorizes that <strong>complex life itself is so rare, it&#39;s quite possible that Earth is the only planet that has any<\/strong>. But, he theorizes, simple life may exist elsewhere -- and possibly be more common than we think.<\/p><p>His upcoming book, <a href=\"http:\/\/www.powells.com\/biblio?isbn=9780691130750\" target=\"_blank\"><em>The Medea Hypothesis<\/em><\/a>, makes a bold argument that even <strong>here on Earth, life has come close to being wiped out several times<\/strong>. Contrary to the &quot;Gaia hypothesis&quot; of a self-balancing, self-perpetuating circle of life, Ward&#39;s Medea hypothesis details the scary number of times that life has come close to flatlining, whether due to comet strikes or an overabundance of bacteria.<\/p><p>In March 2009, Ward&#39;s 8-hour television series, <a href=\"http:\/\/www.imdb.com\/title\/tt1327845\/\" target=\"_blank\"><em>Animal Armageddon<\/em><\/a>, premieres on Animal Planet Network.<\/p><p>In April 2013, Ward published a surprisingly moving essay about his life&#39;s obsession: <a href=\"http:\/\/nautil.us\/issue\/0\/the-story-of-nautilus\/ingenious-nautilus-and-me\" target=\"_blank\">the chambered nautilus &gt;&gt; <\/a> <\/p>","slug":"peter_ward","published_at":"2009-01-20 10:17:00","updated_at":"2013-05-17 16:15:53"}}