{"speaker":{"id":3988,"title":"","firstname":"Mark","middleinitial":"","lastname":"Pollock","description":"Explorer, collaboration catalyst ","whotheyare":"Mark Pollock was the first blind person to race to the South Pole. Now he's exploring the intersection where humans and technology collide on a new expedition to cure paralysis in our lifetime.","whylisten":"<p>Unbroken by blindness in 1998, Mark Pollock went on to compete in ultra-endurance races across deserts, mountains and the polar ice caps and was the first blind person to race to the South Pole. He also won silver and bronze medals for rowing at the Commonwealth Games and set up a&nbsp;<a href=\"https:\/\/www.markpollock.com\/\" target=\"_blank\">motivational speaking business<\/a>.<\/p><p>In 2010, Pollock was left paralysed after falling from a third story window. He is now exploring the intersection where humans and technology collide and catalyzing collaborations that have never been done before. Through the&nbsp;<a href=\"https:\/\/www.markpollocktrust.org\/\" target=\"_blank\">Mark Pollock Trust<\/a>, he&#39;s unlocking $1 billion to cure paralysis in our lifetime.<\/p><p>Selected by the World Economic Forum as a Young Global Leader and appointed to the Global Futures Council on Human Enhancement, Pollock is a UBS Global Visionary, is on the Board of the Christopher and Dana Reeve Foundation and is a Wings for Life Ambassador. With his fianc&eacute;e, Simone George, he is the subject of the acclaimed documentary called&nbsp;<a href=\"https:\/\/vimeo.com\/137502216\" target=\"_blank\"><em>Unbreakable<\/em><\/a>, and is a TED, Davos, World Economic Forum, InnoTown, F.ounders, EG and Wired speaker. In addition, Pollock is co-Founder of the global running series called&nbsp;<a href=\"https:\/\/www.runinthedark.org\/\" target=\"_blank\">Run in the Dark<\/a>.&nbsp;<\/p><p>Pollock has been awarded honorary doctorates by The Royal College of Surgeons in Ireland and from Queens University Belfast. He holds a diploma in Global Leadership and Public Policy for the 21st Century from Harvard University as well as degrees from Trinity College Dublin and The Smurfit Business School.<\/p>","slug":"mark_pollock","published_at":"2018-03-02 15:29:00","updated_at":"2018-09-04 15:23:54"}}