{"speaker":{"id":3989,"title":"","firstname":"Amishi","middleinitial":"","lastname":"Jha","description":"Neuroscientist","whotheyare":"As a neuroscientist specializing in the brain mechanisms of attention, Amishi Jha researches mindfulness techniques to optimize focus, even under high stress.","whylisten":"<p>Neuroscientist Amishi Jha studies how to keep the brain&rsquo;s attention systems in peak shape over high-pressure intervals. In her laboratory at the University of Miami, she uses functional MRI, electrophysiological recordings and behavioral analysis techniques to understand why our attention sometimes fails us, and if it can be trained for greater focus and less distractibility.<\/p><p>In 2008, Jha launched the first-ever study to offer mindfulness training tools to active duty military service members as they prepared for deployment. What she has discovered over the past 10 years of research on this topic is that without intervention, soldiers&rsquo; attention and working memory are compromised, and their&nbsp;<a href=\"http:\/\/www.miamiherald.com\/news\/local\/community\/miami-dade\/article10902134.html\" target=\"_blank\">attentional lapses increase<\/a>.&nbsp;She has found&nbsp;<a href=\"https:\/\/www.newyorker.com\/tech\/elements\/an-antidote-for-mindlessness\" target=\"_blank\">similar patterns in students<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/mobile.nytimes.com\/2017\/06\/21\/well\/live\/to-train-an-athlete-add-12-minutes-of-meditation-to-the-daily-mix.html\" target=\"_blank\">athletes<\/a>,&nbsp;too. The good news is that engaging in mindfulness training to cultivate greater present moment awareness protects against these effects. Her research is continuing to explore how attention can be trained for optimal performance and well-being. In her TED Talk, Jha unpacks how attention becomes vulnerable under stress and the mechanisms that allow it to be strengthened with mindfulness training.<\/p>","slug":"amishi_jha","published_at":"2018-03-02 16:13:00","updated_at":"2018-03-23 15:15:14"}}