{"speaker":{"id":3992,"title":"","firstname":"Laura L.","middleinitial":"","lastname":"Dunn","description":"Victims' rights attorney","whotheyare":"TED Fellow Laura L. Dunn advances and enforces victims' rights for survivors of gender violence in campus, criminal and civil legal systems.","whylisten":"<p>Laura L. Dunn, Esq., advances victims&#39; rights through legislative and policy efforts, as well as direct representation of survivors in campus, criminal and civil systems. As a nationally-recognized&nbsp;<a href=\"https:\/\/www.buzzfeed.com\/tylerkingkade\/laura-dunns-campus-rape-fight\" target=\"_blank\">victim-turned-victims&rsquo; rights attorney<\/a>&nbsp;and social entrepreneur, her work has been featured by National Public Radio, <em>PEOPLE<\/em> Magazine, <em>Forbes<\/em>, the <em>National Law Journal<\/em>, the <em>New York Times<\/em>&nbsp;and&nbsp;<a href=\"http:\/\/www.lauraldunnesq.com\/media.html\" target=\"_blank\">many more<\/a> .<\/p><p>While a law student, Dunn contributed to the 2011 and 2014 Title IX guidance issued by the US Department of Education. She also worked with Congress to pass the 2013 Violence Against Women Reauthorization Act and its federal regulations. For this advocacy, Vice President Joe Biden and Senate Judiciary Chairman Patrick Leahy have publicly recognized Dunn. Upon graduation from Maryland Law, she founded the survivor-led and DC-based legal organization, SurvJustice. It is still the only national nonprofit representing victims of campus sexual violence in hearings across the country and is currently the lead plaintiff in a&nbsp;<a href=\"http:\/\/people.com\/politics\/advocate-sues-betsy-devos-students-reporting-sexual-assault\/\" target=\"_blank\">pending federal lawsuit against the Trump administration<\/a>&nbsp;over Title IX.<\/p><p>As an attorney, Dunn is now a&nbsp;<a href=\"http:\/\/www.lauraldunnesq.com\/publications.html\" target=\"_blank\">published legal scholar<\/a>, an adjunct law professor, a member of the American Bar Association&#39;s Commission on Domestic &amp; Sexual Violence and its Criminal Justice Section&#39;s Task Force on College Due Process, a liaison to the American Law Institute&rsquo;s Model Penal Code on Sexual Assault and its Student Sexual Misconduct Project, an accomplished litigator who helped win the first-ever recognition of a federal victim-advocate privilege in court and an expert legal consultant on various campus sexual assault lawsuits.&nbsp;<\/p><p>For her work, Dunn has received a 2015 Echoing Green Global Fellowship, the 2016 Benjamin Cardin Public Service Award, the 2017 Department of Justice&rsquo;s Special Courage Award and a 2018 TED Fellowship, along with other&nbsp;<a href=\"http:\/\/www.lauraldunnesq.com\/recognition.html\" target=\"_blank\">honors and recognitions<\/a>.<\/p>","slug":"laura_l_dunn","published_at":"2018-03-04 12:59:00","updated_at":"2019-12-18 16:05:07"}}