{"speaker":{"id":3994,"title":"","firstname":"Olga","middleinitial":"","lastname":"Yurkova","description":"Journalist, editor","whotheyare":"TED Fellow Olga Yurkova is a journalist and cofounder of StopFake.org, an independent Ukrainian organization that trains an international cohort of fact-checkers in an effort to curb propaganda and misinformation in the media.","whylisten":"<p>Olga Yurkova edits the&nbsp;<a href=\"https:\/\/www.stopfake.org\/en\/category\/context\/\" target=\"_blank\">Context<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.stopfake.org\/en\/category\/opinions\/\" target=\"_blank\">Opinions<\/a>&nbsp;sections of&nbsp;<a href=\"https:\/\/www.stopfake.org\/en\" target=\"_blank\">StopFake.org<\/a>. She teaches different audiences how propaganda works and how to identify fake news, consulting a&nbsp;range of organizations and public structures and collaborating with mainstream media as a journalist.<\/p><p>Yurkova explores propaganda methods and finds out new ways to overcome these new challenges. In June 2017, she and her colleagues&nbsp;<a href=\"https:\/\/twitter.com\/mschenk\" target=\"_blank\">Maarten Schenk<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/twitter.com\/jordy_nijenhuis\" target=\"_blank\">Jordy Nijenhuis<\/a>&nbsp;launched a project called&nbsp;<a href=\"http:\/\/www.forbiddenfacts.com\/\" target=\"_blank\">Forbidden Facts<\/a>, which explains how fake news spreads online through clickbait headlines on Facebook that reach out to skeptical audiences.<\/p><p>Yurkova has 15 years of experience in journalism. She headed the local multimedia newsroom in Ternopil city for six years, becoming the market leader during that time. She then ran the Donbas and Crimea department at the national multimedia newsroom Nova Informacia for three years. She has been working as a new media trainer since 2012.&nbsp;<\/p><p>For fighting propaganda, Yurkova was included into the list of&nbsp;<a href=\"https:\/\/www.ft.com\/content\/ece06f66-90a7-11e6-a72e-b428cb934b78\" target=\"_blank\">New Europe 100<\/a>&nbsp;and was named a TED Fellow in 2018.<\/p>","slug":"olga_yurkova","published_at":"2018-03-04 13:06:00","updated_at":"2018-06-07 14:57:42"}}