{"speaker":{"id":4,"title":"","firstname":"Ashraf","middleinitial":"","lastname":"Ghani","description":"President of Afghanistan","whotheyare":"Afghanistan's president Ashraf Ghani has initiated sweeping economic, trade, social and peace reforms.","whylisten":"<p>Dr. Mohammad Ashraf Ghani has devoted himself to rebuilding Afghanistan. He advised Interim President Karzai and served as the Finance Minister in the Transitional Islamic State of Afghanistan until December 2004.&nbsp;<\/p><p>During his tenure as Finance Minister, Ghani&nbsp;designed a package of reforms and initiated several public investment programs that led to significant improvements in the livelihoods of ordinary Afghans across the country. He declined to join the newly elected government in December 2004, instead becoming Chancellor of Kabul University and remained an influential voice in political circles both in Afghanistan and abroad, advising other post conflict governments including those of Kosovo, Nepal, South Sudan and Haiti.&nbsp;<\/p><p>Based on his experiences, Ghani&nbsp;wrote the book&nbsp;<a href=\"https:\/\/geni.us\/qQnAn1n\" target=\"_blank\"><em>Fixing Failed States<\/em><\/a>,&nbsp;published in 2009. In 2010, he served in Kabul as the chairman of the Transition Coordination Commission (TCC), which was responsible for transferring authority from foreign to national troops. He resigned from TCC to run for president in October 2013. He was inaugurated as President of the Islamic Republic of Afghanistan on September 29, 2014 and sworn in for his second term in office on March 9, 2020.&nbsp;<\/p><p>As President, Ghani has initiated reforms at various sectors namely economic, trade, banking; establishment of land and air corridors; building railways to spur trade; and revival of Lapis Lazuli and Chabahar routes in order to create the grounds for economic development for all stakeholder countries and to help the Afghan government achieve self-reliance. He established fundamental reforms to ensure social justice and political participation, particularly meaningful participation of Afghan women and youth in politics, as well as reforms in legal and justice, procurement and security institutions.<\/p><p>Ghani grew up in Afghanistan before pursuing his education abroad. As with so many Afghans, foreign invasion and civil war led to the persecution of his family and forced him to remain in exile. While abroad, he became a leading scholar of political science and anthropology, taught at Johns Hopkins University from 1983 to 1992 and worked at the World Bank where he learned the tools of international development.<\/p><p>Following the withdrawal of American and allied forces from Afghanistan in 2021, Ghani&rsquo;s government and the Afghan National Army were overrun by Taliban forces, which seized control of the country and seat of government on August 15. Ghani fled the country and found refuge in the United Arab Emirates.<\/p>","slug":"ashraf_ghani","published_at":"2007-02-13 10:47:00","updated_at":"2021-08-21 16:28:14"}}