{"speaker":{"id":4000,"title":"","firstname":"Lucy","middleinitial":"","lastname":"Marcil","description":"Pediatrician, social entrepreneur","whotheyare":"Lucy Marcil is providing fiscal services to low-income families in the doctor’s waiting room.","whylisten":"<p>Lucy Marcil, MD MPH, creates innovative solutions buffering kids from the adversity they face growing up with economic stress and poverty. As a pediatrician, she cares for children at&nbsp;<a href=\"https:\/\/www.bmc.org\/pediatrics-primary-care\" target=\"_blank\">Boston Medical Center<\/a>.&nbsp;She co-founded&nbsp;<a href=\"https:\/\/www.mystreetcred.org\/\" target=\"_blank\">StreetCred<\/a>, a nonprofit addressing the health impact of financial stress by providing fiscal services to low-income families in the the doctor&rsquo;s waiting room. StreetCred increases access to critical anti-poverty tax credits such as the Earned Income Tax Credit by integrating tax preparation services into pediatric clinics; it has returned over $3.2 million to 1700 clients at 9 sites in 4 states since its inception in 2016. StreetCred is now bundling tax services with enrollment in other economic mobility services to create greater financial stability.<\/p><p>Internationally, Dr. Marcil has undertaken pediatric health-systems strengthening. As a HIV\/AIDS &amp; Community Health Peace Corps volunteer in Namibia, she leveraged public-private partnerships to create a comprehensive orphan care program and girls&rsquo; leadership camps. In Bangladesh, she identified community engagement methods to build maternal-child healthcare systems in urban slums. In Kenya, she consulted for Jacaranda Health to transform newborn care systems.<\/p><p>For her work, Dr. Marcil&nbsp;has been recognized with the American Academy of Pediatrics Anne E. Dyson Child Advocacy Award and the Jack Kent Cooke Foundation Quinn Prize, and has been named a Caf&eacute; 100, Davidson College Game Changer and 2018 TED Fellow.<\/p>","slug":"lucy_marcil","published_at":"2018-03-04 13:45:00","updated_at":"2018-07-23 14:23:22"}}