{"speaker":{"id":4002,"title":"","firstname":"Faith","middleinitial":"","lastname":"Osier","description":"Infectious disease doctor","whotheyare":"Faith Osier is studying how humans acquire immunity to malaria and developing new malaria vaccines.","whylisten":"<p>Faith Osier works to understand how humans acquire immunity to malaria and intends to use this knowledge to design highly effective vaccines. Her studies focus on infections with the parasite <em>Plasmodium falciparum<\/em>, which leads to nearly half a million deaths in Africa each year. She demonstrated that Kenyan children who did not get sick after a malaria infection had high levels of antibodies against combinations of specific proteins found within the parasite. Subsequently, her studies in immune African adults revealed that there were in fact many additional parasite proteins that could be considered for malaria vaccines. To verify her results, she designed a massive study involving children and adults from 15 different geographical locations in Africa. She designed KILchip, a custom protein microarray that enabled her team to analyze antibody responses to more than 100 intentionally selected malaria proteins in these human blood samples. Her research group also studies the mechanisms by which these antibodies kill malaria parasites.<\/p><p>Osier is a Professor of Malaria Immunology in the Nuffield Deptartment of Medicine at the University of Oxford, UK. She has two research laboratories: one in the Biosciences Deptartment&nbsp;of the KEMRI-Wellcome Trust Research Programme in Kilifi, Kenya, and the other in the Parasitology Deptartment&nbsp;of Heidelberg University Hospital in Heidelberg, Germany. She has won multiple awards for her work including the Royal Society Pfizer Award (UK) and the prestigious Sofja Kovalevskaja Award from the Alexander von Humboldt Foundation. She holds major research grants from the Wellcome Trust, is an MRC African Research Leader and an EDCTP Senior Fellow. She is also a fellow of the African Academy of Sciences, an advisor to the Executive Committee of the Federation of African Immunological Societies and the vice-president\/president-elect of the International Union of Immunological Societies. She was named a TED Fellow in 2018. She is passionate about training African scientists to excel and deliver the medical interventions that are urgently needed on the continent.<\/p>","slug":"faith_osier","published_at":"2018-03-04 14:19:00","updated_at":"2018-10-16 19:55:27"}}