{"speaker":{"id":4003,"title":"","firstname":"Paul","middleinitial":"","lastname":"Rucker","description":"Multidisciplinary artist ","whotheyare":"TED Senior Fellow Paul Rucker explores issues related to mass incarceration, racially motivated violence and the continued impact of policies that sustain inequity.","whylisten":"<p>Paul Rucker is a visual artist, composer and musician who combines live performance, sound, original compositions and visual arts. The product of a rich interactive process, his work investigates community impacts, human rights issues, historical research and basic human emotions of a particular subject matter. Much of his work focuses on the prison-industrial complex and the many issues accompanying incarceration in its relationship to slavery. He has presented performances and visual art exhibitions across the country, including in schools, active prisons and inactive prisons like Alcatraz.<\/p><p>Rucker&#39;s installation&nbsp;<a href=\"http:\/\/www.rewindexhibition.com\/\" target=\"_blank\">REWIND<\/a>&nbsp;garnered much praise and acclaim, including &quot;Best Artist 2015&quot; from Baltimore Magazine, &quot;Best Solo Show 2015&quot; and &quot;#1 Art Show of 2015&quot; from <em>Baltimore City Paper<\/em>, reviews by the Huffington Post, Artnet News, <em>Washington Post<\/em>, The Root and The Real News Network. He has received numerous grants, awards and residencies for visual art and music. He is a 2012 Creative Capital Grantee in visual art as well as a 2014, 2018, 2019 MAP (Multi-Arts Production) Fund Grantee for performance. In 2015, he received a prestigious Joan Mitchell Painters and Sculptors Grant as well as the Mary Sawyer Baker Award. In 2016, he received the Rauschenberg Artist as Activist fellowship and the Smithsonian Artist Research Fellowship, for which he is the first artist in residence at the new National Museum of African American Culture.<\/p><p>Rucker&#39;s residencies include MacDowell Colony, Blue Mountain Center, Ucross Foundation, Art OMI, Banff Centre, Pilchuck Glass School, Rauschenberg Residency, Joan Mitchell Residency, Loghave, Montalvo, Hermitage, Hemera Artist Retreat, Air Serembe, Creative Alliance and the Rockefeller Foundation Study Center in Bellagio, Italy. In 2013-2015, he was the Robert W. Deutsch Foundation Artist in Residence and Research Fellow at the Maryland Institute College of Art. He was also awarded a 2017 John Simon Guggenheim Fellowship, a 2018 TED Fellowship and the 2018 Arts Innovator Award from the Dale and Leslie Chihuly Foundation and Artist Trust.<\/p><p>Rucker is an iCubed Research Fellow embedded at the Institute for Contemporary Art at Virginia Commonwealth University in Richmond, Virginia.<\/p>","slug":"paul_rucker","published_at":"2018-03-04 14:45:00","updated_at":"2020-06-26 01:51:49"}}