{"speaker":{"id":4005,"title":"","firstname":"DeAndrea","middleinitial":"","lastname":"Salvador","description":"Environmental justice advocate","whotheyare":"DeAndrea Salvador reshapes the way we use and engage with energy.","whylisten":"<p>DeAndrea Newman Salvador is an energy expert with a background in economics, an entrepreneur and a founder of two groundbreaking organizations, Renewable Energy Transition Initiative (RETI) and JouleScout. She works to create seamless integration of low-income families into a world of energy abundance.<\/p><p>Witnessing neighbors in her home state of North Carolina struggle to keep up with energy expenses, Salvador&nbsp;took action in 2013 and founded RETI, a nonprofit focused on helping low-income families sustainably reduce energy costs and gain access to cutting-edge technology. Through RETI, Salvador&nbsp;is partnering with Duke Energy (one of the nation&#39;s largest utilities) to launch a low- to moderate-income shared solar program in South Carolina. RETI also worked with the City of Charlotte to create a Smart Home Kick Start for the city&#39;s residents.<br \/>&nbsp;<br \/>Furthering her mission to create energy equity in the new energy economy, Salvador&nbsp;founded JouleScout in 2018. JouleScout is a social enterprise focused on helping energy providers incentivize customers to use less energy at key times without sacrificing comfort, thereby ensuring grid reliability, fewer blackouts and more renewables on the grid with a cost savings to customers.<br \/>&nbsp;<br \/>As a social entrepreneur and advocate, Salvador&nbsp;has been featured by The Atlantic, Fast Company, the BBC, Canadian Broadcasting Corporation, Utility Drive and the Charlotte Observer. Her own articles are published in Pacific Standard Magazine, GOOD, The Development Set, BRIGHT Magazine and on TheWeek.com.<br \/>&nbsp;<br \/>Salvador&nbsp;is a TED2018 Fellow, a recipient of the University of North Carolina at Charlotte Young Alumna of the Year Award and was recognized as one of the Charlotte Mecklenburg Black Chamber of Commerce&#39;s 30 under 30. She is a member of the Mecklenburg County Air Quality Commission and sits on the Board of Directors for Youth Empowered Solutions (YES!).<\/p>","slug":"deandrea_salvador","published_at":"2018-03-04 14:52:00","updated_at":"2018-10-02 14:11:00"}}