{"speaker":{"id":4010,"title":"","firstname":"Simone","middleinitial":"","lastname":"George","description":"Human rights lawyer, activist","whotheyare":"Driven by a belief in fairness, Simone George is a human rights lawyer and activist.","whylisten":"<p>In her human rights legal practice, Simone George represents women and, through them, their children, who are victims of controlling behavior, abuse or violence. Simone believes that the system isn&#39;t broken but built this way -- and that getting to justice requires advocates to be more courageous on behalf of those they represent.<\/p><p>Using a principle-based approach to her work, George co-authored the national study, &quot;The lawlessness of the home,&quot; co-created an international summit in 2016 to cultivate the leadership required to the system and contributed to amendments to domestic violence legislation that is now a significant statement of legal, social and political justice in Ireland. George was also active in the campaigns for marriage equality and reproductive rights in Ireland. When the Pope came to Ireland in August 2018, George, together with a flying column of activists, created Stand For Truth, an alternative space to stand in solidarity with those abused by the church.&nbsp;<\/p><p>Building on her legal training that began with law degrees from NUI Galway and a Master&#39;s from the College of Europe, Bruges, George went on to create public-private partnerships across Africa for BP Solar. Now, following years in big 5 and boutique law firms in Dublin, she practices as a consultant commercial litigator.<\/p><p>In 2010, George&#39;s partner, blind adventure athlete Mark Pollock, broke his back, and together the two learned how paralysis strikes at the very heart of what it means to be human. Her research, which began by Pollock&#39;s hospital bed, became the start of their next adventure -- to cure paralysis in our lifetime. She has been a catalyst for ground-breaking collaborations between scientists and robotics engineers working to cure paralysis and is the subject of award-winning feature documentary film,&nbsp;<a href=\"https:\/\/vimeo.com\/137502216\" target=\"_blank\"><em>Unbreakable<\/em><\/a>.<\/p><p>In addition, George is a director on the board of the Christopher and Dana Reeve Foundation, sits on the Advisory Board of HerStory and holds a diploma in Global Leadership and Public Policy for the 21st Century from Harvard University.<\/p>","slug":"simone_george","published_at":"2018-03-05 22:37:00","updated_at":"2018-09-04 15:19:44"}}