{"speaker":{"id":4013,"title":"","firstname":"Gwynne","middleinitial":"","lastname":"Shotwell","description":"Space leader","whotheyare":"As president and COO of SpaceX, Gwynne Shotwell is responsible for day-to-day operations and for managing all customer and strategic relations.","whylisten":"<p>Gwynne Shotwell joined SpaceX in 2002 as vice president of business development and built the Falcon vehicle family manifest to more than 70 launches, representing more than $10 billion in business. Shotwell is a member of the SpaceX Board of Directors.<br \/>&nbsp;<br \/>Prior to joining SpaceX, Shotwell spent more than 10 years at the Aerospace Corporation, holding positions in space systems engineering and technology and project management. Shotwell was subsequently recruited to be director of Microcosm&#39;s space systems division, managing space system technologies, serving on the executive committee and directing corporate business development.<br \/>&nbsp;<br \/>In 2014, Shotwell was appointed to the United States Export Import Bank&#39;s Advisory Committee and the Federal Aviation Administration&rsquo;s Management Advisory Council. She has been awarded the World Technology Award for Individual Achievement in Space, has been inducted into the Women In Technology International Hall of Fame and was elected to the honorable grade of Fellow with the American Institute of Aeronautics and Astronautics.<br \/>&nbsp;<br \/>SpaceX supports science, technology, engineering and math (STEM) programs locally as well as national engineering programs and competitions. Shotwell has helped raise over $1.4 million for STEM education programs reaching thousands of students nationwide.<br \/>Shotwell received, with honors, her bachelor&rsquo;s and master&rsquo;s degrees from Northwestern University in mechanical&nbsp;engineering and applied mathematics, and she serves as both a University Trustee and a member of the Advisory Council for Northwestern&rsquo;s McCormick School of Engineering. She has authored dozens of papers on a variety of space-related subjects.<\/p>","slug":"gwynne_shotwell","published_at":"2018-03-07 16:24:00","updated_at":"2018-04-17 14:36:59"}}