{"speaker":{"id":4017,"title":"","firstname":"Judith","middleinitial":"","lastname":"Heumann","description":"Disability rights activist","whotheyare":"Judith Heumann is a lifelong advocate for the rights of disabled people.  ","whylisten":"<p>Judith (Judy) Heumann contracted polio in 1949 in Brooklyn, NY and began to experience discrimination at five years old when she was denied the right to attend school because she was a &quot;fire hazard.&quot; Her parents played a strong role in fighting for her rights as a child. Heumann&nbsp;determined that she, working in collaboration with other disabled people, had to play an increasing advocacy role as she and others experienced continuous discrimination because of their disabilities. She is now an internationally recognized leader in the disability rights community and a lifelong civil rights advocate. As a Senior Fellow at the Ford Foundation, she is currently working to help advance the inclusion of disability in the Foundation&rsquo;s work and is leading a project to advance the inclusion of disabled people in the media.&nbsp;&nbsp;<\/p><p>President Obama appointed Heumann&nbsp;as the first Special Advisor for International Disability Rights at the US Department of State, where she served from 2010-2017. Prior to this position, she served as the Director for the Department on Disability Services for the District of Columbia, where she was responsible for the Developmental Disability Administration and the Rehabilitation Services Administration.<\/p><p>From June 2002- 2006, Heumann&nbsp;served as the World Bank&#39;s first Adviser on Disability and Development. In this position, she led the World Bank&#39;s disability work to expand the Bank&rsquo;s knowledge and capability to work with governments and civil society on including disability in the global conversation. From 1993 to 2001, Heumann&nbsp;served in the Clinton Administration as the Assistant Secretary for the Office of Special Education and Rehabilitative Services in the Department of Education. She was also responsible for the implementation of legislation at the national level for programs in special education, disability research, vocational rehabilitation and independent living, serving more than 8 million youth and adults with disabilities.<\/p><p>Heumann graduated from Long Island University in Brooklyn, NY in 1969 and received her Master&rsquo;s in Public Health from the University of California at Berkeley in 1975. Her goal in life is to continue to advance the rights and empowerment of ALL disabled people around the world. She is also currently building an online presence through The Heumann Perspective which can found on&nbsp;<a href=\"https:\/\/www.facebook.com\/TheHeumannPerspective\/\" target=\"_blank\">Facebook<\/a>,&nbsp;<a href=\"https:\/\/www.youtube.com\/channel\/UCB7pemkbDQYezB6PeDFXTvg\" target=\"_blank\">YouTube<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/twitter.com\/judithheumann\" target=\"_blank\">Twitter<\/a>.<\/p>","slug":"judith_heumann","published_at":"2018-03-08 18:50:00","updated_at":"2018-04-04 16:58:51"}}