{"speaker":{"id":4019,"title":"","firstname":"Chris","middleinitial":"","lastname":"Nowinski","description":"Social entrepreneur","whotheyare":"Dr. Chris Nowinski is leading a global conversation on concussions, CTE and the future of sports.","whylisten":"<p>Dr. Chris Nowinski is an All-Ivy Harvard football player-turned WWE professional wrestler-turned neuroscientist. He discovered the concussion crisis the hard way: a 2003 kick to the chin in a WWE tag-team match ended his career, causing post-concussion syndrome and sending him on a journey where he uncovered a public health conspiracy that continues to cost lives.&nbsp;<\/p><p>Nowinski wrote the investigative expose&nbsp;<a href=\"http:\/\/geni.us\/bqHO\" target=\"_blank\"><em>Head Games: Football&rsquo;s Concussion Crisis<\/em><\/a>&nbsp;in 2006 and soon after founded the non-profit Concussion Legacy Foundation (CLF), where he serves as CEO. He co-founded the world-famous Boston University (BU) CTE Center, where he serves as the outreach, recruitment, education, and public&nbsp;policy leader, as well as the VA-BU-CLF Brain Bank, where he led recruitment for the&nbsp;<a href=\"https:\/\/www.nytimes.com\/interactive\/2017\/07\/25\/sports\/football\/nfl-cte.html\" target=\"_blank\">2017 study<\/a>&nbsp;that found 110 of 111 deceased NFL players had CTE. His journey has been profiled in media outlets like&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=qa-lqF1K3uI\" target=\"_blank\">HBO&#39;s &quot;Real Sports&quot;<\/a>,&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=5-hIBG6it5E\" target=\"_blank\">ESPN&#39;s &quot;Outside the Lines&quot;<\/a>&nbsp;and the&nbsp;<a href=\"http:\/\/www.nytimes.com\/2007\/01\/18\/sports\/football\/18waters.html\" target=\"_blank\"><em>New York Times<\/em><\/a>,&nbsp;and he was the subject of the award-winning documentary&nbsp;<a href=\"http:\/\/headgamesthefilm.com\/\" target=\"_blank\"><em>Head Games: The Global Concussion Crisis<\/em><\/a>&nbsp;by celebrated director Steve James.<\/p><p>Nowinski earned his doctorate in behavioral neuroscience from Boston University School of Medicine and has authored more than 25 scientific publications. VICE Sports called Nowinski &quot;the man most responsible for making CTE part of the national conversation,&quot; and <em>Sports Illustrated<\/em> said, &quot;It is Nowinski&#39;s figure which looms behind the doctors and the headlines and the debate roiling over sports&#39;newfound commitment to minimizing head trauma.&quot;<\/p>","slug":"chris_nowinski","published_at":"2018-03-19 14:29:00","updated_at":"2018-03-19 17:08:29"}}