{"speaker":{"id":4023,"title":"","firstname":"Christian","middleinitial":"","lastname":"Picciolini","description":"Counter-extremism specialist","whotheyare":"Christian Picciolini is dedicated to helping others counter racism and extremism.","whylisten":"<p>Christian Picciolini is an award-winning television producer, public speaker, author, antiracism advocate and former extremist. After leaving the hate movement he helped create during the 1980s and 90s, he began the painstaking process of making amends and rebuilding his life. He went on to earn a degree in international relations from DePaul University and launched Goldmill Group, a counter-extremism consulting and digital media firm. In 2016, he won an Emmy Award for producing an anti-hate advertising campaign aimed at helping people disengage from extremism.<\/p><p>For nearly two decades, Picciolini&nbsp;has helped hundreds of individuals leave hate behind through his disengagement work and the organizations he founded. He has spoken all over the world, sharing his unique and extensive knowledge about how to effectively prevent and counter extremism. He chronicles his involvement in and exit from the early American white-supremacist skinhead movement in his memoir,&nbsp;<a href=\"http:\/\/geni.us\/jMHUEOz\" target=\"_blank\"><em>White American Youth: My Descent into America&#39;s Most Violent Hate Movement&mdash;and How I Got Out<\/em><\/a>, and is the featured subject in season three of WBEZ&#39;s <em>Motive<\/em>&nbsp;podcast, which received the 2021 National Edward R. Murrow Award for best podcast in large market radio. He showcased his disengagement work in a second book,&nbsp;<a href=\"https:\/\/geni.us\/FbJ2I\" target=\"_blank\"><em>Breaking Hate: Confronting the New Culture of Extremism<\/em><\/a>, published in 2020 by Hachette Books, as well as in the MSNBC documentary series of the same name, which aired in 2018-2019. He is the host of the <em>F Your Racist History<\/em>&nbsp;podcast, a scripted history show that tells America&#39;s hidden, overlooked and unknown racist origin stories. The first season of it is currently available across major podcast platforms.&nbsp;<\/p>","slug":"christian_picciolini","published_at":"2018-03-22 20:49:00","updated_at":"2021-12-17 20:39:53"}}