{"speaker":{"id":4037,"title":"","firstname":"José","middleinitial":"","lastname":"Andrés","description":"Chef, humanitarian","whotheyare":"José Andrés is a committed advocate of food and hunger issues and is known for championing the role of chefs in the national debate on food policy.","whylisten":"<p>Named one of <em>TIME<\/em>&#39;s &quot;100 Most Influential People,&quot; awarded &quot;Outstanding Chef&quot; and &quot;Humanitarian of the Year&quot; by the James Beard Foundation, Jos&eacute; Andr&eacute;s is an internationally-recognized culinary innovator, author, educator, television personality, humanitarian and chef\/owner of ThinkFoodGroup. A pioneer of Spanish tapas in the United States, he is also known for his groundbreaking avant-garde cuisine and his award-winning group of 28 restaurants plus a food truck located throughout the country and in Mexico City. Andr&eacute;s&nbsp;is the only chef globally that has both a two-star Michelin restaurant and four Bib Gourmands. His award-winning restaurants include two Michelin starred minibar by Jos&eacute; Andr&eacute;s, Jaleo, Zaytinya, J by Jos&eacute; Andr&eacute;s at W Mexico City, Bazaar Meat at SLS Las Vegas, the Bazaar by Jos&eacute; Andr&eacute;s at the SLS Hotel in Beverly Hills and South Beach, and Beefsteak, his vegetable-driven fast-casual concept. Andr&eacute;s is a committed advocate of food and hunger issues and is known for championing the role of chefs in the national debate on food policy. In 2012, he formed World Central Kitchen, a non-profit that provides smart solutions to hunger and poverty by using the power of food to empower communities and strengthen economies. Together with World Central Kitchen and #ChefsforPuertoRico, Andr&eacute;s served more than 3.3 million meals in Puerto Rico following the devastation of Hurricane Maria in 2017, reaching communities in need across all 78 municipalities through 23 kitchens.<\/p><p>Andr&eacute;s&#39;s work has earned awards and distinctions including the 2017 Lifetime Achievement Award from International Association of Culinary Professionals and the 2015 National Humanities Medal, one of twelve distinguished recipients of the award from the National Endowment for the Humanities. Andr&eacute;s was also named EY Master Entrepreneur of the Year in Greater Washington for his leadership and impact on the global business community and was also awarded the Congressional Hispanic Caucus Institute&rsquo;s Chair&rsquo;s Medallion Award.&nbsp;<\/p>","slug":"jose_andres","published_at":"2018-04-02 16:05:00","updated_at":"2018-04-11 22:20:50"}}