{"speaker":{"id":4038,"title":"","firstname":"Rébecca","middleinitial":"","lastname":"Kleinberger","description":"Voice expert","whotheyare":"Rébecca Kleinberger is a voice expert pursuing research as a PhD candidate in the MIT Media Lab’s Opera of the Future group. ","whylisten":"<p>R&eacute;becca Kleinberger creatively mixes science, engineering, design and art to explore ways to craft experiences for vocal connection. As part of this work, she designs unique experiences to help people connect with themselves and with others. She accomplishes this using approaches that include projection mapping, virtual reality, rapid prototyping, deep learning, real-time digital signal processing, lasers, wearable technologies and robotics. See examples ranging from a projection ball gown to a memory music box to assistive wearable devices for stutterers on&nbsp;<a href=\"http:\/\/rebeccakleinberger.com\/\" target=\"_blank\">her portfolio<\/a>.<\/p><p>Throughout six years of work on self-reflection technologies, Kleinberger&nbsp;has developed unique expertise on the human voice as a means of self-connection as well as with others and between species. Her research spans a wide range of fields including neurology, human-computer interaction, psychology, cognitive sciences, physics, biology, clinical research, linguistics, communication theory and assistive technologies. With these tools, people discover more about themselves and the expression they project.<\/p><p>Kleinberger&#39;s work was featured on the cover of the <em>Financial Times<\/em> Magazine and has been shown at a wide range of events and venues including the Museum of Fine Art in Boston, Le Laboratoire in Paris, Siggraph Art exhibition in Los Angeles, the &quot;Hacking Consciousness&quot;exhibit at the Harvard Divinity School and EMF camp in the UK. She has collaborated with Microsoft Research UK and the Google Magenta team&nbsp;and has presented her research at a host of international conferences. Working with Tod Machover, head of the Opera of the Future group, and other group members, her research has also been deployed outside the MIT Media Lab as part of live shows and novel esthetic experiences at Maison Symphonique de Montreal, the Lucerne Festival in Switzerland and the Winspear Opera House in Dallas. Her work has also been featured in Engadget and &quot;60 Minutes.&quot;<\/p><p>Kleinberger graduated from &Eacute;cole National des Arts et M&eacute;tiers in Paris with a Master&#39;s of Mechanical Engineering and from University College London with a Master of Research in Virtual Environments, Imaging and Visualization. She is also experienced in the art of shearing sheep and raising hedgehogs.<\/p><p>(Photo:&nbsp;Stephanie Ku)&nbsp;<\/p>","slug":"rebecca_kleinberger","published_at":"2018-04-03 20:52:00","updated_at":"2018-05-03 20:00:27"}}