{"speaker":{"id":4045,"title":"","firstname":"Dread","middleinitial":"","lastname":"Scott","description":"Visual artist","whotheyare":"Dread Scott makes revolutionary art to propel history forward. ","whylisten":"<p>Dread Scott&#39;s work is exhibited across the US and internationally. In 1989, his art became the center of national controversy over its transgressive use of the American flag, while he was a student at the School of the Art Institute of Chicago. President G.H.W. Bush called his art &quot;disgraceful,&quot; and the entire US Senate denounced and outlawed this work. Scott became part of a landmark Supreme Court case when he and others defied the new law by burning flags on the steps of the US Capitol. His studio is now based in Brooklyn.&nbsp;<\/p><p>Scott&#39;s work has been included in exhibitions at New York&#39;s MoMA PS1, the Walker Art Center, Minneapolis and Gallery MOMO in Cape Town, South Africa. His performance work has been presented at BAM in Brooklyn and on the streets of Harlem, NY. His work is in the collection of the Whitney Museum of American Art and the Brooklyn Museum, and it has been featured on the cover of <em>Artforum<\/em> magazine and the front page of NYTimes.com. Scott is a recipient of a 2018 United States Artists Fellowship and grants from the Creative Capital Foundation and the Open Society Institute. He works in a range of media, from performance and photography to screen-printing and video.&nbsp; &nbsp;<\/p><p>Scott plays with fire -- metaphorically and sometimes literally -- as when he burned $171 on Wall Street and encouraged those with money to add theirs to the pyre. His work asks viewers to look soberly at America&#39;s past and our present. Writing about a recent banner project, Angelica Rogers wrote in the <em>New York Times:<\/em>&nbsp;&quot;...it was difficult to look away from the flag&#39;s blocky, capitalized type. &#39;A Man Was Lynched by Police Yesterday.&#39; It shouted the words so matter-of-factly that I felt myself physically flinch.&quot;<\/p><p>Scott is currently working on Slave Rebellion Reenactment, a community engaged performance that will reenact the largest rebellion of enslaved people in American History.<\/p>","slug":"dread_scott","published_at":"2018-04-06 21:55:00","updated_at":"2018-08-27 14:34:41"}}