{"speaker":{"id":4067,"title":"","firstname":"Jessica","middleinitial":"","lastname":"Pryce","description":"Child advocate, social scientist","whotheyare":"Jessica Pryce creates strategies to reduce the impact of racial bias in child protective services.","whylisten":"<p>Jessica Pryce curates child welfare research that focuses on answering legislative questions and informing social policy. She has conducted research at the state and national level while publishing and presenting her work nationally and internationally. Her research has focused on the training and education of the workforce, racial disparity in child welfare decisions, and the disproportionality in our country&#39;s foster care system. Pryce is executive director of a research center at Florida State University<\/p><p>After earning her PhD at Howard University and working in New York state for two years, Pryce was appointed in 2016 the new&nbsp;<a href=\"http:\/\/news.fsu.edu\/news\/education-society\/2017\/01\/11\/fsu-hires-alumna-lead-statewide-institute-child-welfare\/\" target=\"_blank\">Executive Director<\/a> of the Florida Institute for Child Welfare, where she mobilizes social scientists devoted to improving the intractable issues that have negatively impacted the lives of vulnerable children and their families. She is currently engaged in a multi-year project focused on illuminating the experiences of black parents as they matriculate through child protective services. That same year, Pryce published an&nbsp;<a href=\"https:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/15548732.2018.1467354\" target=\"_blank\">article<\/a> illuminating strategies for the promotion of racial equity in a community on Long Island, NY.<\/p><p>In 2018, she was selected as a&nbsp;<a href=\"https:\/\/blog.ted.com\/meet-the-spring-2018-class-of-ted-residents\/\" target=\"_blank\">TED Resident<\/a>.&nbsp;During the residency, she worked to disseminate strategies to child welfare agencies with the goal of their adopting Blind Removals, a racial equity strategy in child protection. Understanding the negative impact of removing children from their parents unnecessarily, Pryce has also written on the lingering, historical trauma of&nbsp;<a href=\"https:\/\/theconversation.com\/the-long-history-of-separating-families-in-the-us-and-how-the-trauma-lingers-98616\" target=\"_blank\">sanctioned family separations<\/a> in the US.<\/p>","slug":"jessica_pryce","published_at":"2018-05-21 20:54:00","updated_at":"2018-09-11 16:08:41"}}