{"speaker":{"id":407,"title":"","firstname":"David","middleinitial":"","lastname":"Merrill","description":"MIT grad student","whotheyare":"David Merrill works on Siftables, tiny computer blocks that interact with each other to make networks (and music).","whylisten":"<p>David Merrill is currently the VP of Product at 3D Robotics, where he builds new, easy-to-use flying robots. He was formerly president and co-founder of Sifteo, a San Francisco startup spun out of his research at the MIT Media Lab. This research helped build an award-winning physical+digital play system and catalog of unique games. He also directed HW and SW on Sifteo products. <\/p><p>David constantly tinkers with next-generation technologies to make physical+digital tools that give people new powers (for good).<\/p><p>He is a human-computer interaction expert, frequent public speaker and aerial photography enthusiast. David&#39;s work has been featured by MoMA, the Disocvery Channel, Popular Science and Wired.<\/p><p>His main interest now is the Siftables project, the subject of his TEDTalk, on which he works with <a href=\"http:\/\/web.media.mit.edu\/~jeevan\/\" target=\"_blank\">Jeevan Kalanithi<\/a>. In another field of inquiry, Merrill is looking at ways to access digital information <a href=\"http:\/\/www.media.mit.edu\/resenv\/\" target=\"_blank\">in the wider world<\/a>, when we are <a href=\"http:\/\/web.media.mit.edu\/~dmerrill\/invisible_media.html\" target=\"_blank\">away from a traditional computer<\/a>. <\/p><p>A musician himself, Merril also has a deep interest in <a href=\"http:\/\/inventmusic.org\/\" target=\"_blank\">new musical interfaces<\/a>. His <a href=\"http:\/\/web.media.mit.edu\/~dmerrill\/adaptive_controller.html\" target=\"_blank\">Adaptive Music Controller<\/a>  is an instrument that learns its player (rather than the player learning the instrument). And working musicians should check out his <a href=\"http:\/\/web.media.mit.edu\/~dmerrill\/audiopint.html\" target=\"_blank\">AudioPint<\/a>, a portable case that consolidates instruments, effects and audio processors into a gig-safe rugged housing. <\/p>","slug":"david_merrill","published_at":"2009-02-12 01:00:00","updated_at":"2015-06-05 13:47:59"}}