{"speaker":{"id":410,"title":"","firstname":"Richard","middleinitial":"","lastname":"Pyle","description":"Ichthyologist","whotheyare":"Ichthyologist Richard Pyle is a fish nerd. In his quest to discover and document new species of fish, he has also become a trailblazing exploratory diver and a pioneer of database technology. ","whylisten":"<p>A pioneer of the dive world, Richard Pyle discovers new biodiversity on the cliffs of coral reefs. He was among the first to use rebreather technology to explore <strong>depths between 200 and 500 feet, an area often called the <a href=\"http:\/\/www.bishopmuseum.org\/research\/treks\/palautz97\/tz.html\" target=\"_blank\">&quot;Twilight Zone.&quot;<\/a><\/strong>  During his dives, he has identified and documented hundreds of new species. Author of scientific, technical and popular articles, his expeditions have also been featured in the <a href=\"http:\/\/www.coralfilm.com\/\" target=\"_blank\">IMAX film <em>Coral Reef Adventure<\/em><\/a>,  the <a href=\"http:\/\/www.bbc.co.uk\/programmes\/b00d55lm\" target=\"_blank\">BBC series <em>Pacific Abyss<\/em><\/a> and many more. In 2005, he received the <a href=\"http:\/\/www.auas-nogi.org\/nogi.html\" target=\"_blank\">NOGI Award<\/a>, the most prestigious distinction of the diving world. <\/p><p>Currently, he is continuing his research at the <a href=\"http:\/\/www.bishopmuseum.org\/index.html\" target=\"_blank\">Bernice P. Bishop Museum<\/a>, outside Honolulu, Hawai&#39;i, and is affiliated with the museum&#39;s comprehensive <a href=\"http:\/\/hbs.bishopmuseum.org\/hbs1.html\" target=\"_blank\">Hawaii Biological Survey<\/a>. He also serves on the Board of Directors for the <a href=\"http:\/\/www.marineexploration.org\/\" target=\"_blank\">Association for Marine Exploration<\/a>, of which he is a founding member. He continues to explore the sea and spearhead rebreather technology, and is a major contributor to the <a href=\"http:\/\/www.eol.org\/\" target=\"_blank\">Encyclopedia of Life<\/a>. <\/p>","slug":"richard_pyle","published_at":"2009-02-25 01:00:00","updated_at":"2012-02-05 04:34:33"}}