{"speaker":{"id":413,"title":"","firstname":"Brenda","middleinitial":"","lastname":"Laurel","description":"Designer and theorist","whotheyare":"Brenda Laurel has been part of several major revolutions in the way humans use computers: virtual reality, interactive narratives and some fresh approaches to gaming.","whylisten":"<p>With a PhD in theater and a focus on interactive narratives, Brenda Laurel landed in Silicon Valley at the perfect moment -- at a time when theorists and technologists were exploring<strong> new ways that our expanded computing power could link us and entertain us<\/strong> in ways we couldn&#39;t yet imagine. She worked as a software designer and researcher for Atari and Activision, and co-founded a <a href=\"http:\/\/tauzero.com\/Brenda_Laurel\/Resume\/TelepresenceResearch.html\" target=\"_blank\">telepresence company<\/a>  in 1990.<\/p><p>In 1994 she became a founding member of Paul Allen and David Liddle&#39;s <a href=\"http:\/\/en.wikipedia.org\/wiki\/Interval_Research_Corporation\" target=\"_blank\">Interval Research<\/a>, a legendary Silicon Valley think tank studying the connection between tech and everyday life. Interval was meant to spin off profitable companies, and <strong>Laurel led one of the highest-profile spinoffs, Purple Moon<\/strong>, a software company devoted to making games and interactive communities for girls. In the end-of-the-&#39;90s collapse of the CD-ROM market, Purple Moon was acquired by Mattel and killed. Laurel wrote about the experience in the monograph <em><a href=\"http:\/\/geni.us\/10Fh\" target=\"_blank\">Utopian Entrepreneur<\/a><\/em>, &quot;a guide to doing socially positive work in the context of business.&quot;<\/p><p>Laurel is the chair of the <a href=\"http:\/\/www.cca.edu\/academics\/graduate\/design\/faculty\" target=\"_blank\">Graduate Program in Design<\/a>  at <a href=\"http:\/\/www.cca.edu\/\" target=\"_blank\">California College of the Arts<\/a>. Her paper &quot;<a href=\"http:\/\/tauzero.com\/Brenda_Laurel\/DesignedAnimism\/DesignedAnimism.html\" target=\"_blank\">Designed Animism<\/a>: Poetics for a New World&quot; looks at the new field of distributed sensing and how it can help us discover patterns in nature. <\/p><p>Read the TED Blog&#39;s <a href=\"http:\/\/blog.ted.com\/2009\/03\/02\/interview_with_2\/\" target=\"_blank\">Q&amp;A with Brenda Laurel &gt;&gt;<\/a> <\/p>","slug":"brenda_laurel","published_at":"2009-03-02 01:00:00","updated_at":"2015-10-07 19:17:07"}}