{"speaker":{"id":4156,"title":"","firstname":"Elizabeth","middleinitial":"","lastname":"White","description":"Author, advocate","whotheyare":"Elizabeth White is an author and aging solutions advocate for older adults facing uncertain work and financial insecurity.","whylisten":"<div>When Elizabeth White could not find a book that met her needs during her own bout of long-term unemployment, she wrote it herself. She wrote it as a 62-year-old woman who has lived the stories she describes, and as a Harvard MBA, former retail entrepreneur and C-suite executive who never expected to land here.<\/div><div><br \/><\/div><div>Three years ago, White wrote an essay describing her own precarious financial situation and that of a number of her boomer age friends, all former high earners with advanced degrees. The essay was published online and within three days it had received over 11,000 likes and 1,000 comments. Many wrote to White directly sharing stories of hardship and struggle. The economics of aging was forcing them to abandon dreams of launching fulfilling second- and third-act careers to take part-time, low wage jobs to pay the bills. In their stories, White saw her own, and the idea of writing a book was born.<\/div><div><br \/><\/div><div>White&#39;s book,&nbsp;<a href=\"http:\/\/geni.us\/UBX8Tb\" target=\"_blank\"><em>55, Underemployed, and Faking Normal<\/em><\/a>&nbsp;is about the millions of older Americans who, despite a history of career choice and decent incomes, are facing (often for the first time) the prospect of downward mobility in old age. Based on expert research and interviews with older adults, the book looks at the tools and strategies boomers can utilize to make sense of changed circumstances, better manage financial hardship and achieve a more inner-directed and satisfying life.<\/div><div>&nbsp;<\/div><div>White&#39;s message is striking a chord. She is among a small but growing minority seeking to reframe the national conversation we&#39;re having on aging, work and retirement. White is a frequent guest blogger and speaker at conferences and workshops, and she has recently been named one of the top 50 influencers on aging in the country. Her essays and work have appeared in publications like <em>Forbes<\/em>, The Huffington Post, Next Avenue and <em>The Washington Post<\/em>. And she has been featured prominently in three segments on the&nbsp;<a href=\"http:\/\/www.pbs.org\/newshour\/bb\/55-unemployed-faking-normal-one-womans-story-barely-scraping\/\" target=\"_blank\">PBS NewsHour<\/a>.<\/div><div><br \/><\/div>","slug":"elizabeth_white","published_at":"2018-06-28 20:24:00","updated_at":"2018-07-12 19:47:00"}}