{"speaker":{"id":416,"title":"","firstname":"Don","middleinitial":"","lastname":"Norman","description":"Cognitive scientist and design critic","whotheyare":"Don Norman studies how real people interact with design, exploring the gulf between what a designer intends and what a regular person actually wants. His work has resulted in some classic books, including \"The Design of Everyday Things.\"","whylisten":"<p>Don Norman is an anthropologist of modern life, studying the way we humans interact with our designed world. Though he has a <em>slight<\/em> reputation as a grumpy critic, his work is generous and insightful -- he wants nothing less than to close the gap between products and their users. <strong>If you&#39;ve ever fought with an automatic faucet in an airport bathroom<\/strong>, or wondered which button to press in the anonymous row on top of your printer, it&#39;s good to know that Norman is in your corner. He&#39;s the author of a raft of <a href=\"http:\/\/www.jnd.org\/books.html\" target=\"_blank\">books<\/a>  on design and the way we humans interact with it, including the classic &quot;Design of Everyday Things.&quot; His next book, says his <a href=\"http:\/\/jnd.org\/index.html\" target=\"_blank\">website<\/a>, will be about <a href=\"http:\/\/jnd.org\/dn.mss\/sociable_design_-_introduction.html\" target=\"_blank\">sociable design<\/a>.<\/p><p>Norman began his <a href=\"http:\/\/www.jnd.org\/bio-sketch.html\" target=\"_blank\">career<\/a>  as an academic, working in psychology and then cognitive science at UCSD. In the mid-&#39;90s, he joined Apple and ended up in their Advanced Technology Group, and later worked for HP, before returning to university life. He&#39;s now the co-director of <strong>an innovative combined MBA and MEM program (called <a href=\"http:\/\/mmm.northwestern.edu\/\" target=\"_blank\">MMM<\/a>)<\/strong> at Northwestern University. He&#39;s also a cofounder of the usability consultancy <a href=\"http:\/\/www.nngroup.com\/\" target=\"_blank\">Nielsen Norman Group<\/a>. <\/p>","slug":"don_norman","published_at":"2009-03-09 01:00:00","updated_at":"2009-03-09 09:18:18"}}