{"speaker":{"id":417,"title":"","firstname":"Pranav","middleinitial":"","lastname":"Mistry","description":"Director of research, Samsung Research America","whotheyare":"As an MIT grad student, Pranav Mistry invented SixthSense, a wearable device that enables new interactions between the real world and the world of data.","whylisten":"<p>When Pranav Mistry was a PhD student in the Fluid Interfaces Group at MIT&#39;s Media Lab, he worked with lab director Pattie Maes to create some of the most entertaining and thought-provoking interfaces the world had ever seen. And not just computer interfaces, mind you -- these are ways to help the digital and the actual worlds interface. Imagine: intelligent sticky notes, <a href=\"http:\/\/www.pranavmistry.com\/projects\/quickies\/\" target=\"_blank\">Quickies<\/a>, that can be searched and can send reminders; a <a href=\"http:\/\/ambient.media.mit.edu\/projects.php?action=details&amp;id=54\" target=\"_blank\">pen<\/a>  that draws in 3D; and <a href=\"http:\/\/www.pranavmistry.com\/projects\/tapuma\/\" target=\"_blank\">TaPuMa<\/a>, a tangible public map that can act as Google of physical world. And of course the legendary <a href=\"http:\/\/www.pranavmistry.com\/projects\/sixthsense\/\" target=\"_blank\">SixthSense<\/a>, which is now <a href=\"https:\/\/code.google.com\/p\/sixthsense\/\" target=\"_blank\">open sourced<\/a> <\/p><p>Before his studies at MIT, he worked with Microsoft as a UX  researcher; he&#39;s a graduate of IIT. Now, as director of research at <a href=\"http:\/\/www.sisa.samsung.com\/\" target=\"_blank\">Samsung Research America<\/a>, Mistry heads the Think Tank Team, an interdisciplinary group of researchers that hunts for new ways to mix digital informational with real-world  interactions. As an example, Mistry launched the company&#39;s smartwatch, the <a href=\"http:\/\/www.bgr.in\/manufacturers\/samsung\/pranav-mistry-is-the-indian-brain-behind-samsungs-galaxy-gear-smartwatch\/\" target=\"_blank\">Galaxy Gear<\/a>, in 2013. <\/p>","slug":"pranav_mistry","published_at":"2009-03-10 01:00:00","updated_at":"2014-07-13 14:51:27"}}