{"speaker":{"id":4171,"title":"","firstname":"Nikki","middleinitial":"","lastname":"Clifton","description":"Attorney, government affairs professional","whotheyare":"Nikki Clifton represents UPS's interests before Members of US Congress, federal agencies and the states’ Attorneys General.","whylisten":"<p>Nicole (&quot;Nikki&quot;) Clifton is an attorney and government affairs professional with broad advocacy experience on Capitol Hill and in federal and state courts. Her expertise includes labor and workforce legislative and regulatory policy and transportation and logistics industry issues. Clifton recently spearheaded and coordinates UPS&#39;s nationwide anti-human trafficking awareness initiative, reaching more than 95,000 drivers and service providers.&nbsp;<\/p><p>Prior to government affairs, Clifton&nbsp;served as Labor &amp; Employment Counsel for UPS in Atlanta, Georgia, and was in-house counsel to the UPS National Negotiating Committee during collective bargaining with the International Brotherhood of Teamsters in 2007. Clifton also served as UPS&#39;s Employment Counsel, managing employment litigation and providing counseling and training in all areas of employment law.<\/p><p>Before UPS, Clifton&nbsp;worked for Delta Air Lines as Flight Operations counsel. She also practiced labor and employment law with Alston &amp; Bird LLP and Smith, Currie and Hancock, in Atlanta, Georgia.<\/p><p>Clifton&nbsp;received her B.A. <em>magna cum laude<\/em> in Communications from Howard University&#39;s Annenberg Honors Program and received her J.D. from the University of Georgia School Of Law. She is a member of the Georgia Bar and is admitted to practice before the United States Supreme Court. Clifton&nbsp;was selected as a member of Leadership Atlanta&#39;s Class of 2008 and served on the Board of Visitors for the University of Georgia School of Law. Clifton was inducted into the inaugural class of national 4-H Luminaries in 2017. She co-leads a Junior Girl Scout troop and volunteers with several non-profit organizations. She resides in Washington, D.C. and has two children.<\/p>","slug":"nikki_clifton","published_at":"2018-07-11 21:20:00","updated_at":"2018-09-06 14:38:04"}}