{"speaker":{"id":4196,"title":"","firstname":"Halima","middleinitial":"","lastname":"Aden","description":"Model","whotheyare":"Halima Aden was the first ever hijab-wearing fashion model.","whylisten":"<p>Somali-American model Halima Aden was born in Kakuma, a refugee camp in Kenya, after her family fled civil war in Somalia. She lived there for seven years before traveling to the United States and settling in St. Louis. Though she spoke Somali and Swahili, Aden was thrust into an English-speaking school system that lacked a language immersion curriculum entirely. Despite this seeming detriment, she quickly found herself in advanced placement English classes in high school, outperforming her classmates and demonstrating the resilience that makes her a powerhouse today.<\/p><p>Aden first made headlines after competing in the Miss USA state pageant, wearing a hijab and sporting a burkini in the swimsuit portion of the competition -- a first in the 65-year history of the event. She finished among the top 15 finalists, and her performance caught the eye of Carine Roitfeld, who recruited her to appear in what was Aden&#39;s first editorial. The CR Fashion Book cover, however, came as a surprise to Aden and marked the beginning of a new cultural phenomenon. Since then, she has covered <em>Vogue Arabia<\/em>, <em>British Vogue<\/em>, <em>Teen Vogue<\/em>, <em>Grazia UK<\/em>, <em>S Moda<\/em> and <em>Allure,<\/em> in which the publication heralded her as an all-American beauty, a crucial acknowledgment for America&#39;s Muslim community. Aden&#39;s editorial credits also include <em>Harper&#39;s Bazaar<\/em> and <em>Glamour<\/em>, and she appeared on the runway for Yeezy, Alberta Ferretti, Max Mara, Philipp Plein and Dolce &amp; Gabbana. Rihanna tapped her to appear in the campaign for her inclusive beauty brand, Fenty Beauty.<\/p><p>Aden was recently named an official UNICEF Ambassador. When she&#39;s not working, she covets time spent with family and friends on the couch indulging in Netflix marathons.<\/p>","slug":"halima_aden","published_at":"2018-08-15 00:16:00","updated_at":"2018-08-30 14:56:52"}}