{"speaker":{"id":420,"title":"","firstname":"Marcus","middleinitial":"","lastname":"du Sautoy","description":"Mathematician","whotheyare":"Oxford's newest science ambassador Marcus du Sautoy is also author of <i>The Times<\/i>' Sexy Maths column. He'll take you footballing with prime numbers, whopping symmetry groups, higher dimensions and other brow-furrowers.","whylisten":"<p>Marcus du Sautoy only permits prime numbers on the uniforms of his football team, but that idiosyncrasy isn&#39;t (entirely) driven by superstition -- just pure love. (His number is 17.) You might say <strong>primes, &quot;the atoms of mathematics,&quot; as he calls them, are du Sautoy&#39;s intellectual spouse<\/strong>, the passion that has driven him from humble-enough academic beginnings to a spectacular and awarded career in maths, including a Royal Society fellowship and, of course, his recent election to the Simonyi Professorship for the Public Understanding of Science, the post previously held by Richard Dawkins.<br \/><br \/><strong>A gifted science communicator<\/strong> -- interesting fashion sense aside -- du Sautoy has most recently been host of the BBC miniseries &quot;The Story of Maths,&quot; which explores fascinating mathematical theories and techniques from throughout history and across cultures. Before that, he hosted The Num8er My5teries, a lecture series on history&#39;s stubbornest math problems -- <strong>the sorts of conundrums that get your head griddle-hot with thinking<\/strong>. He&#39;s also author, perhaps most famously, of&nbsp;<em><a href=\"http:\/\/geni.us\/musicoftheprimes\" target=\"_blank\">The Music of the Primes<\/a>,<\/em>&nbsp;an engaging look at the often Pyrrhic attempts at cracking the Riemann Hypothesis. His 2008 book,&nbsp;<a href=\"http:\/\/geni.us\/symmetry\" target=\"_blank\"><em>Symmetry: A Journey into the Patterns of Nature<\/em><\/a>, looks at various kinds of mathematical and aesthetic symmetry, including a massive, mysterious object called &quot;the Monster&quot; that exists in 196,883 dimensions.<\/p>","slug":"marcus_du_sautoy","published_at":"2009-03-17 14:49:00","updated_at":"2015-09-26 01:10:44"}}