{"speaker":{"id":422,"title":"","firstname":"Adam","middleinitial":"","lastname":"Savage","description":"Maker, critical thinker","whotheyare":"Adam Savage is an internationally renowned television producer, host and public speaker.","whylisten":"        <p class=\"p1\">Adam Savage&#39;s mother is a psychologist; his father was a celebrated artist, painter and filmmaker. From the youngest age they encouraged his flights of fancy.&nbsp;Savage&nbsp;has been a paperboy, a projectionist, juggler, unicycle rider, sculptor, graphic designer, scenic painter, robot builder, welder, carpenter, machinist, prop maker, toy designer, actor, writer, executive producer and director. He spent six years in theater and 10 years in commercial and film special effects working for clients such as Nike, Corning, Hershey&#39;s, and Coca-Cola, and films like <em>Star Wars<\/em>, <em>The Matrix<\/em> films, <em>A.I.<\/em>, <em>Space Cowboys<\/em>, <em>Terminator 3<\/em>&nbsp;and <em>Galaxy Quest<\/em>.<\/p><p class=\"p1\">Savage has built everything from theater sets to miniature particle accelerators. From spaceships to animatronic arms. He&#39;s made Rube Goldberg machines, hand props and spacesuits. His online videos have generated over 230 million page views. He&#39;s written for <em>Popular Mechanics<\/em>, the <em>Wall Street Journal<\/em> and <em>Wired<\/em>  Magazine, among others. His program &quot;<a href=\"http:\/\/www.discovery.com\/tv-shows\/mythbusters\/\" target=\"_blank\">Mythbusters<\/a>&quot; produced 270 episodes that aired in over 100 countries for 14 years. Adam shares his builds, his love for movie props and costumes, and passion for the transformative power of making on his award winning website&nbsp;<a href=\"http:\/\/www.tested.com\/\" target=\"_blank\">Tested.com<\/a>. He lives in San Francisco with his wife Julia, his twin boys Thing1 and Thing2, and two amazing dogs.<\/p><p class=\"p1\">(Photo: Michael Shindler)<\/p>","slug":"adam_savage","published_at":"2009-03-18 01:00:00","updated_at":"2016-07-15 12:42:29"}}