{"speaker":{"id":4365,"title":"","firstname":"Amy","middleinitial":"","lastname":"Herman","description":"Visual educator","whotheyare":"By showing people how to look closely at painting, sculpture and photography, Amy Herman helps them hone their visual intelligence to recognize the most pertinent and useful information as well as recognize biases that impede decision making.","whylisten":"<p>Amy Herman is a lawyer and art historian who uses works of art to sharpen observation, analysis and communication skills. She developed her&nbsp;<a href=\"http:\/\/www.artfulperception.com\/\" target=\"_blank\">Art of Perception<\/a>&nbsp;seminar in 2000 to improve medical students&#39; observation and communication skills with their patients when she was the head of education at The Frick Collection in New York City. She subsequently adapted the program for a wide range of professionals and leads sessions internationally for the New York City Police Department, the FBI, the French National Police, the Department of Defense, Interpol, the State Department, <em>Fortune<\/em> 500 companies, first responders, the military and the intelligence community. In her highly participatory presentation, she demonstrates the relevance of visual literacy across the professional spectrum and how the analysis of works of art affords participants in her program an innovative way to refresh their sense of critical inquiry and reconsider the skills necessary for improved performance and effective leadership. The program has been featured in the <em>New York Times<\/em>, <em>The Wall Street Journal<\/em>, &quot;The CBS Evening News&quot; and <em>Smithsonian<\/em> Magazine, among others.<\/p><p>Herman holds an AB, a JD and an MA in art history. Her book,&nbsp;<a href=\"http:\/\/geni.us\/PXbEiL7\" target=\"_blank\"><em>Visual Intelligence<\/em><\/a>, was published in May 2016 and was on both the <em>New York Times<\/em> and <em>Washington Post<\/em> bestseller lists.<\/p>","slug":"amy_herman","published_at":"2018-08-17 20:04:00","updated_at":"2018-12-05 22:22:17"}}