{"speaker":{"id":447,"title":"","firstname":"Michelle","middleinitial":"","lastname":"Obama","description":"First Lady of the United States","whotheyare":"First Lady Michelle Obama, a lawyer and administrator, is an advocate for working parents and education for girls all around the world.","whylisten":"<p>Michelle Obama&#39;s life as First Lady of the United States is informed by her early life, growing up as the daughter of a pump operator for the Chicago water department. Though money was tight, her parents emphasized education and possibility for their two brilliant children. Both kids went to Princeton (her older brother, <a href=\"http:\/\/en.wikipedia.org\/wiki\/Craig_Robinson_(basketball_coach)\" target=\"_blank\">Craig Robinson<\/a>, was a bond trader, then become a much-respected basketball coach at Brown and now Oregon State University); Michelle went on to Harvard Law School, and returned to Chicago to do corporate law at the firm where she met her future husband, <a href=\"http:\/\/www.barackobama.com\/index.php\" target=\"_blank\">Barack Obama<\/a>. She left corporate law to become a civil servant, working in planning, social outreach and administration with the city of Chicago, AmeriCorps and the University of Chicago Medical Center.<\/p><p>While Michelle Obama&#39;s personal focus is on raising her own two children, Malia and Sasha, in the glare of White House life, her outward focus, as First Lady, revolves around issues of education and work-life balance; she&#39;s a passionate supporter of working mothers and for global education of women and girls. She&#39;s helping to lead the drive for <a href=\"http:\/\/www.nationalservice.gov\/\" target=\"_blank\">national service<\/a>, encouraging Americans to volunteer in their own communities. Follow her on Snapchat at <a href=\"https:\/\/www.snapchat.com\/add\/michelleobama\" target=\"_blank\">@michelleobama<\/a>.<\/p><p>Plus: Read <a href=\"https:\/\/www.theguardian.com\/education\/2009\/apr\/05\/michelle-obama-school-london\" target=\"_blank\">what it was like to be in the audience<\/a> for this surprise talk. <\/p>","slug":"michelle_obama","published_at":"2009-05-27 01:00:00","updated_at":"2016-08-11 17:06:44"}}