{"speaker":{"id":455,"title":"","firstname":"Jane","middleinitial":"","lastname":"Poynter","description":"Biospherian","whotheyare":"After weathering two years in Biosphere 2, Jane Poynter is trying to create technologies that allow us to live in hostile environments -- like outer space. ","whylisten":"<p>Jane Poynter is one of only eight people to live in Biosphere 2 for two years. In 1991, she and seven others were locked in a three-acre, hermetically-sealed environment in the Arizona desert. Nothing was allowed in or out, and everything had to be recycled. Poynter, and the rest of the team, endured dangerously low oxygen levels and constant hunger, but they survived -- something many scientists said was impossible.&nbsp; <br \/><br \/>After leaving Biosphere 2, Poynter went on to found Paragon Space Development Corporation, along with her former fellow biospherian and now husband, Taber MacCallum. Paragon develops technologies that might allow humans to live in extreme environments such as outer space and underwater. As president of Paragon, Poynter has had experiments flown on the International Space Station, Russian Mir Space Station and US Space Shuttle, as well as working on underwater technologies with the US Navy.&nbsp; <br \/><br \/>However, Poynter has not given up on her homeland -- Biosphere 1. She continues to consult on and write about sustainable development and new green technologies. In concert with the World Bank, she has worked on projects to mitigate climate change and to grow crops in typically arid and hostile regions of Africa and Central America. Through talks and appearances, she builds awareness of the fragile state of the environment. After all, she knows what it&#39;s like to watch your biosphere begin to break down.<\/p><p>The <em>New York Times<\/em> <a href=\"http:\/\/www.nytimes.com\/2013\/06\/10\/booming\/biosphere-2-good-science-or-bad-sense.html?nl=todaysheadlines&amp;emc=edit_th_20130611&amp;_r=0\" target=\"_blank\">looks back on the Biosphere 2 story &gt;&gt;<\/a>  <\/p>","slug":"jane_poynter","published_at":"2009-06-15 01:00:00","updated_at":"2013-06-11 11:11:04"}}