{"speaker":{"id":4737,"title":"","firstname":"Ben","middleinitial":"","lastname":"Cort","description":"Author, addiction treatment specialist","whotheyare":"Ben Cort focuses on marijuana education and consulting in the substance use disorder treatment field.","whylisten":"<p>Ben Cort&#39;s passion for recovery, prevention and harm reduction comes from his own struggle with substance abuse. Sober since June 15, 1996, Cort has been a part of the recovery community in almost every way imaginable -- from a recipient to a provider to a spokesperson. Cort has a deep understanding of the issues and a personal motivation to see the harmful effects of drug and alcohol abuse minimized.<\/p><p>In 2007 Cort left his position as HR director of a Denver based S&amp;P 500 firm to help start the Colorado-based nonprofit&nbsp;<a href=\"https:\/\/thephoenix.org\/\" target=\"_blank\">Phoenix Multisport<\/a>&nbsp;(PM). As an original board member and then their first full-time employee, Cort was instrumental in building the organization, which has received frequent national recognition for their innovative approach to building sober communities around sport and healthy activities.&nbsp;<\/p><p>Following the passage of Coloradro Amendment 64, which outlined a new statewide drug policy for cannabis, Cort was appointed to the Board of Directors of&nbsp;<a href=\"https:\/\/learnaboutsam.org\/\" target=\"_blank\">Project SAM<\/a>&nbsp;(Smart Approaches to Marijuana) as well as&nbsp;<a href=\"http:\/\/www.nalgap.org\/\" target=\"_blank\">NALGAP<\/a>&nbsp;(the National Association of Lesbian, Gay, and Transgender Treatment Providers and their Allies). Cort&#39;s passion about the intersection of recovery and public policy makes him frequent guest in the media.<\/p><p>Cort&#39;s first book,&nbsp;<a href=\"http:\/\/geni.us\/Uz1nHN\" target=\"_blank\"><em>Weed, Inc.: The Truth About the Pot Lobby, THC, and the Commercial Marijuana Industry<\/em><\/a>, was released in September 2017. He resigned from his position with the University of Colorado Hospital in their chemical dependency treatment service line in January 2017 to focus on marijuana education and consulting in the substance use disorder treatment field.<\/p>","slug":"ben_cort","published_at":"2018-08-20 21:55:00","updated_at":"2018-09-05 14:50:42"}}