{"speaker":{"id":474,"title":"","firstname":"Taryn","middleinitial":"","lastname":"Simon","description":"Artist","whotheyare":"With a large-format camera and a knack for talking her way into forbidden zones, Taryn Simon photographs portions of the American infrastructure inaccessible to its inhabitants.","whylisten":"<p>Taryn Simon is a multidisciplinary artist working in photography, text, sculpture and performance. Guided by an interest in systems of categorization and classification, her practice involves extensive research into the power and structure of secrecy and the precarious nature of survival. Her works have been the subject of exhibitions at the Louisiana Museum of Modern Art, Copenhagen (2016-17); The Albertinum, Dresden (2016); Galerie Rudolfinum, Prague (2016); Garage Museum of Contemporary Art, Moscow (2016); Jeu de Paume, Paris (2015); Ullens Center for Contemporary Art, Beijing (2013); Museum of Modern Art, New York (2012); Tate Modern, London (2011); Neue Nationalgalerie, Berlin (2011); and Whitney Museum of American Art, New York (2007).&nbsp;<\/p><p>In<em>&nbsp;<\/em><a href=\"http:\/\/geni.us\/americanindex\" target=\"_blank\"><em>An American Index of the Hidden and Unfamiliar<\/em><\/a>, Simon compiles an inventory of what lies hidden and out-of-view within the borders of the United States. She examines a culture through documentation of subjects from domains including: science, government, medicine, entertainment, nature, security and religion. Confronting the divide between those with and without the privilege of access, her collection reflects and reveals that which is integral to America&rsquo;s foundation, mythology and daily functioning.&nbsp;<\/p><p><a style=\"font-style: italic\" href=\"http:\/\/geni.us\/alivingman\" target=\"_blank\">A Living Man Declared Dead and Other Chapters&nbsp;I-XVIII<\/a><em>&nbsp;<\/em>was produced over a four-year period (2008&ndash;11) during which Simon traveled around the world researching and recording bloodlines and their related stories. In each of the eighteen &quot;chapters&quot; comprising the work, the external forces of territory, power, circumstance or religion collide with the internal forces of psychological and physical inheritance. The subjects documented by Simon include victims of genocide in Bosnia, test rabbits infected with a lethal disease in Australia, the first woman to hijack an aircraft, and the living dead in India. Her collection is at once cohesive and arbitrary, mapping the relationships among chance, blood and other components of fate.<\/p><p>Permanent collections include Metropolitan Museum of Art, New York; Tate Modern, London; the Guggenheim Museum, New York; Centre Georges Pompidou, Paris; and the Los Angeles County Museum of Art, Los Angeles. Her work was included in the 56th Venice Biennale (2015). Simon&#39;s installation, <em>An Occupation of Loss<\/em> (2016), co-commissioned by the Park Avenue Armory and Artangel, premiered in New York in 2016. The performance will be held again in London in 2018. Simon is a graduate of Brown University and a Guggenheim Fellow. She lives and works in New York.<\/p>","slug":"taryn_simon","published_at":"2009-09-23 10:51:00","updated_at":"2017-11-29 17:23:07"}}