{"speaker":{"id":4741,"title":"","firstname":"Chip","middleinitial":"","lastname":"Colwell","description":"Archaeologist, museum curator","whotheyare":"Chip Colwell is an archaeologist who tries to answer the tangled question: Who owns the past?","whylisten":"<p>Chip Colwell is an archaeologist and museum curator who has published 11 books that invite us to rethink how Native American history is told. His essays have appeared in The Atlantic, The Guardian and TIME, while his research has been highlighted in the <em>New York Times<\/em>, BBC, <em>Forbes<\/em>&nbsp;and elsewhere. Most recently, he wrote&nbsp;<a href=\"http:\/\/geni.us\/iWlc\" target=\"_blank\"><em>Plundered Skulls and Stolen Spirits: Inside the Fight to Reclaim Native America&rsquo;s Culture<\/em><\/a>, which <em>The Wall Street Journal<\/em> dubbed &quot;a careful and intelligent chronicle&quot; and won a 2018 Colorado Book Award.<\/p><p>In 1990, Colwell&nbsp;fell in love with archaeology. Still in high school, he decided to make a life for himself discovering ancient windswept ruins across the American Southwest. But in college he discovered that archaeologists have not always treated Native Americans with respect. In museums were thousands of Native American skeletons, grave goods and sacred objects -- taken with the consent of Native communities. Disheartened, he planned to leave the field he revered. But an epiphany struck that instead he should help develop a new movement in archaeology and museums based on the dignity and rights of Native Americans.<\/p><p>When Colwell&nbsp;was hired as a curator at the Denver Museum of Nature &amp; Science, he had the chance to address the dark legacies of museum collecting. He and his colleagues began consulting with hundreds of tribes about the return of skeletons and sacred objects. In this work, Colwell&nbsp;realized, too, there was an important story to share that explored vital questions. Why do museums collect so many things? Why is it offensive to some that museums exhibit human remains and religious items? What are the legal rights of museums -- and the moral claims of tribes? What do we lose when artifacts go home? And what do we gain?<\/p>","slug":"chip_colwell","published_at":"2018-08-22 17:51:00","updated_at":"2018-09-20 19:09:42"}}