{"speaker":{"id":4784,"title":"","firstname":"Chad","middleinitial":"","lastname":"Frischmann","description":"Systems strategist, coalition-builder","whotheyare":"Chad Frischmann is working to get humanity to \"drawdown,\" the point in time when the concentration of atmospheric greenhouse gases begins to decline on a year-to-year basis.","whylisten":"<p>Chad Frischmann developed the methodology and models underpinning the <em>New York Times<\/em> best-seller&nbsp;<a href=\"http:\/\/geni.us\/M6bA5\" target=\"_blank\"><em>Drawdown: The Most Comprehensive Plan Ever Proposed to Reverse Global Warming<\/em><\/a>&nbsp;(Penguin, 2017). <em>Drawdown<\/em> was the number one best-selling environmental book of 2017 and is currently being translated into more than ten languages. In collaboration with a global team of researchers, Frischmann&nbsp;designed integrated global models to assess the world&#39;s most effective climate solutions and determine if, when and how the world can reach &quot;drawdown,&quot; the point in time when the concentration of atmospheric greenhouse gases begins to decline on a year-to-year basis.<\/p><p>With an interdisciplinary background in public policy, human rights, sustainable development, and environmental conservation, Frischmann works as a systems strategist to build a new, regenerative future with cascading benefits to the environment and to human well-being. As head of research and technology since Project Drawdown&#39;s inception, he is a key spokesperson and coalition-builder dedicated to sharing the message and model of Drawdown with the world.<\/p><p>Frischmann&nbsp;provides a systems-based, action-orientated approach to research and strategic leadership. Previously, as the Senior Program Officer at The Europaeum, an association of leading European universities, Frischmann&nbsp;worked to further international collaboration through academic mobility and exchange between students, researchers and those working in the public and private sectors. He taught at the University of Oxford and the University of California at Berkeley and worked as a consultant and researcher for numerous organizations, from small grassroots non-profits to international agencies such as UNESCO and the International Fund for Agricultural Development.<\/p>","slug":"chad_frischmann","published_at":"2018-09-13 20:37:00","updated_at":"2018-11-28 15:36:41"}}