{"speaker":{"id":4792,"title":"","firstname":"Kelly","middleinitial":"","lastname":"Richmond Pope","description":"Fraud researcher, documentary filmmaker","whotheyare":"Kelly Richmond Pope researches organizational misconduct, ethics and fraud.","whylisten":"<p>Kelly Richmond Pope is an Associate Professor in the School of Accountancy and MIS at DePaul University where her research focuses on how organizations design cultures and compliance systems to confront the challenges of organizational misconduct, ethics and fraud. She also teaches in executive education programs at the Kellogg School of Management at Northwestern University and the Quilan School of Business at Loyola University.<\/p><p>Pope&#39;s research on organizational misconduct culminated into directing and producing the award-winning documentary,&nbsp;<a href=\"https:\/\/www.allthequeenshorsesfilm.com\/\" target=\"_blank\"><em>All the Queen&#39;s Horses<\/em><\/a>&nbsp;in 2017. Renowned <em>Chicago Sun-Times<\/em> film critic Richard Roeper cites &quot;kudos to director Kelly Richmond Pope for applying just the right mix of &#39;What the heck?&#39; whimsy and respectful, serious reporting to this incredible tale.&quot; <em>All the Queen&#39;s Horses<\/em> explores the largest municipal fraud in United States history and premiered as the #1 documentary on iTunes, Amazon Prime Video, Google Play and Direct TV during its debut week on the video on demand platforms in April 2018.<\/p><p>At the organizational level, Pope examines factors that encourage employees to whistle-blow as well as the ethical decision-making process. This research has been published in leading accounting and business ethics journals and resulted in being selected to develop a TED-Ed lesson entitled &quot;How people&nbsp;rationalize fraud.&quot;<\/p><p>Pope is a popular keynote speaker and frequently advises firms about their compliance programs and training. She is regularly invited to speak to regulators, including the Department of Justice, Securities and Exchange Commission, PCAOB, Internal Revenue Service-Criminal Investigations and the Federal Bureau of Investigation.<\/p><p>Prior to joining the faculty at DePaul University, Pope worked in the forensic accounting practice at KPMG. She received her doctorate in accounting from Virginia Tech and is a licensed certified public accountant.<\/p>","slug":"kelly_richmond_pope","published_at":"2018-09-17 14:20:00","updated_at":"2019-02-06 16:10:24"}}