{"speaker":{"id":4795,"title":"","firstname":"Kate","middleinitial":"","lastname":"Darling","description":"Robot ethicist","whotheyare":"Kate Darling investigates the relationship between humans and robots -- now, and in the future. ","whylisten":"<p>Robots are taking increasingly bigger roles in life and business -- moving well beyond manufacturing and into transportation, education, medicine, care for the elderly, our offices and our homes. But ethics and law haven&#39;t caught up. Kate Darling, a pioneer in these fields, is helping quicken the pace.<\/p><p>A leading expert in robot ethics, Darling is a researcher at the Massachusetts Institute of Technology (MIT) Media Lab where she investigates social robotics and conducts experimental studies on human-robot interaction. Darling explores the emotional connection between people and life-like inventions, seeking to influence technology design and policy direction. Her writing and research anticipate difficult questions that lawmakers, engineers and the wider public must address as human-robot relationships evolve in the coming decades.&nbsp;She currently serves as intellectual property policy advisor to the director of the MIT Media Lab.<\/p><p>While her background is in intellectual property and law and economics, Darling&#39;s passion for technology and robots led her to interdisciplinary fields. She&#39;s a former Fellow and current Affiliate at the Harvard Berkman Klein Center for Internet &amp; Society and a former fellow at the Yale Information Society Project, and she&#39;s an affiliate at the Institute for Ethics and Emerging Technologies.&nbsp;Her work has been featured in <em>Vogue<\/em>, <em>The<\/em> <em>New Yorker<\/em>, The Guardian, BBC, NPR, PBS, <em>The Boston Globe<\/em>, Forbes, CBC, WIRED, <em>Boston<\/em> Magazine, The Atlantic, Slate, Die Zeit, <em>The Japan Times<\/em> and more. She is a contributing writer to Robohub and IEEE Spectrum and speaks and holds workshops covering some of the more interesting developments in the world of robotics, and where we might find ourselves in the future.<\/p><p>Darling graduated from law school with honors and holds a doctorate of sciences from the Swiss Federal Institute of Technology (ETH Zurich) and an honorary doctorate of sciences from Middlebury College. In 2017, the American Bar Association honored her legal work with the Mark T. Banner award in Intellectual Property. She is the caretaker for several domestic robots, including her Pleos Yochai, Peter, and Mr. Spaghetti. She tweets as&nbsp;<a href=\"https:\/\/twitter.com\/grok_\" target=\"_blank\">@grok_<\/a>&nbsp;about eating cheerios for dinner.<\/p>","slug":"kate_darling","published_at":"2018-09-17 17:40:00","updated_at":"2019-11-06 22:57:41"}}