{"speaker":{"id":4824,"title":"","firstname":"Lisa","middleinitial":"","lastname":"Godwin","description":"","whotheyare":"Lisa Godwin is an educator with the Onslow County School District of North Carolina. ","whylisten":"<p>As the 2017 Burroughs Wellcome Fund North Carolina Teacher of the Year and 2018 North Carolina NEA Educator of Excellence, Lisa Godwin embraces opportunities to be a voice for teachers and advocate for children. Throughout her career, Godwin has viewed public education through many different lenses, giving her the perspective and ability to be an informed and conscientious voice for the educational community. Beginning her career in 1997 as an instructional assistant and bus driver, she found a passion for teaching and went back to college at St. Andrews University to obtain her Bachelor of Arts degree. After a decade in the classroom Godwin&nbsp;felt a desire to advance her career, so she went on to obtain her Master of School Administration from The University of North Carolina Chapel Hill.&nbsp; After serving in an administrative role for four years, her love of teaching drew her back into the classroom, where she continues to nurture and grow the future leaders of tomorrow.<\/p><p>In 2018, The University of North Carolina School of Education honored her as their &quot;Alumni of the Year.&quot; This honor is bestowed upon a graduate who has shown outstanding leadership and\/or exceptional commitment to the education of children and personifies the mission of the School of Education by emphasizing the interconnectedness of homes, schools and communities through both professional and volunteer work. These words truly reflect Godwin&#39;s heart for service and her desire to make teaching not just a job, but also her life&#39;s purpose.&nbsp;<\/p><p>Godwin&nbsp;served as the teacher advisor to the North Carolina State Board of Education from 2017 to 2019 and currently sits on the North Carolina Governor&#39;s Teacher Advisory Council, as well as serving on the board of the North Carolina Center for the Advancement of Teaching (NCCAT). Godwin&nbsp;is the mentor and beginning teacher coordinator for Dixon Elementary School and helps lead the Onslow County School&rsquo;s Future Teachers of America Club.<\/p>","slug":"lisa_godwin","published_at":"2018-09-26 17:26:00","updated_at":"2020-02-11 19:21:51"}}