{"speaker":{"id":4830,"title":"","firstname":"Ariana","middleinitial":"","lastname":"Curtis","description":"Afro-Latina researcher and curator","whotheyare":"Ariana A. Curtis gets to research, collect, interpret and display objects and stories that help tell the history of all of us and our connections to each other.","whylisten":"<p>An African American educator and a Black Panamanian engineering research technician raised Dr. Ariana Curtis, the youngest of their four kids, in an Afro-Latinx affirming household. Government forms and ill-informed publics have wanted her to be either African American or Latina, but Curtis has always advocated for full and accurate representation of self above all.<\/p><p>The yearning to see lives represented whole led Curtis to travel and study the complex overlap of Blackness, identity, gender, diaspora and belonging. After earning a doctorate in anthropology, Curtis, a Fulbright scholar, joined the curatorial staff of the Smithsonian Institution. She currently serves as the first curator for Latinx Studies at the National Museum of African American History and Culture. In this role, she researches, collects, exhibits and promotes Latinx- and Black-centered narratives to more accurately represent the history and culture of the Americas. She&nbsp;also serves on multiple committees for the Smithsonian&#39;s American Women History Initiative. She&#39;s the author of the paper &quot;<a href=\"http:\/\/tph.ucpress.edu\/content\/40\/3\/278\" target=\"_blank\">Afro-Latinidad in the Smithsonian&rsquo;s African American Museum Spaces<\/a>&quot; and&nbsp;the chapter &quot;Identity as Profession: on Becoming an African American Panamanian Afro-Latina Anthropologist Curator&quot; in&nbsp;<em><a href=\"https:\/\/www.amazon.com\/Pan-African-Spaces-Essays-Transnationalism\/dp\/1498581927\" target=\"_blank\">Pan African Spaces: Essays on Black Transnationalism<\/a>.&nbsp;<\/em>She&#39;s is passionate about Afro-Latinidad, her Omega Phi Beta sisterhood, social justice, radical love, the Duke Blue Devils and hoop earrings.<\/p>","slug":"ariana_curtis","published_at":"2018-09-28 18:16:00","updated_at":"2018-12-21 15:30:15"}}