{"speaker":{"id":4833,"title":"","firstname":"Darieth","middleinitial":"","lastname":"Chisolm","description":"Journalist, activist","whotheyare":"Darieth Chisolm is an Emmy-winning television personality, former NBC News Anchor, entrepreneur, author, international speaker and life and business coach.","whylisten":"<p>Darieth Chisolm works with corporate professionals, coaches, authors, speakers and visionaries to develop visibility and multimedia strategies that build brand, influence and income. She leverages her life coaching skills to help victims and survivors of assault and abuse release the shame, live with confidence and find their everyday courage.&nbsp;<\/p><p>Chisolm is also a revenge porn victim turned activist, filmmaker and founder of&nbsp;<a href=\"https:\/\/www.50shadesofsilence.com\/\" target=\"_blank\">50 Shades of Silence<\/a>, a global movement giving voice and dignity to victims of cyber harassment and abuse. The project aims to advocate for stricter laws and tougher enforcement for cyber sexual crimes; encourage the accountability and responsiveness among online companies; promote social responsibility for texting, posting and sharing online; and restore dignity and respect to victims and survivors. It includes an upcoming feature-length documentary, a website with resources and services, and motivational and empowerment training materials to help victims.<\/p><p>Chisolm is currently the host of CBS&#39;s&nbsp;<a href=\"https:\/\/pittsburgh.cbslocal.com\/video\/3937659-cbs-eye-on-health-sept-17-2018-part-1\/\" target=\"_blank\"><em>Eye on Health<\/em><\/a>&nbsp;and PBS&#39;s Emmy-winning&nbsp;<a href=\"https:\/\/wqed.org\/smartparent\" target=\"_blank\"><em>iQ: smartparent<\/em><\/a>. Her YouTube channel and online video podcast series,&nbsp;<a href=\"http:\/\/www.dariethchisolm.com\/hustlepodcast\/\" target=\"_blank\"><em>Hustle &amp; Heart TV<\/em><\/a>, was a top 10 finalist for the 2015 Podcast Awards for Best Video Podcast and was ranked number one on iTunes for more than two months with subscribers and viewers in multiple countries.<\/p><p>Chisolm is also the author of&nbsp;<a href=\"http:\/\/geni.us\/hWlX0z\" target=\"_blank\"><em>Hustle! Why Now is the Time to Unleash your Passions<\/em><\/a>, a collection of powerful and motivating stories to help readers unlock and unleash their passions and learn how to hustle in business while loving life in the process. She is also a contributing writer for <em>Inspiring Lives<\/em> and <em>Woman of More<\/em> magazines.<\/p><p>Chisolm received the 2018 Woman of Influence Award from the Pittsburgh Business Times and has been named Top 10 Trailblazers in Communications by Walker&rsquo;s Legacy and nominated as Entrepreneur of the Year with Style Week in Pittsburgh. She has received two proclamations from the City of Pittsburgh, two proclamations from Allegheny County and a special recognition from the Senate of Pennsylvania for making an outstanding difference and profound impact in Pittsburgh.<\/p>","slug":"darieth_chisolm_1","published_at":"2018-10-02 12:22:00","updated_at":"2018-10-24 19:59:37"}}