{"speaker":{"id":4835,"title":"","firstname":"Carla","middleinitial":"","lastname":"Harris","description":"Business executive, author","whotheyare":"At Morgan Stanley, Carla Harris is responsible for improving the access to capital for female and multicultural founders, as well as increasing client connectivity to enhance revenue generation.","whylisten":"<p>In her 30-year career, Carla Harris has had extensive industry experiences in the technology, media, retail, telecommunications, transportation, industrial and healthcare sectors. In August 2013, she was appointed by President Barack Obama to chair the National Women&#39;s Business Council. Harris was named to <em>Fortune <\/em>Magazine&#39;s list of &quot;The 50 Most Powerful Black Executives in Corporate America,&quot; <em>US Banker&#39;<\/em>s &quot;Top 25 Most Powerful Women in Finance&quot; (2009, 2010, 2011), <em>Black Enterprise<\/em>&#39;s &quot;Top 75 Most Powerful Women in Business&quot; (2017) and &quot;Top 75 African Americans on Wall Street,&quot;&nbsp;<em>Essence <\/em>Magazine&#39;s list of &quot;The 50 Women Who Are Shaping the World&quot; and <em>Ebony<\/em>&#39;s&nbsp;list of the &quot;Power 100&quot; and &quot;15 Corporate Women at the Top.&quot; She is the past chair of the board of the Morgan Stanley Foundation and of The Executive Leadership Council, and she is a member of the board of overseers of Harvard University and the board of directors of the Walmart Corporation. She&#39;s the author of the books&nbsp;<a href=\"http:\/\/geni.us\/13VTCYe\" target=\"_blank\"><em>Strategize to Win<\/em><\/a> and&nbsp;<a href=\"http:\/\/geni.us\/TTYAiAv\" target=\"_blank\"><em>Expect to Win<\/em><\/a><em>.<\/em><\/p><p>In her other life, Harris is a singer and has released three gospel CDs, including <em>Unceasing Praise<\/em>, <em>Joy Is Waiting<\/em>, and<em> Carla&#39;s First Christmas<\/em>, which was featured on the<em> CBS Evening News with Dan Rather<\/em>. She has performed five sold-out concerts at Carnegie Hall.<\/p>","slug":"carla_harris","published_at":"2018-10-02 13:50:00","updated_at":"2018-12-13 15:21:46"}}