{"speaker":{"id":4838,"title":"","firstname":"Danielle R.","middleinitial":"","lastname":"Moss","description":"Social activist","whotheyare":"Danielle R. Moss is chief executive officer of Oliver Scholars, helping it prepare high-potential Black and Latinx students from underserved New York City communities for success.","whylisten":"<p>Dr. Danielle R. Moss is Chief Executive Officer of Oliver Scholars, an organization committed to preparing high-potential Black and Latinx students from underserved New York City communities for success at top independent schools, prestigious colleges and careers. She is also a member of The New York Women&#39;s Foundation board of directors and serves as an NYC Commissioner of Gender Equity. She began her career as a middle school teacher in the Bronx and Brooklyn, building a distinguished career as an academic and a leader in the education and the social sector. Dr. Moss&#39;s contributions to education and the social sector have been recognized by the New York State Education Department, The New York Women&#39;s Foundation, The New York Coalition for 100 Black Women, The College Board, The Network Journal&#39;s 25 Most Influential Black Women in Business and The Council of Urban Professionals.<\/p><p>Moss has been featured in the <em>New York Times<\/em> &quot;Corner Office&quot; and in <em>Crain&#39;s New York<\/em> for her leadership in the movement toward intersectional gender equity. Her writing has been featured by The Daily Beast, The Huffington Post, Edutopia, The Amsterdam News, City Limits Magazine, Ms. Magazine online and the Feminist Wire. She&#39;s appeared on WABC-TV&#39;s <em>Here and Now <\/em>and<em> New York Viewpoint<\/em>, on WNBC&#39;s&nbsp;<em>Positively Black<\/em>, Fox 5&#39;s&nbsp;<em>Street Talk<\/em>, Bronx Net&#39;s&nbsp;<em>Perspectives<\/em>&nbsp;and NY1&#39;s&nbsp;<em>Inside City Hall<\/em>.&nbsp;Stanley Crouch, formerly of the <em>New York Daily News<\/em>, once dubbed her one of the most important players in public education for her ability to respectfully meet young people and families where they are and to give them the tools and agency to transform their own lives.​<\/p>","slug":"danielle_renee_moss","published_at":"2018-10-02 23:48:00","updated_at":"2019-02-06 15:54:41"}}