{"speaker":{"id":4852,"title":"","firstname":"Katharine","middleinitial":"","lastname":"Wilkinson","description":"Writer, environmentalist","whotheyare":"Katharine Wilkinson is transforming how we see and relate to the earth. As a writer and messenger, she brings humanity and heart to the challenge of climate change and invites us to be awake, aware and active participants in the community of life.","whylisten":"<p>As Katharine Wilkinson writes: &quot;At age 16, through an ineffable alchemy of living and learning in the woods, I fell in love with this world and dedicated myself to being part of earth&#39;s healing. That commitment threads through my journey since, from research and teaching to strategy and advocacy at the intersections of environment, social science, religion, narrative and discourse, movement building, and gender equity.&nbsp;&nbsp;<\/p><p>&quot;Along the way, I have written two books. The first,&nbsp;<a href=\"http:\/\/geni.us\/EXpVH9Z\" target=\"_blank\"><em>Between God &amp; Green: How Evangelicals Are Cultivating a Middle Ground on Climate Change<\/em><\/a>, grew out of my doctoral research at the University of Oxford, where I was a Rhodes Scholar.&nbsp;The second was a <em>New York Times<\/em> bestseller:&nbsp;<a href=\"http:\/\/geni.us\/9IJJbG\" target=\"_blank\"><em>Drawdown: The Most Comprehensive Plan Ever Proposed to Reverse Global Warming<\/em><\/a>. That book brings to life the pioneering, collaborative work of&nbsp;<a href=\"https:\/\/www.drawdown.org\/\" target=\"_blank\">Project Drawdown<\/a>, the nonprofit where I now lead communication and engagement.<\/p><p>&quot;Climate change is humanity&rsquo;s great challenge. It demands ambitious, swift, exponential action, across society. But many solutions are already in hand, and our collective wisdom is deep and wide. My work aims to help others envision what&rsquo;s possible for this earth, our home, and persevere in making it real.&nbsp;<\/p><p>&quot;Today, I live not in the woods but in Atlanta. I continue to find sustenance in rivers and mountains, dogs and horses, and a community of wise, wild, kindred spirits.&quot;<\/p>","slug":"katharine_wilkinson","published_at":"2018-10-04 22:56:00","updated_at":"2019-01-16 15:49:11"}}