{"speaker":{"id":4855,"title":"","firstname":"Lucy","middleinitial":"","lastname":"Cooke","description":"Zoologist, author, explorer","whotheyare":"In books, TV shows and even an annual sloth calendar, Lucy Cooke shares unexpected truths about animals.","whylisten":"<p>Lucy Cooke is a New York Times best-selling author, award-winning documentary producer, presenter and National Geographic explorer with a master&#39;s in zoology from Oxford University. She is a passionate conservationist and champion of animal species that are often misunderstood. Her style is immersive, journalistic and unashamedly populist, mixing expert storytelling with a dash of humor to reach the widest possible audience. She began her presenting career hosting <em>Freaks and Creeps<\/em> for National Geographic, a show about strange species that get overlooked in favor of charismatic megafauna, and has hosted numerous shows for the BBC.<\/p><p>Cooke has a particular soft spot for sloths and founded the Sloth Appreciation Society to promote a greater understanding of their lazy lifestyle. She has produced a number of iconic viral sloth videos, <em>Meet the Sloths<\/em>, an award-winning international series for Animal Planet, two best-selling books --&nbsp;<em><a href=\"https:\/\/www.amazon.com\/Little-Book-Sloth-Lucy-Cooke\/dp\/1442445572?tag=teco06-20\" target=\"_blank\">A Little Book of Sloth<\/a>&nbsp;<\/em>and<em>&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/0761193227\/ref=dbs_a_def_rwt_bibl_vppi_i0?tag=teco06-20\" target=\"_blank\">Life in the Sloth Lane<\/a><\/em> -- and&nbsp;<a href=\"https:\/\/www.amazon.com\/dp\/1523505788\/ref=cm_sw_r_tw_dp_U_x_tj.4CbVPEH5VB\" target=\"_blank\">an annual calendar<\/a>&nbsp;featuring her sloth photographs.&nbsp;<\/p><p>Cooke&#39;s latest book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Truth-About-Animals-Lovelorn-Wildlife\/dp\/1541674081\/\" target=\"_blank\"><em>The Truth About Animals<\/em><\/a><em>,<\/em>&nbsp;was shortlisted for the prestigious Royal Society prize and the AAAS young adult science prize.&nbsp;<em>Nature<\/em>&nbsp;calls it a &quot;deeply researched, sassily written history of the biggest misconceptions, mistakes and myths we&#39;ve concocted about the animal kingdom, spread by figures from Aristotle to Walt Disney.&quot;<\/p>","slug":"lucy_cooke","published_at":"2018-10-05 12:09:00","updated_at":"2019-06-04 16:19:44"}}