{"speaker":{"id":4857,"title":"","firstname":"Marian","middleinitial":"","lastname":"Wright Edelman","description":"Child advocate","whotheyare":"Marian Wright Edelman fights for a level playing field for all children, so their chances to succeed don't have to depend on the lottery of birth.","whylisten":"<p>Marian Wright Edelman, founder and president emerita of the Children&#39;s Defense Fund (CDF), has been an advocate for disadvantaged Americans for her entire professional life. Under her leadership, CDF has become the nation&#39;s strongest voice for children and families. The CDF&#39;s &quot;Leave No Child Behind&quot; mission is &quot;to ensure every child a Healthy Start, a Head Start, a Fair Start, a Safe Start, and a Moral Start in life and successful passage to adulthood with the help of caring families and communities.&quot;<\/p><p>Edelman, a graduate of Spelman College and Yale Law School, began her career in the mid-&#39;60s when, as the first black woman admitted to the Mississippi Bar, she directed the NAACP Legal Defense and Educational Fund office in Jackson, Mississippi. In 1968, she moved to Washington, DC as counsel for the Poor People&#39;s Campaign that Dr. Martin Luther King Jr. began organizing before his death. She founded the Washington Research Project, a public interest law firm and the parent body of the CDF. For two years she served as the director of the Center for Law and Education at Harvard University and in 1973 began CDF. Edelman served on the Board of Trustees of Spelman College, which she chaired from 1976 to 1987, and was the first woman elected by alumni as a member of the Yale University Corporation, on which she served from 1971 to 1977. She has received more than 100 honorary degrees and many awards, including the Albert Schweitzer Humanitarian Prize, the Heinz Award, a MacArthur Foundation Prize Fellowship, the Presidential Medal of Freedom -- the nation&#39;s highest civilian award -- and the Robert F. Kennedy Lifetime Achievement Award for her writings.<\/p>","slug":"marian_wright_edelman","published_at":"2018-10-05 12:16:00","updated_at":"2019-01-30 15:21:35"}}