{"speaker":{"id":4858,"title":"","firstname":"Monique W.","middleinitial":"","lastname":"Morris","description":"Author, social justice scholar","whotheyare":"As Monique W. Morris writes: \"I believe in a justice not associated with any form of oppression. I work for it and I write about it.\"","whylisten":"<p>Monique W. Morris, EdD, founded and leads the National Black Women&#39;s Justice Institute, an organization that works to transform public discourses on the criminalization of Black women, girls and their families. For three decades, she has been involved in social justice advocacy and scholarship, working with research and academic institutions, civil rights organizations, nonprofits, public agencies and activists to advance policies and practices that promote racial and gender equity. She&#39;s the author of&nbsp;<a href=\"http:\/\/geni.us\/ZCt1aNr\" target=\"_blank\"><em>Pushout: The Criminalization of Black Girls in Schools<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/geni.us\/maw6i\" target=\"_blank\"><em>Sing a Rhythm, Dance a Blues: Education for the Liberation of Black and Brown Girls<\/em><\/a><em>, <\/em>as well as<em>&nbsp;<\/em>other books, publications and articles.<\/p><p>As Morris&nbsp;writes: &quot;My work is ultimately about using research and narratives to challenge actions and structures of oppression. I do this using the tools I have available to me as a researcher, educator, public intellectual, visual artist, writer -- and most recently, filmmaker. I am the author of several academic publications and four books, each of them very different. From a street novel about prostitution to a statistical narrative about African Americans in the 21st century to a book about the criminalization of Black girls in schools, I try to meet people where they are on this journey toward freedom. My latest project, a dive into the pedagogical practices that make education freedom work, explores how schools might become locations of healing for Black and Brown girls. And I love Prince. Always have, always will.&quot;<\/p>","slug":"monique_w_morris","published_at":"2018-10-05 12:20:00","updated_at":"2019-07-09 18:26:38"}}