{"speaker":{"id":4863,"title":"","firstname":"Tarana","middleinitial":"","lastname":"Burke","description":"Civil rights activist","whotheyare":"For more than 25 years, activist and advocate Tarana J. Burke has worked at the intersection of racial justice and sexual violence.","whylisten":"<p>Tarana Burke&#39;s passion for community organizing began in the late 1980s, when she joined a youth development organization called 21st Century&nbsp;and led campaigns around issues like racial discrimination, housing inequality and economic justice. Her career took a turn toward supporting survivors of sexual violence upon moving to Selma, Alabama, to work for 21st Century. She encountered dozens of black girls who were sharing stories of sexual violence and abuse, stories she identified with very well. She realized too many girls were suffering through abuse without access to resources, safe spaces and support, so in 2007 she created Justbe Inc., an organization committed to the empowerment and wellness of black girls. The impacts of Justbe Inc. are widespread, as the program, which was adopted by every public school in Selma, has hundreds of alumni who have gone on to thrive and succeed in various ways.<\/p><p>Burke&#39;s role as the senior director at Girls for Gender Equity in Brooklyn, NY, an intergenerational nonprofit dedicated to strengthening local communities by creating opportunities for young women and girls to live self-determined lives, is a continuation of what she considers her life&#39;s work. Since #MeToo, the movement she created more than ten years ago, became a viral hashtag, she has emerged as a global leader in the evolving conversation around sexual violence and the need for survivor-centered solutions. Her theory of using empathy to empower survivors is changing the way the nation and the world think about and engage with survivors. Her belief that healing isn&#39;t a destination but a journey has touched and inspired millions of survivors who previously lived with the pain, shame and trauma of their assaults in isolation.<\/p>","slug":"tarana_burke","published_at":"2018-10-05 15:35:00","updated_at":"2018-11-30 16:11:07"}}