{"speaker":{"id":4868,"title":"","firstname":"Rachel","middleinitial":"","lastname":"Wurzman","description":"Neuroscientist","whotheyare":"Through her nonprofit SeekHealing, Rachel Wurzman aims to reduce opioid overdose rates by building communities that are inherently resilient to addiction.","whylisten":"<p>A neuroscientist and neuroethicist by training, Rachel Wurzman is passionate about two-way communication between the neuroscientific community and lay public that inspires transformative change in how human beings connect with each other, with technology and with institutions like medicine and government. She has authored more than&nbsp; 20 peer-reviewed articles and book chapters in the fields of neuroscience, neuroethics and policy, including Wiley&#39;s number one most frequently downloaded article out of over 20 neurology journals in 2016.<\/p><p>Wurzman serves as director of science for the nonprofit, SeekHealing, which implements creative ways to connect people intentionally and authentically in order to build communities that are inherently resilient to addiction. SeekHealing serves people at risk for overdose and provides free, connection-oriented support services to anyone at any stage in the addiction healing process.&nbsp;<\/p><p>Wurzman believes that an appreciation for how brain systems filter the various spectrums of human experience can be used to transform how society responds to current crises, ranging from the opioid epidemic to political hyperpolarization. In addition to studying the effects of SeekHealing&#39;s programs in opioid-ravaged lives and communities, Wurzman&#39;s ongoing research in neuroethics also addresses the implications of a biopsychosocial and &quot;systems-oriented&quot; perspective on neuropsychiatric spectrum phenomena (such as addiction) for research, treatment and social policy. Her advice and insights into neurocognition have been utilized to inform policy in past positions as a neuroscience and neuroethics advisor to the Pentagon, an intern in the White House Office of Science and Technology Policy under the Obama administration, and through her involvement with the International Neuroethics Society. Wurzman&nbsp;completed her doctoral and postdoctoral training at Georgetown University and the University of Pennsylvania, respectively.<\/p>","slug":"rachel_wurzman","published_at":"2018-10-09 18:03:00","updated_at":"2018-10-29 14:39:45"}}