{"speaker":{"id":487,"title":"","firstname":"Imogen","middleinitial":"","lastname":"Heap","description":"Musician","whotheyare":"Imogen Heap's aching voice and surprising electronics infuse countless videos and iPods with bone-chilling atmospherics.","whylisten":"<p>Classically trained composer, multi-instrumentalist and singer Imogen  Heap finds her muse in unlikely places.  She&#39;s mined sonic mystery from  sources ranging from cardboard tubes to cheap samplers to the data  gloves--not to mention her own vocal cords.<\/p><p>A relentless  experimenter, Heap&#39;s latest song cycle is built around some 900  fan-submitted &quot;sound seeds,&quot; or samples of everyday sounds. The first  six of these &quot;<a href=\"http:\/\/www.imogenheap.com\/heapsongs\/\" target=\"_blank\">Heapsongs<\/a>&quot; have been released via her website, and include  the lovely &quot;Propeller Seeds,&quot; inspired by a chance meeting at  a  past TEDGlobal. During 2012&#39;s TEDGlobal she recorded a song  in various locations around Edinburgh, &quot;anywhere that has a piano and they  let me turn up with a microphone.&quot; She has also composed the  orchestral score for the crowdsourced nature film &quot;<a href=\"http:\/\/lovetheearthfilm.org\/\" target=\"_blank\">Love the Earth<\/a>.&quot; <\/p><p>Heap&#39;s last album&nbsp;<a href=\"http:\/\/geni.us\/ellipse\" target=\"_blank\"><em>Ellipse<\/em><\/a>&nbsp;earned her a Grammy and Ivor Novello award. This summer marks the release of&nbsp;<em><a href=\"http:\/\/geni.us\/sparks\" target=\"_blank\">Sparks<\/a>,<\/em>&nbsp;her fifth and most ambitious album to date. Sparks&#39; songs have taken Imogen all over the world from her North East London home studio to the Himalayas via China. This year Imogen is the guest artist-curator for the iconic London Roundhouse venue&rsquo;s new music festival, Reverb. The eagerly awaited Sparks world tour will begin at Reverb in August 2014. Meanwhile, Imogen will be celebrating her tenth TED anniversary this year.<\/p>","slug":"imogen_heap","published_at":"2009-09-18 01:00:00","updated_at":"2015-10-04 18:12:27"}}