{"speaker":{"id":49,"title":"","firstname":"Joshua","middleinitial":"","lastname":"Prince-Ramus","description":"Architect","whotheyare":"Joshua Prince-Ramus is best known as architect of the Seattle Central Library, already being hailed as a masterpiece of contemporary culture. Prince-Ramus was the founding partner of OMA New York—the American affiliate of the Office for Metropolitan Architecture (OMA) in the Netherlands—and served as its Principal until he renamed the firm REX in 2006.","whylisten":"With one of the decade&#39;s most celebrated buildings under his belt, Joshua Prince-Ramus would seem well-positioned to become the world&#39;s next &quot;starchitect.&quot; Except that he doesn&#39;t want the job. <strong>With his quiet intensity and intellectual bearing, Prince-Ramus is the antithesis of the egomaniacal master architect.<\/strong> He flatly rejects not just the title, but the entire notion of a &quot;starchitect&quot; designing with a genius stroke of the pen.<br \/>&nbsp;<br \/>Prince-Ramus is best known for his work on the Seattle Central Library. The striking, diamond-windowed structure reimagines, to spectacular effect, the library&#39;s role in a modern urban context. &quot;Seattle&#39;s new Central Library is a blazing chandelier to swing your dreams upon,&quot; Herbert Muschamp wrote in <em>The New York Times<\/em>. &quot;In more than 30 years of writing about architecture, this is the most exciting new building it has been my honor to review.&quot;<br \/>&nbsp;<br \/>Having founded the US practice of the radical Dutch architecture firm OMA in 2000, Prince-Ramus served as its Principal until he renamed the firm REX in May 2006. He continues to take what he describes as a performance-based approach to architecture, pushing logic and rational ideas to their limits to create buildings that are unexpected, but wholly appropriate to their environment and intended use. REX recently completed the AT&amp;T Performing Arts Center&rsquo;s Dee and Charles Wyly Theatre in Dallas, Texas and the Vakko Fashion Center and Power Media Center in Istanbul, Turkey. Current work includes Museum Plaza, a 62-story mixed-use skyscraper housing a contemporary art center in Louisville, Kentucky;the new Central Library and Music Conservatory for the city of Kortrijk, Belgium;and a 2,643,000 ft2 luxury residential development in Songdo Landmark City, South Korea. ","slug":"joshua_prince_ramus","published_at":"2007-02-14 14:50:00","updated_at":"2010-02-04 19:36:36"}}