{"speaker":{"id":4918,"title":"","firstname":"Roy","middleinitial":"","lastname":"Bahat","description":"Venture capitalist","whotheyare":"Roy Bahat invests in the future of work, with a focus on automation, data, robotics, media, productivity tools and more.","whylisten":"<p>Roy Bahat invests in the future of work as a venture capitalist, with a focus on machine intelligence. Prior to his life as a VC, Bahat founded start-ups, served as a corporate executive at News Corp. and worked in government in the office of New York City mayor Michael Bloomberg.<\/p><p>As the head of Bloomberg Beta, an investment firm with 150 million dollars under management, Bahat and his team have invested in areas like automation, data, robotics, media, productivity tools and many others.<\/p><p><em>Fast Company<\/em> named Bahat one of the Most Creative People in Business and&nbsp;<a href=\"https:\/\/www.fastcompany.com\/90273934\/bloomberg-beta-just-dumped-detailed-investment-documents-onto-github-heres-why\" target=\"_blank\">noted<\/a>&nbsp;&quot;Bahat is a natural innovator ... one of the most candid people you&#39;ll ever meet (check out his&nbsp;<a href=\"https:\/\/www.linkedin.com\/in\/roybahat\/\" target=\"_blank\">LinkedIn profile<\/a>).&quot; He organized &quot;<a href=\"https:\/\/www.recode.net\/2018\/3\/30\/17177834\/midwest-heartland-bus-tour-comeback-cities-rust-belt-safari-vc-venture-capital-founders-washington\" target=\"_blank\">Comeback Cities<\/a>,&quot;&nbsp;where he leads groups of venture capitalists and members of Congress on bus tours to find the untapped beds of talent and entrepreneurship in America. He also co-chaired the&nbsp;<a href=\"https:\/\/shiftcommission.work\/\" target=\"_blank\">Shift Commission on Work, Workers, and Technology<\/a>, a partnership between Bloomberg and think-tank New America to look at automation and the future of work 10 to 20 years from now.<\/p><p>Bahat is on the faculty at U.C. Berkeley, where he teaches about media at the Haas School of Business. He serves on the board of the Center for Investigative Reporting, a nonprofit newsroom, and is on the steering committee of the Economic Security Project. A graduate of Harvard College, where he ran the student public service nonprofit, Bahat was also a Rhodes Scholar at Oxford University. He lives in San Francisco with his wife and two kids.<\/p>","slug":"roy_bahat","published_at":"2018-10-25 20:09:00","updated_at":"2019-02-19 15:56:42"}}