{"speaker":{"id":4921,"title":"","firstname":"Nita","middleinitial":"","lastname":"Farahany","description":"Legal scholar, ethicist","whotheyare":"Nita A. Farahany is a leading scholar on the ethical, legal, and social implications of biosciences and emerging technologies, particularly those related to neuroscience and behavioral genetics.","whylisten":"<p>Nita A. Farahany is a professor of law and philosophy, the founding director of the&nbsp;<a href=\"http:\/\/scienceandsociety.duke.edu\/\" target=\"_blank\">Duke Initiative for Science &amp; Society<\/a>&nbsp;and chair of the&nbsp;<a href=\"http:\/\/scienceandsociety.duke.edu\/learn\/ma\" target=\"_blank\">MA in Bioethics &amp; Science Policy<\/a>&nbsp;at Duke University. In 2010, Farahany was appointed by President Obama to the&nbsp;<a href=\"https:\/\/law.duke.edu\/fac\/farahany\/bioethics.gov\" target=\"_blank\">Presidential Commission for the Study of Bioethical Issues<\/a>, and she served as a member until 2017. She is a member of the Neuroethics Division of the Multi-Council Working Group for the BRAIN Initiative, on the President&#39;s Research Council of the Canadian Institute for Advanced Research (CIFAR), and past member of the Global Agenda Council for Privacy, Technology and Governance at the World Economic Forum.&nbsp;<\/p><p>Farahany presents her work to diverse audiences and is a frequent commentator for national media and radio shows. She is an elected member of the American Law Institute, the President-Elect of the International Neuroethics Society, serves on the Board of the International Neuroethics Society, a co-editor a co-editor-in-chief and co-founder of the <em>Journal of Law and the Biosciences&nbsp;<\/em>and an editorial board member of the American Journal of Bioethics (Neuroscience). She&#39;s on the Ethics Advisory Board for Illumina, Inc., the Scientific Advisory Board of Helix, and the Board of Advisors of Scientific American.&nbsp;<\/p><p>Farahany received her AB in genetics, cell and developmental biology at Dartmouth College, a JD and MA from Duke University, as well as a PhD in philosophy. She also holds an ALM in biology from Harvard University. In 2004-2005, Farahany clerked for Judge Judith W. Rogers of the US Court of Appeals for the D.C. Circuit, after which she joined the faculty at Vanderbilt University. In 2011, Farahany was the Leah Kaplan Visiting Professor of Human Rights at Stanford Law School.<\/p>","slug":"nita_farahany","published_at":"2018-10-25 20:10:00","updated_at":"2018-11-26 22:14:33"}}