{"speaker":{"id":4924,"title":"","firstname":"Alex","middleinitial":"","lastname":"Edmans","description":"Finance professor, editor","whotheyare":"Alex Edmans uses rigorous academic research to influence real-life business practices -- in particular, how companies can pursue purpose as well as profit.","whylisten":"<p>Alex Edmans is professor of finance at London Business School and managing editor of the <em>Review of Finance<\/em>, the leading academic finance journal in Europe. He is an expert in corporate governance, executive compensation, corporate social responsibility and behavioral economics.<\/p><p>Edmans has a unique combination of deep academic rigor and practical business experience. He&#39;s particularly passionate about translating complex academic research into practical ideas that can then be applied to real-life problems. He has spoken at the World Economic Forum in Davos, at the World Bank Distinguished Speaker Series and in the UK House of Commons. He is heavily involved in the ongoing reform of corporate governance, in particular to ensure that both the diagnosis of problems and suggested solutions are based on rigorous evidence rather than anecdote. He was appointed by the UK government to study the effect of share buybacks on executive pay and investment.<\/p><p>Edmans has been interviewed by Bloomberg, BBC, CNBC, CNN, ESPN, Fox, ITV, NPR, Reuters, Sky News and Sky Sports, and has written for the Wall Street Journal, Financial Times and Harvard Business Review. He runs a blog,&nbsp;<a href=\"http:\/\/www.alexedmans.com\/blog\" target=\"_blank\">Access to Finance<\/a>, that makes academic research accessible to a general audience, and was appointed&nbsp;<a href=\"https:\/\/www.gresham.ac.uk\/professorships\/commerce-professorship\/\" target=\"_blank\">Mercers&#39; School Memorial Professor of Business<\/a>&nbsp;by Gresham College, to give free lectures to the public. His 2018\/9 lecture series was on &quot;<a href=\"https:\/\/www.gresham.ac.uk\/series\/business-in-society\/\" target=\"_blank\">How Business Can Better Serve Society<\/a>&quot;&nbsp;and his 2019\/20 series is on &quot;<a href=\"https:\/\/www.gresham.ac.uk\/series\/business-skills\/\" target=\"_blank\">Business Skills<\/a>&quot; for the 21st Century.<\/p><p>Edmans was previously a tenured professor at Wharton, where he won 14 teaching awards in six years. At LBS, he won the Excellence in Teaching award, LBS&#39;s highest teaching accolade. His book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Grow-Pie-Companies-Deliver-Purpose\/dp\/1108494854\/\" target=\"_blank\"><em>Grow the Pie: How Great Companies Deliver Both Purpose and Profit<\/em><\/a>, will be published as Cambridge University Press&#39;s lead business title in early 2020.<\/p>","slug":"alex_edmans","published_at":"2018-10-30 16:11:00","updated_at":"2020-01-13 19:35:31"}}