{"speaker":{"id":4927,"title":"","firstname":"Mara","middleinitial":"","lastname":"Mintzer","description":"Community engagement specialist","whotheyare":"Mara Mintzer thrives on engaging children, youth and underrepresented communities in participatory planning, an approach that aims to integrate the views of all community members into designing exemplary communities.","whylisten":"<p>By using creative, participatory methods in classrooms and community events, Mara Mintzer brings children, city planners and elected officials together to address the city&rsquo;s most pressing issues. She writes and presents internationally on the topic of engaging children and youth in planning.<\/p><p>Mintzer is based at the University of Colorado in Boulder, Colorado, where she co-founded and now directs&nbsp;<a href=\"http:\/\/www.growingupboulder.org\/\" target=\"_blank\">Growing Up Boulder<\/a>&nbsp;(GUB).&nbsp; Growing Up Boulder is a child- and youth-friendly city initiative that is a partnership between the University of Colorado, the City of Boulder, and Boulder Valley School District. Since its inception in 2009, Growing Up Boulder has worked with more than 4,000 young people, ages 0-18, and 1,000 university students to give children and youth a voice in designing the very communities in which they live.&nbsp; Her students routinely provide input to urban planners and testify before city council on issues that matter to them. Growing up Boulder is part of the University of Colorado Boulder&rsquo;s Community Engagement Design and Research (CEDaR) Center.&nbsp;&nbsp;<\/p><p>Prior to her current work, Mintzer&nbsp;created and managed programs for underresourced children and families in California and New York.&nbsp; These programs ranged from Early Head Start, preschool education and universal pre-kindergarten classes to parenting classes and coordinated family support services on a public school campus. In addition, she facilitated community building through participatory budgeting and neighborhood visioning processes for the California community in which she worked.<\/p><p>Mintzer received her BA in psychology from Brown University and her MA in organizational&nbsp;psychology from Teachers College, Columbia University. She takes an interdisciplinary approach to her work that values the intersection of urban planning, education, civic engagement and social justice. A spirit of collaboration underlies all of Mintzer&#39;s work. She loves to travel and practice her French and Spanish language skills fearlessly.<\/p>","slug":"mara_mintzer","published_at":"2018-11-01 20:52:00","updated_at":"2018-11-07 21:07:11"}}