{"speaker":{"id":4928,"title":"","firstname":"Franklin","middleinitial":"","lastname":"Leonard","description":"Film producer","whotheyare":"Franklin Leonard is a film producer, cultural commentator, professor, activist and entrepreneur.","whylisten":"<p>Franklin Leonard is the founder and CEO of the Black List, the company that celebrates and supports great screenwriting and the writers who do it via film production, as well as its annual survey of the best unproduced screenplays, online marketplace, live staged script readings, screenwriter labs and film culture publications. More than 400 scripts from the annual Black List survey (30 percent of its total output)&nbsp;have been produced as feature films, earning 250 Academy Award nominations and 50 wins, including four of the last ten Best Pictures and ten of the last twenty-two screenwriting Oscars.<\/p><p>Leonard has worked in feature film development at Universal Pictures and the production companies of Will Smith, Sydney Pollack and Anthony Minghella, and Leonardo DiCaprio. He has been a juror at the Sundance, Toronto, and Guanajuato Film Festivals and for the PEN Center Literary Awards. He was also a delegate and speaker at the White House&#39;s 2015 Global Entrepreneurship Summit in Nairobi, Kenya. He was one of Hollywood Reporter&#39;s &quot;35 Under 35,&quot; <em>Black Enterprise<\/em> magazine&#39;s &quot;40 Emerging Leaders for Our Future,&quot; The Root&rsquo;s 100 Most Influential African-Americans, Fast Company&rsquo;s &quot;100 Most Creative People in Business&quot; and was awarded the 2015 African-American Film Critics Association (AAFCA)&#39;s Special Achievement Award for career excellence. He is an occasional commentator on the BBC and MSNBC on matters of culture, politics and race, an associate professor at the American Film institute, a trustee of PEN America, an advisor to Glitch, Inc. and a member of the Associates Branch of the Academy of Motion Pictures Arts and Sciences.<\/p>","slug":"franklin_leonard","published_at":"2018-11-03 22:48:00","updated_at":"2018-11-07 15:41:11"}}