{"speaker":{"id":4929,"title":"","firstname":"Suzie","middleinitial":"","lastname":"Sheehy","description":"Physicist","whotheyare":"Dr. Suzie Sheehy uses accelerator physics to help reinvent technology for applications in medicine, energy and beyond.","whylisten":"<p>Dr. Suzie Sheehy designs particle accelerators. She&#39;s fascinated by using accelerator physics to help us reinvent technology for applications in areas such as medicine and energy. Her research projects have ranged from the design of new cancer treatment accelerators to building a scaled-down experiment that models particle beams -- answering fundamental questions about the physics of beams that are beyond reach of computer simulations.<\/p><p>Sheehy is currently a Royal Society University Research Fellow at the University of Oxford, where she also teaches graduate-level accelerator physics. She completed her undergraduate degree at the University of Melbourne in her native Australia (BSc Hons 2006) and DPhil at the University of Oxford in the John Adams Institute for Accelerator Science (2010). She has held fellowships from the Royal Commission for the Exhibition of 1851 (Brunel fellow 2010-2013) as well as her current Royal Society Fellowship.<\/p><p>Alongside her research, Sheehy&nbsp;is a prolific public speaker, presenter and science communicator, for which she has received a number of awards including the British Science Association Lord Kelvin Award, Institute of Physics HEPP Group Science in Society Award and the University of Oxford Vice Chancellors Civic Award. She is an expert TV presenter for<em> Impossible Engineering<\/em> on Discovery Channel and has cowritten and delivered live headline shows for tens of thousands of students at the Big Bang Fair alongside well known BBC TV presenters. She regularly presents public and schools lectures around the UK and further afield at major science festivals and venues like the Royal Institution.<\/p>","slug":"suzie_sheehy","published_at":"2018-11-03 23:01:00","updated_at":"2018-11-05 15:56:17"}}