{"speaker":{"id":4931,"title":"","firstname":"Leland","middleinitial":"","lastname":"Melvin","description":"Engineer, educator","whotheyare":"Leland Melvin is an engineer, educator, former NASA astronaut and NFL wide receiver. He shares his stories of perseverance and excellence to inspire communities for lasting positive change.","whylisten":"<p>Leland Melvin served on board the Space Shuttle <em>Atlantis<\/em> as a mission specialist on mission STS-122 (2008) and STS-129 (2009), helping to construct the International Space Station. He also served as co-chair of the White House&#39;s Federal Coordination in STEM Education Task Force and as NASA Associate Administrator for Education. He can currently be seen as a judge on ABC&#39;s robot competition series &quot;BattleBots.&quot;<\/p><p>&quot;Houston, we have a problem.&quot; Melvin was 25 feet under water in the Neutral Buoyancy Laboratory, a six million gallon pool, training to perform spacewalks as a NASA astronaut when he called the test director and asked him to turn the volume up in his headset. He never heard a reply and was immediately hoisted out of the pool to learn that he was deaf. Emergency surgery resulting in only partial recovery to his hearing and led him to being medically disqualified to fly in space by NASA flight surgeons.<\/p><p>This is just one of the many career-ending challenges Melvin has overcome in his life. Before becoming an astronaut, he was drafted by the Detroit Lions to play professional football in 1986, but a hamstring injury thwarted his NFL career with Detroit and then later with the Dallas Cowboys. Through determination and perseverance, he ultimately traveled off-planet twice on Space Shuttle <em>Atlantis<\/em> to help construct the International Space Station, logging more than 565 hours in space. He&#39;s the only person drafted into the National Football League to have flown in space. The Pro Football Hall of Fame honored his athletic and academic accomplishments by placing his Detroit Lions jersey under glass in Canton, Ohio.<\/p><p>Melvin has a bachelor&#39;s degree in chemistry and a master&#39;s degree in materials science engineering. He worked at NASA Langley Research Center in the area of nondestructive testing creating optical fiber sensors for measuring damage in aerospace vehicles resulting in publications in numerous scientific journals. After hanging up his space boots, he was appointed head of NASA Education and served as the co-chair on the White House&#39;s Federal Coordination in Science, Technology, Engineering and Mathematics (STEM) Education Task Force developing the nation&#39;s five-year STEM education plan. He was the United States representative and chair of the International Space Education Board (ISEB), a global collaboration in space. He holds five honorary doctorates for his service in education, the sciences and philanthropy.<\/p><p>Melvin&#39;s memoir, <a href=\"http:\/\/geni.us\/PoBX\" target=\"_blank\"><em>Chasing Space: An Astronaut&#39;s Story of Grit, Grace, and Second Chances<\/em><\/a>&nbsp;shares his personal journey from the gridiron to the stars and examines the intersecting roles of community, perseverance and grace that align to create the opportunities for success. A young reader&#39;s version of the book is available&nbsp;<a href=\"http:\/\/geni.us\/E7xG\" target=\"_blank\">here<\/a>.<\/p>","slug":"leland_melvin","published_at":"2018-11-06 21:27:00","updated_at":"2019-01-31 20:20:49"}}