{"speaker":{"id":5,"title":"","firstname":"Burt","middleinitial":"","lastname":"Rutan","description":"Aircraft engineer","whotheyare":"In 2004, legendary spacecraft designer Burt Rutan won the $10M Ansari X-Prize for <em>SpaceShipOne,<\/em> the first privately funded craft to enter space twice in a two-week period. He's now collaborating with Virgin Galactic to build the first rocketship for space tourism.","whylisten":"<p>Burt Rutan is widely regarded as one of the world&#39;s most important industrial designers, and his prolific contributions to air- and spacecraft design have driven the industry forward for decades. His two companies, <a href=\"http:\/\/www.rutanaircraft.com\/\" target=\"_blank\">Rutan Aircraft Factory<\/a>  and <a href=\"http:\/\/www.scaled.com\/\" target=\"_blank\">Scaled Composites<\/a>, have developed and flight-tested more new types of aircraft than the rest of the US industry combined. He has himself designed hundreds of aircraft, including the famous <em>Voyager,<\/em> which his brother piloted on a record-breaking nine-day nonstop flight around the world.&nbsp;<\/p><p>Rutan might also be the person to make low-cost space tourism a reality: <strong>He&#39;s one of the major players promoting entrepreneurial approaches to space exploration<\/strong>, and his collaboration with <a href=\"http:\/\/www.virgingalactic.com\/\" target=\"_blank\">Virgin Galactic<\/a>  is the most promising of these efforts. SpaceShipTwo, a collaboration between Richard Branson and Rutan completed its first &quot;captive carry&quot; in March of 2010, marking the beginning of the era of commercial space exploration.<\/p><p>Ever the maverick, Rutan is known for both his bold proclamations and his criticism of the aerospace industry. Witness the opening line of his presentation at TED2006: &quot;Houston, we have a problem. We&#39;re entering a second generation of no progress in terms of human flight in space.&quot;<\/p>","slug":"burt_rutan","published_at":"2007-02-13 10:49:00","updated_at":"2010-06-15 15:58:14"}}