{"speaker":{"id":5005,"title":"","firstname":"Muhammed","middleinitial":"","lastname":"Idris","description":"Entrepreneur, investor","whotheyare":"Muhammed Idris wants to improve social services delivery through collective and artificial intelligence.","whylisten":"<p>Dr. Muhammed Y. Idris, PhD is a Fellow at Capria, a leading global impact investment firm, and the cofounder and lead developer of Edel Technologies, an organization that build AI-powered tools and products for frontline humanitarian organizations and service providers, including the United Nations Refugee Agency (UNHCR).<\/p><p>Inspired by own personal experiences with refugee resettlement, Idris left academia to build the world&#39;s first virtual advocate bot,&nbsp;<a href=\"https:\/\/edel.io\/#atar\" target=\"_blank\">Atar<\/a>, that empowers refugees and other newcomers with information about what to do, where to go and what to expect using customized step-by-step guides.<\/p><p>Trained as a computational social scientist, Idris started his career in finance at BlackRock&nbsp;and went on to complete a PhD with a focus on research and development of open-source tools for leveraging socially-generating &quot;big data&quot; and make it easy to digest this complex technical information into actionable insights.<\/p><p>Idris&#39;s work has been presented at numerous academic, policy and industry conferences, and he has held teaching and research positions at the University of Washington, The Pennsylvania State University, Concordia University in Montreal as well as Harvard University, where he held a predoctoral fellowship at the Belfer Center for Science and International Affair while completing his dissertation.<\/p><p>As a self-taught programmer, Idris enjoys teaching statistics and programming in his spare time. While his current focus in on helping streamline and scale refugee resettlement, his mission is to help improve social services delivery for all through collective and artificial intelligence as an entrepreneur and investor.<\/p>","slug":"muhammed_idris","published_at":"2018-11-27 22:05:00","updated_at":"2019-04-04 14:36:35"}}