{"speaker":{"id":5008,"title":"","firstname":"Stacey","middleinitial":"","lastname":"Abrams","description":"Politician","whotheyare":"Former Georgia House Democratic Leader Stacey Abrams made history in 2018 when she earned the Democratic nomination for governor of Georgia. ","whylisten":"<p>Stacey Abrams&#39;s 2018 campaign for governor of Georgia turned more voters than any Democrat in Georgia history, including former President Barack Obama, and invested in critical infrastructure to build progress in the state. After witnessing the gross mismanagement of the election by the Secretary of State&#39;s office, Abrams launched&nbsp;<a href=\"https:\/\/www.fairfight.com\/\" target=\"_blank\">Fair Fight<\/a>&nbsp;to ensure every Georgian has a voice in our election system.&nbsp;&nbsp;<\/p><p>Abrams received degrees from Spelman College, the LBJ School of Public Affairs at the University of Texas and Yale Law School. Dedicated to civic engagement, she founded the New Georgia Project, which submitted more than 200,000 registrations from voters of color between 2014 and 2016.<\/p><p>Under the pen name Selena Montgomery, Abrams is the award-winning author of eight romantic suspense novels, which have sold more than 100,000 copies. As co-founder of NOW Account, a financial services firm that helps small businesses grow, Abrams has helped create and retain jobs in Georgia. And through her various business ventures, she has helped employ even more Georgians, including hundreds of young people starting out. As House Minority Leader, she has worked strategically to recruit, train, elect and defend Democrats to prevent a Republican supermajority in the House, and she has worked across the aisle on behalf of all Georgians. During her tenure, she has stopped legislation to raise taxes on the poor and middle class and to roll back reproductive healthcare. She has brokered compromises that led to progress on transportation, infrastructure, and education. In the legislature, she passed legislation to improve the welfare of grandparents and other kin raising children and secured increased funding to support these families.<\/p><p>Abrams and her five siblings grew up in Gulfport, Mississippi with three tenets: go to school, go to church, and take care of each other. Despite struggling to make ends meet for their family, her parents made service a way of life for their children -- if someone was less fortunate, it was their job to serve that person. This ethic led the family to Georgia. Abrams&#39;s parents attended Emory University to pursue graduate studies in divinity and become United Methodist ministers. Abrams and her younger siblings attended DeKalb County Schools, and she graduated from Avondale High School.<\/p>","slug":"stacey_abrams","published_at":"2018-11-30 16:49:00","updated_at":"2020-11-06 18:44:03"}}