{"speaker":{"id":5013,"title":"","firstname":"Jose Antonio","middleinitial":"","lastname":"Vargas","description":"Immigrant rights advocate, founder of Define American","whotheyare":"Jose Antonio Vargas, author of \"Dear America: Notes of an Undocumented Citizen,\" is the founder of Define American, a nonprofit organization that uses stories to shift the narrative on immigrants.","whylisten":"<p>A leading voice for the human rights of immigrants, Jose Antonio Vargas founded the nonprofit media and culture organization&nbsp;<a href=\"https:\/\/www.defineamerican.com\/\" target=\"_blank\">Define American<\/a>, named one of the &quot;World&#39;s Most Innovative Companies&quot; by Fast Company. He published his best-selling memoir,&nbsp;<a href=\"https:\/\/geni.us\/Aqaf\" target=\"_blank\"><em>Dear America: Notes of an Undocumented Citizen<\/em><\/a>, in 2018.<\/p><p>Vargas recently coproduced Heidi Schreck&#39;s acclaimed Broadway play <em>What the Constitution Means to Me<\/em>, which was nominated for two 2019 Tony awards, including Best Play. In 2011, the <em>New York Times Magazine<\/em> published a groundbreaking essay he wrote in which he revealed and chronicled his life in America as an undocumented immigrant. A year later, he appeared on the cover of <em>TIME<\/em> magazine with fellow undocumented immigrants as part of a follow-up cover story he wrote. He then produced and directed <em>Documented<\/em>, an autobiographical documentary feature film that aired on CNN and received a 2015 NAACP Image Award nomination for Outstanding Documentary. Also in 2015, MTV aired<em> White People<\/em>, an Emmy-nominated television special he produced and directed on what it means to be young and white in a demographically-changing America.<\/p><p>Among many accolades, Vargas has received the Freedom to Write Award from PEN Center USA and honorary degrees from Emerson College, Colby College and the John Jay College of Criminal Justice. Passionate about the role of arts in society and promoting equity in education, he serves on the advisory board of&nbsp;<a href=\"https:\/\/thedream.us\/\" target=\"_blank\">TheDream.US<\/a>, a scholarship fund for undocumented immigrant students. A product of the San Francisco Bay Area, he is a proud graduate of San Francisco State University (&#39;04), where he was named Alumnus of the Year in 2012, and Mountain View High School (&#39;00). An elementary school named after Vargas opened in his hometown of Mountain View, California in August 2019.<\/p>","slug":"jose_antonio_vargas","published_at":"2018-12-04 18:08:00","updated_at":"2020-08-11 19:05:23"}}