{"speaker":{"id":5018,"title":"","firstname":"Erez","middleinitial":"","lastname":"Yoeli","description":"Research scientist","whotheyare":"Erez Yoeli's research focuses on altruism: understanding how it works and how to promote it.","whylisten":"<p>Erez (pronounced &lsquo;EH-rez&rsquo;) Yoeli is a research scientist at MIT&#39;s Sloan School of Management, where he directs the&nbsp;<a href=\"https:\/\/corporation.mit.edu\/\" target=\"_blank\">Applied Cooperation Team<\/a>. His research focuses on altruism: understanding how it works and how to promote it. He collaborates with governments, nonprofits and companies to apply these insights to address real-world challenges like increasing energy conservation, improving antibiotic adherence, reducing smoking in public places and promoting philanthropy.<\/p><p>Yoeli teaches the undergraduate&nbsp;<a href=\"https:\/\/courses.harvard.edu\/detail?q=id:d_colgsas_2018_1_203555_001&amp;returnUrl=search%3Fq%3Deconomics%25201057%26sort%3Dcourse_title%2520asc%26start%3D0%26rows%3D25\" target=\"_blank\">Game Theory course<\/a>&nbsp;at Harvard and regularly&nbsp;<a href=\"http:\/\/erezyoeli.com\" target=\"_blank\">publishes<\/a>&nbsp;theoretical and applied academic research articles. He shares his research highlights through frequent talks and featured articles in the <em>New York Times<\/em>, <em>The Economist<\/em>, Quartz and <em>Behavioral Scientist<\/em>. His research has also been profiled nationally and internationally in publications like <em>TIME<\/em> and Huffington Post.&nbsp;<\/p><p>Yoeli received his PhD in economics from the University of Chicago Booth School of Business. Before founding the Applied Cooperation Team, he was an economist at the US Federal Trade Commission and served as an expert witness in cases against companies that defrauded consumers. In an earlier, &quot;pre-economist&quot; life, he was a classical percussionist. He enjoys spicy food, hiking and spending time with his two very cuddly cats.\f<\/p>","slug":"erez_yoeli","published_at":"2018-12-05 15:24:00","updated_at":"2018-12-05 15:30:02"}}