{"speaker":{"id":5052,"title":"","firstname":"Mathias","middleinitial":"","lastname":"Basner","description":"Sleep and noise researcher","whotheyare":"Mathias Basner researches the effects of noise on sleep, health, neurobehavioral and cognitive functions and more.","whylisten":"<p>Mathias Basner, MD, PhD, MSc is an associate professor in the department of psychiatry at the University of Pennsylvania Perelman School of Medicine. His primary research interests concern the effects of sleep loss on neurobehavioral and cognitive functions, population studies on sleep time and waking activities, the effects of traffic noise on sleep and health, and astronaut behavioral health on long-duration space missions. These research areas overlap widely. Basner has published more than 80 journal articles and reviewed articles for more than 80 scientific journals. He is currently on the editorial board of the journals <em>Sleep Health<\/em> and <em>Frontiers in Physiology<\/em>.<\/p><p>Between 1999 and 2008, Basner conducted several large-scale laboratory and field studies on the effects of traffic noise on sleep at the German Aerospace Center. For this research, Basner&nbsp;was awarded the German Aerospace Center Research Award in 2007 and the Science Award of the German Academy for Aviation and Travel Medicine in 2010. Basner&nbsp;developed an ECG-based algorithm for the automatic identification of autonomic activations associated with cortical arousal that was used in several field studies to non-invasively assess the effects of aircraft noise on sleep. He is currently funded by the FAA to obtain current exposure-response functions describing the effects of aircraft noise on sleep for the United States. Basner&nbsp;has been an advisor to the World Health Organization (WHO) on the effects of traffic noise on sleep and health on a number of occasions. He performed a systematic evidence review on the effects of noise on sleep for the recently published revision of WHO&#39;s Environmental Noise Guidelines for the European Region.<\/p><p>Basner&nbsp;is currently President of the International Commission of Biological Effects of Noise (ICBEN) and member of the Impacts and Science Group of the Committee on Aviation Environmental Protection (CAEP) of the International Civil Aviation Organization (ICAO). He also represents the University of Pennsylvania in FAA&#39;s Aviation Sustainability Center (ASCENT).<\/p>","slug":"mathias_basner","published_at":"2018-12-07 22:34:00","updated_at":"2019-02-12 15:44:01"}}