{"speaker":{"id":5067,"title":"","firstname":"George","middleinitial":"","lastname":"Blair-West","description":"Psychiatrist","whotheyare":"Dr. George Blair-West is an author, researcher and doctor specializing in psychiatry.","whylisten":"<p>Dr. George Blair-West specializes in psychiatry in private practice in Brisbane, Australia. He sub-specializes in trauma and relationship\/sex therapy. His abiding interest is distilling the latest psychotherapeutic research, honing these insights for impactful delivery through his clinical work, and then sharing them with the greater population.<\/p><p>In the 1990s, as a Senior Lecturer at the University of Queensland, Blair-West published widely on suicide and depression. Needing to lose weight himself, he then turned his focus to the overlooked research into the psychological forces that prevent weight loss. The bestselling book <em>Weight Loss for Food Lovers: Understanding Our Minds and Why We Sabotage Our Weight Loss<\/em> (translated into Dutch and Chinese) along with related research papers resulted in keynote addresses, a regular spot on the Australian breakfast show&nbsp;<em>Today&nbsp;<\/em>and media appearances around the world. A children&#39;s book on teaching healthy eating habits followed,&nbsp;and in 2010 Blair-West was named one of the &quot;top 20 most influential obesity experts in the world.&quot;<\/p><p>Blair-West&#39;s 2013 novel&nbsp;<em>The Way of The Quest<\/em>&nbsp;received three international awards and was about the &quot;how to&quot; of finding one&#39;s meaning and purpose in life while building healthy relationships.<\/p><p>Helping people make sense of relationships is Blair-West&#39;s most important work. Drawing on his 25 years as a relationship therapist, he is currently writing his fourth book, <em>How to Make the Biggest Decision of Your Life<\/em> with his daughter Jiveny Blair-West, a dating coach. He and his wife Penny,&nbsp;a psychologist, celebrated 30 years of marriage in 2018.<\/p>","slug":"george_blair_west","published_at":"2019-01-04 21:25:00","updated_at":"2019-01-14 20:49:05"}}