{"speaker":{"id":5070,"title":"","firstname":"Steven","middleinitial":"","lastname":"Petrow","description":"Journalist, author","whotheyare":"Journalist Steven Petrow writes about manners and civility.","whylisten":"<p>Steven Petrow is an award-winning journalist and book author who is best known for his <em>Washington Post<\/em> and <em>New York Times<\/em> essays on&nbsp;<a href=\"https:\/\/www.washingtonpost.com\/lifestyle\/style\/introducing-steven-petrows-civilities-a-new-advice-column-in-the-washington-post\/2014\/04\/21\/8412c070-be67-11e3-b574-f8748871856a_story.html?utm_term=.9797a0965e71\" target=\"_blank\">civility<\/a>&nbsp;and manners, aging and cancer. He was recently named as an&nbsp;<a href=\"https:\/\/www.usatoday.com\/search\/steven%20petrow\/\" target=\"_blank\">opinion columnist<\/a>&nbsp;for the USA TODAY Network.<\/p><p>When Petrow&#39;s last book,&nbsp;<a href=\"https:\/\/geni.us\/JI4I6qO\" target=\"_blank\"><em>Steven Petrow&#39;s Complete Gay and Lesbian Manners: The Definitive Guide to LGBT Life<\/em><\/a>, was published, <em>TIME<\/em> magazine commented (in a full-length feature): &quot;Move over, Emily Post! When it comes to etiquette &hellip; author and journalist Steven Petrow is the authority.&quot; Previously, Petrow penned the <em>New York&nbsp;Times<\/em>&rsquo;s &quot;<a href=\"https:\/\/www.nytimes.com\/2012\/09\/18\/booming\/18civilbehavior.html\" target=\"_blank\">Civil Behavior<\/a>&quot; advice column and &quot;Digital Dilemmas&quot; for <em>Parade<\/em> magazine. His work has been published in <em>TIME<\/em>, <em>The Atlantic<\/em>, Salon, the Daily Beast, the <em>Los Angeles Times<\/em>&nbsp;and The Advocate.&nbsp;<\/p><p>You&#39;re likely to hear Petrow when you turn on NPR&#39;s &quot;<a href=\"https:\/\/www.npr.org\/2014\/04\/24\/306529540\/hes-my-partner-not-my-friend-a-primer-on-lgbt-etiquette\" target=\"_blank\">All Things Considered Weekend<\/a>,&quot; or one of your favorite (or least favorite) TV networks (MSNBC, PBS, CBS, Fox and CNN). Petrow also served as the host and executive producer of &quot;<a href=\"https:\/\/www.npr.org\/podcasts\/494652492\/the-civilist-podcast-with-steven-petrow\" target=\"_blank\">The Civilist<\/a>,&quot; a podcast from Public Radio International and North Carolina Public Radio WUNC.<\/p><p>A former president of NLGJA: The Association of LGBTQ Journalists, Petrow has been nominated for a Lambda Literary Award and The Publishing Triangle&#39;s Randy Shilts Award for Gay Non-Fiction and is a winner of several literary prizes, including the American Library Association&#39;s\/ForeWord Magazine Book Silver Award for Reference.<\/p><p>Petrow is the recipient of numerous awards and grants, including those from the National Endowment for the Humanities, the Smithsonian Institution, the Ucross Foundation, the Virginia Center for the Creative Arts and the National Press Foundation. In 2017, he became the named sponsor of the Petrow LGBTQ Fellowship at the VCCA, a prize that is awarded annually. Petrow, with three degrees from Duke University and the University of California, Berkeley, lives in Hillsborough, N.C.<\/p>","slug":"steven_petrow","published_at":"2019-01-07 21:24:00","updated_at":"2019-02-13 15:33:19"}}