{"speaker":{"id":5071,"title":"","firstname":"Rana","middleinitial":"","lastname":"Abdelhamid","description":"Community organizer, entrepreneur","whotheyare":"Rana Abdelhamid is an internationally acclaimed community organizer, first-degree black belt, public speaker and social entrepreneur focused on mass mobilization, international solidarity and the empowerment of marginalized communities.","whylisten":"<p>Rana Abdelhamid is committed to organizing communities around migrant, gender and racial justice. For ten years, Abdelhamid&nbsp;has served as the Executive Director of Malikah, a global grassroots movement committed to building safety and power for all women through self-defense, healing justice, community organizing and financial literacy. She founded Malikah at the age of 16 after being attacked by a stranger, who tried to remove the hijab from her head. Today, Abdelhamid&nbsp;and her volunteer team of women conduct healing spaces and have trained more than 7,000 women in 18 cities across the globe. For the past three years, Malikah has held the National Muslim Women&#39;s Summit at Harvard University, training 50 Muslim American women in leadership and community organizing.<\/p><p>Abdelhamid&#39;s organizing work has always been rooted in building solidarity across communities domestically and abroad. During the Arab Spring, Abdelhamid&nbsp;was involved in mobilizing diaspora communities in solidarity with grassroots activists in Egypt. After the &quot;Muslim ban&quot; was passed, she helped organize thousands of people across Boston for the 20,000-person Copley Square protest and spoke alongside Senator Elizabeth Warren, among others. After the murder of Nabra Hassanen, Abdelhamid&nbsp;and her team worked to mobilize tens of thousands of people across ten cities in under 24 hours for prayers and vigils in her remembrance.<\/p><p>In 2013, Abdelhamid&nbsp;started Hijabis of NY, an online platform that highlights the stories of hijabi women. In 2017, she also coedited and published Muslim Women&#39;s Stories, a collection of narratives from young Muslim women across the US. She is highly committed to the global human rights movement and is one of youngest serving board members of Amnesty International USA. Abdelhamid has a BA from Middlebury in International Politics and Economics and a master&#39;s degree in Public Policy from the Harvard Kennedy School, where her research was focused on policy interventions to mitigate the prevalence of domestic violence in Queens, NY and on refugee integration policy in the US.<\/p><p>In 2017, Abdelhamid&nbsp;was named one of the 17 women who &quot;Rocked the Resistance&quot; in 2017 and is frequently called &quot;the Muslim Black Belt.&quot; She has been named a Truman Scholar, a Running Start Rising Political Star and has received both a NYC Council Proclamation and an International Youth Advocate award by the UNAUSA Foundation.<\/p>","slug":"rana_abdelhamid","published_at":"2019-01-07 21:25:00","updated_at":"2019-04-12 14:01:50"}}