{"speaker":{"id":5093,"title":"","firstname":"Dr. Phillip Atiba","middleinitial":"","lastname":"Goff","description":"CEO, Center for Policing Equity","whotheyare":"Dr. Phillip Atiba Goff works with police departments to help public safety be more equitable and less deadly.","whylisten":"<p>Self-proclaimed &quot;justice nerd&quot; Dr. Phillip Atiba Goff devotes himself to understanding how people think and talk about racism in order to prevent racist behavior -- particularly in policing. A professor, mediator and translator, he helps communities and law enforcement understand each other and address problems that have felt unsolvable for centuries. He identifies the need to shift how we define racism: not as a defect of character, but rather a pattern of behaviors that are measurable and changeable.<\/p><p>Goff quickly became a national leader in the science of racial bias by pioneering scientific experiments that exposed how our minds learn to associate Blackness and crime implicitly -- often with deadly consequences. His work exposed the disturbingly robust finding that people in the U.S. overestimate the age of Black children, a cognitive error that predicts higher levels of police force against those children.&nbsp;<\/p><p>Goff is the president and cofounder of the&nbsp;<a href=\"https:\/\/policingequity.org\/\" target=\"_blank\">Center for Policing Equity<\/a>&nbsp;(CPE), a university research center that diagnoses the roots of disparate policing in order to eliminate them. The center is the world&#39;s largest research and action think tank on race and policing. CPE also boasts the world&#39;s largest collection of police behavioral data in the National Science Foundation-funded National Justice Database, which they have turned into a tool to reduce burdensome and inequitable policing through scientific analyses.<\/p><p>Goff received his AB from Harvard and PhD in psychology from Stanford. He has won two American Psychological Association early career awards, the Association for Psychological Science Rising Star award and the National Organization of Black Law Enforcement Executive&#39;s Lloyd G. Sealy Award, among many others. He regularly appears on MSNBC, provides congressional testimony and was a panelist for President Obama&#39;s Task Force on 21st Century Policing.<\/p>","slug":"phillip_goff","published_at":"2019-01-16 18:31:00","updated_at":"2020-06-03 21:51:59"}}