{"speaker":{"id":5099,"title":"","firstname":"Nora","middleinitial":"","lastname":"Brown","description":"Musician","whotheyare":"Nora Brown sings ballads and plays traditional old-time music with a heavy interest in eastern Kentucky banjo playing. ","whylisten":"<p>Nora Brown started learning ukulele&nbsp;at age six from the late Shlomo Pestcoe. With a focus on old-time music, he laid a foundation of love of music and the community it creates, and he instilled in her the lesson that music is meant to be shared. Now 13 years old, Brown&nbsp;plays banjo and accordion. She plays and sings with many of her old-time mentors including fiddler Stephanie Coleman, under the band name Little Leatherwood, and harmonica player Trip Henderson, under the band name Tin+Bone.<\/p><p>Nora is mentored by many of her favorite old-time musicians including Alice Gerrard, John Cohen, Anna Roberts-Gevalt, Sammy Lind, Mark Simos, KC Groves, Courtney Hartman, Mac Traynham, John Haywood and Brett Ratliff. In the last two years, she&#39;s won the blue ribbon in the youth banjo competition at the Clifftop Appalachian String Band Music Festival in West Virginia. In 2018 she also placed third in the adult banjo competition at Clifftop. In 2017 she landed second place in the banjo competition (all ages) at the Oldtone Roots Music Festival in Hillsdale, New York. More recently, Brown traveled to eastern Kentucky to visit with 90-year-old master banjo player and former coal miner Lee Sexton and master banjo player and historian George Gibson.<\/p><p>Brown has played on the Floyd Radio Show in Floyd, Virginia, the Washington Square Park Folk Festival, Brooklyn Folk Festival, Brooklyn Americana Festival, Oldtone Roots Music Festival, both Summer and Winter Hoots at the Ashokan Center and NYC Trad Fest. She has had multiple month-long residencies at famed Barb&egrave;s in Brooklyn, New York.<\/p><p>The Tribeca Film Festival funded a short documentary by Josh Weinstein about Nora called &quot;<a href=\"https:\/\/vimeo.com\/channels\/staffpicks\/279188765\" target=\"_blank\">Little Nora (the Banjo Prodigy)<\/a>.&quot;<\/p>","slug":"nora_brown","published_at":"2019-01-16 22:04:00","updated_at":"2019-03-29 12:39:10"}}