{"speaker":{"id":5132,"title":"","firstname":"Bina","middleinitial":"","lastname":"Venkataraman","description":"Journalist, author","whotheyare":"Bina Venkataraman is the Editorial Page Editor of the Boston Globe, a professor at MIT and the author of \"The Optimist's Telescope.\"","whylisten":"<p>For more than six years, Bina Venkataraman has been traveling around the world studying how people and communities think about the future. Her curiosity as a journalist, and her firsthand policy experience in the Obama White House, led her to question whether the shortsightedness rampant in today&#39;s societies is inevitable -- or actually &quot;a choice we&#39;re making.&quot;<\/p><p>During the Obama years, Venkataraman built partnerships among communities, companies and government to prepare for coming pandemics, wildfires and rising seas. In 2014, she launched the White House Climate Data Initiative to bring actionable climate science to people making decisions around the globe. Previously, she was a science journalist for the <em>New York Times<\/em> and the <em>Boston Globe<\/em>. Now, she teaches students at MIT to use scientific knowledge in service of society and is the Editorial Page Editor of the <em>Boston Globe<\/em>.<\/p><p>As Venkataraman writes: &quot;For as long as I can remember, I have suspected that the future of humanity depended on the future of the planet. I have since found this to be the most compelling story of our time. As I imagine what lies in our shared future, from gene-editing to the climate crisis, I see both dangers and extraordinary potential.&quot;<\/p><p>Venkataraman&#39;s first book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Optimists-Telescope-Thinking-Ahead-Reckless-ebook\/dp\/B07L2HY8L8\" target=\"_blank\"><em>The Optimist&#39;s Telescope<\/em><\/a>&nbsp;(Riverhead) was named a top business book by&nbsp;<a href=\"https:\/\/www.ft.com\/content\/3fb8d346-ae36-11e9-8030-530adfa879c2\" target=\"_blank\">The Financial Times<\/a>&nbsp;and a best book of 2019 by&nbsp;<a href=\"https:\/\/www.amazon.com\/b\/ref=s9_acss_bw_cg_BOTY19_2b1_w?node=17296226011&amp;pf_rd_i=17296221011&amp;pf_rd_m=ATVPDKIKX0DER&amp;pf_rd_p=b465e17a-8729-431d-8375-b223116b1f70&amp;pf_rd_r=HNSCDSMQ35S9AT35B8N7&amp;pf_rd_s=merchandised-search-7&amp;pf_rd_t=101\" target=\"_blank\">Amazon<\/a>,&nbsp;<a href=\"https:\/\/www.sciencefriday.com\/segments\/best-science-books-2019\/\" target=\"_blank\">Science Friday<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/apps.npr.org\/best-books\/#year=2019&amp;book=177\" target=\"_blank\">National Public Radio<\/a>. She wrote it to help people today better shape their own future and that of coming generations.<\/p>","slug":"bina_venkataraman","published_at":"2019-02-20 19:05:00","updated_at":"2020-01-03 14:27:27"}}