{"speaker":{"id":515,"title":"","firstname":"Sophal","middleinitial":"","lastname":"Ear","description":"Development economist","whotheyare":"Sophal Ear leads research on post-conflict countries -- looking at the effectiveness of foreign aid and the challenge of development in places like his native land, Cambodia.","whylisten":"        <p class=\"p1\">Elected to the Crescenta Valley Town Council in November 2015 for a 3-year term, encompassing more than 20,000 residents in unincorporated La Crescenta and Montrose, California, Sophal Ear, Ph.D., is a tenured Associate Professor of Diplomacy &amp; World Affairs at Occidental College in Los Angeles where he lectures on political economy, security, development and Asia.<\/p> <p class=\"p1\">Previously, he taught how to rebuild countries after wars at the U.S. Naval Postgraduate School and international development at the Maxwell School of Syracuse University. He consulted for the World Bank, was Assistant Resident Representative for the United Nations in East Timor and Advisor to Cambodia&#39;s 1st private equity fund Leopard Capital. A TED Fellow, Fulbright Specialist, Term Member of the Council on Foreign Relations and Young Global Leader of the World Economic Forum, he sits on the board of the Nathan Cummings Foundation, Refugees International, Partners for Development, the Southeast Asia Resource Action Center, the Southeast Asia Development Program, Diagnostic Microbiology Development Program, the Journal of International Relations and Development (Palgrave), the International Public Management Journal (Taylor &amp; Francis), Journal of South-East Asian American Education &amp; Advancement (Purdue), and Politics and the Life Sciences (Cambridge University Press).<\/p> <p class=\"p1\">He is the author of&nbsp;<a href=\"http:\/\/geni.us\/aidcambodia\"><span class=\"s1\"><em>Aid Dependence in Cambodia: How Foreign Assistance Undermines Democracy<\/em><\/span><\/a>&nbsp;(Columbia University Press, 2013) and co-author of&nbsp;<a href=\"http:\/\/geni.us\/hungrydragon\"><span class=\"s1\"><em>The Hungry Dragon: How China&rsquo;s Resources Quest is Reshaping the World<\/em><\/span><\/a><em>&nbsp;<\/em>(Routledge, 2013). He wrote and narrated the award-winning documentary film &quot;<a href=\"https:\/\/www.youtube.com\/watch?v=QwsSDPRI25E\"><span class=\"s1\">The End\/Beginning: Cambodia<\/span><\/a>&quot; (47 minutes, 2011) based on his 2009 TED Talk and has appeared in four other documentaries.<\/p> <p class=\"p1\">A graduate of Princeton and Berkeley, he moved to the United States from France as a Cambodian refugee at the age of 10.<\/p>","slug":"sophal_ear","published_at":"2009-07-08 01:00:00","updated_at":"2015-12-03 21:32:34"}}