{"speaker":{"id":5162,"title":"","firstname":"","middleinitial":"","lastname":"First Aid Kit","description":"Folk music duo","whotheyare":"Swedish duo First Aid Kit take multi-genre inspiration from folk, country and the classic singer-songwriters of the ’60s and ’70s.","whylisten":"<p>Swedish duo First Aid Kit, comprised of sisters Klara and Johanna S&ouml;derberg, have been making music together for over a decade. They gained international acclaim while still teenagers for their otherworldly harmonies and timeless songwriting taking multi-genre inspiration from folk, country and the classic singer-songwriters of the &#39;60s and &#39;70s.<\/p><p>Now four albums and two EPs into their career, 2018 saw First Aid Kit release the critically and commercially celebrated&nbsp;<em><a href=\"https:\/\/first-aid-kit-us.myshopify.com\/\" target=\"_blank\">Ruins<\/a>&nbsp;<\/em>and its companion EP&nbsp;<a href=\"https:\/\/first-aid-kit-us.myshopify.com\/products\/tender-offerings-10-vinyl\" target=\"_blank\"><em>Tender Offerings<\/em><\/a>. Written during a break up and recorded in Portland, OR with producer Tucker Martine, it is their most mature and personal record to date for which they were honored with a Swedish Grammy and Brits awards nomination. For International Women&#39;s Day 2017, the duo released &quot;<a href=\"https:\/\/www.youtube.com\/watch?v=exsaCN4c5dc\" target=\"_blank\">You are the Problem Here<\/a>&quot;&nbsp;-- a searing takedown of misogyny and rape culture as a charity single, donating the proceeds to Women for Women International.<\/p><p>First Aid Kit have performed sold out shows at many of the world&rsquo;s most iconic venues -- Royal Albert Hall, The Sydney Opera House and most recently this past January, the Globe Arena in their native Stockholm. They have been honored with multiple Swedish Grammys and Music Publishers Association awards, and in 2015 Sweden featured them on a limited edition postage stamp.<\/p>","slug":"first_aid_kit","published_at":"2019-02-21 17:56:00","updated_at":"2019-10-11 17:02:07"}}