{"speaker":{"id":5174,"title":"","firstname":"Michael","middleinitial":"","lastname":"Tubbs","description":"Community leader, former mayor of the City of Stockton, California","whotheyare":"Michael Tubbs became the youngest mayor in the history of the US to represent a city with a population of more than 100,000 residents.","whylisten":"<p>On November 8, 2016, Michael Tubbs was elected to serve as the mayor of the City of Stockton, California. Upon taking office in January 2017, Michael Tubbs became both Stockton&rsquo;s youngest mayor and the city&rsquo;s first African-American mayor.<\/p><p>Included in <em>Fortune<\/em>&#39;s 2018 &quot;40 under 40,&quot; <em>Forbes<\/em>&#39; 2018 list of the &quot;30 Under 30&quot; and The Root&#39;s 100, Tubbs&#39;s leadership, paired with an ambitious agenda, received national recognition.&nbsp;<br \/>&nbsp;<br \/>Tubbs secured over $20 million in philanthropic capital to launch the Stockton Scholars, a place-based scholarship that aims to triple the number of Stockton students entering and graduating from college. Tubbs also brought Advance Peace to Stockton, a data-driven program that works to reduce gun violence in communities. Additionally, with an innovative public-private partnership supported by a $1,000,000 seed grant from the Economic Security Project, Tubbs launched the nation&rsquo;s first municipal level basic income pilot, the Stockton Economic Empowerment Demonstration.<br \/>&nbsp;<br \/>Before becoming mayor, Tubbs served as Stockton&#39;s District 6 City Councilmember. Elected at age 22 in 2013, he became one of the youngest city councilmembers in the country. As a councilmember, Tubbs created the Reinvent South Stockton Coalition, championed the creation of the City&#39;s Office of Violence Prevention and was part of the council that led the city out of bankruptcy as Chair of the Audit and Legislative Committee.<br \/>&nbsp;<br \/>Tubbs graduated from Stanford University in 2012 with a bachelor&#39;s and master&#39;s degree with honors. He has been a college course instructor for Aspire Public Schools and a Fellow at the Stanford Institute of Design and the Emerson Collective. He is a Stockton native and product of Stockton public schools.<\/p>","slug":"michael_tubbs","published_at":"2019-02-21 21:54:00","updated_at":"2021-01-14 18:53:47"}}