{"speaker":{"id":519,"title":"","firstname":"Daniel","middleinitial":"","lastname":"Kraft","description":"Physician-scientist, inventor, entrepreneur","whotheyare":"Daniel Kraft explores the impact and potential of rapidly developing technologies as applied to health and medicine.","whylisten":"<p>Dr. Daniel Kraft is a Stanford and Harvard trained physician-scientist with more than 25 years of experience in clinical practice, biomedical research and innovation. He is Founder and Chair for&nbsp;<a href=\"http:\/\/ExponentialMedicine.com\" target=\"_blank\">Exponential Medicine<\/a>, a program which explores convergent, rapidly developing technologies and their potential to reshape the future of health and biomedicine. He is also faculty chair for medicine at&nbsp;<a href=\"http:\/\/SU.org\" target=\"_blank\">Singularity University<\/a>&nbsp;and chairs the&nbsp;<a href=\"http:\/\/covid19.xprize.org\" target=\"_blank\">XPRIZE Pandemic Alliance Task Force<\/a>.<\/p><p>After graduating from Brown University and medical school at Stanford, Kraft was board certified in both Internal Medicine and Pediatrics following residency at the Massachusetts General Hospital &amp; Boston Children&#39;s Hospital, and he completed Stanford fellowships in hematology\/oncology and bone marrow transplantation. He is a fellow in the inaugural 2016 class of the Aspen Institute Health Innovators Fellowship.<\/p><p>Kraft has conducted extensive research in stem cell biology and regenerative medicine with multiple scientific publications, medical device, digital health, and stem cell-related patents through faculty positions with Stanford University School of Medicine and as clinical faculty for the pediatric bone marrow transplantation service at the University of California San Francisco.&nbsp;<\/p><p>Kraft recently founded&nbsp;<a href=\"http:\/\/Digital.Health\" target=\"_blank\">Digital.Health<\/a>, focused on connected, data-driven, and integrated personalized health and medicine. He is the inventor of the MarrowMiner, an FDA-approved device for the minimally invasive harvest of bone marrow, and he founded RegenMed Systems, a company developing technologies to enable adult stem cell-based regenerative therapies. He is an advisor to the XPRIZE Foundation (where he conceived of the Medical Tricorder XPRIZE and helped lead a new&nbsp;<a href=\"http:\/\/xprize.org\/testing\" target=\"_blank\">XPRIZE for Rapid Covid-19 testing<\/a>). He is a Kauffman Fellow and an investor and advisor to several digital health and life science companies.<\/p><p>Kraft is an avid pilot and served for 14 years as an officer and flight surgeon with F-15 and F-16 fighter squadrons in the Air National Guard. He has conducted research on aerospace medicine that was published with NASA, with whom he was a finalist for astronaut selection.<\/p>","slug":"daniel_kraft","published_at":"2009-07-15 01:00:00","updated_at":"2021-05-10 15:29:05"}}