{"speaker":{"id":5202,"title":"","firstname":"Federica","middleinitial":"","lastname":"Bianco","description":"Cross-disciplinary scientist","whotheyare":"TED Fellow Federica Bianco is a cross-disciplinary scientist who can't stay still.","whylisten":"<p>Astrophysicist, professor, professional boxer and TED Fellow Federica Bianco studies stellar explosions, using the same methodologies to understand urban and social problems. She uses data-science to both study the universe and tackle problems on earth, like pollution in New York City, prosecutorial justice and how city lights can create resilient electric grids and.<\/p><p>Bianco splits her time as a professor at the University of Delaware in the Department of Physics and Astrophysics (where she runs a lab focusing on light curves), the Biden School of Public Policy and Administration and the Urban Observatory, where she uses her astrophysics skills to study urban problems. She is also the coordinator the Large Synoptic Survey Telescope&nbsp;(LSST) Science Collaboration, a network of more than 1,500 scientists. The LSST, under construction in Chile, will go online in 2023 to survey the night sky and image the southern hemisphere sky at unprecedented depth and resolution. The collaboration will study everything about it, from the thousands of changes it will discover in the sky every night to billions of stars and galaxies, many that have never been seen before.<\/p><p>Bianco has published more than 100 peer-reviewed papers, was a Smithsonian predoctoral and James Arthur postdoctoral fellow and was the recipient of a Department of Energy &quot;Innovative Development in Energy-Related Applied Science&quot; grant. When she isn&#39;t doing science, you will find her in the boxing ring, where she has made a name for herself as &quot;The MadScientist.&quot; She is known for fighting her heart out both in and out of the ring.<\/p>","slug":"federica_bianco","published_at":"2019-03-01 17:54:00","updated_at":"2019-09-17 20:56:55"}}