{"speaker":{"id":5206,"title":"","firstname":"Jess","middleinitial":"","lastname":"Kutch","description":"Labor entrepreneur","whotheyare":"TED Fellow Jess Kutch is the cofounder of Coworker.org, a nonprofit that helps people join together to improve their jobs and workplaces.","whylisten":"<p>Jess Kutch and her team at Coworker.org are figuring out the technology, organizing models, financing and policies that can help workers improve their companies and industries in today&rsquo;s economy. At Coworker.org, they believe anyone can be a workplace organizer and that seeking positive change at work is a form of civic and community leadership that requires infrastructure. Since 2013, hundreds of thousands of people in the United States and worldwide have used Coworker.org tools and services to win wage increases, scheduling improvements and parental leave benefits; end biased dress codes; fix harassment policies; demand corporate ethics and much more. Coworker.org also helps channel workers&#39; information about the real-time effects of digital economy trends -- like automation, data profiting, surveillance and app-based gig work -- to influence decisions that will shape the future of work and inequality.&nbsp;<\/p><p>Kutch&nbsp;has 15 years of experience innovating at the intersection of technology and social change. Previously, she led a team at Change.org that inspired hundreds of thousands of people to launch and lead their own efforts on the platform. She also spent five years at the Service Employees International Union (SEIU), where she pioneered digital strategies for the labor movement. Kutch&nbsp;is a TED Fellow, an Echoing Green Global Fellow, a J.M.K. Innovation Prize winner and an Aspen Institute Job Quality Fellow. She is a frequently requested speaker at business, labor, futurist, democracy and economic conferences around the world. She has been invited to provide expert testimony to the EEOC Task Force on Harassment in the Workplace and the National Labor Relations Board. In 2015, Coworker.org cohosted the first-ever White House Town Hall on Worker Voice.<\/p><p>&nbsp;<\/p>","slug":"jess_kutch","published_at":"2019-03-01 18:01:00","updated_at":"2019-11-01 18:59:52"}}