{"speaker":{"id":5217,"title":"","firstname":"Alvin Ailey","middleinitial":"","lastname":"American Dance Theater","description":"Dance company","whotheyare":"Alvin Ailey American Dance Theater grew from a now-fabled 1958 performance at the 92nd Street Y in New York City. Led by Alvin Ailey and a group of young African-American modern dancers, that performance changed forever the perception of American dance.","whylisten":"<p>Constance Stamatiou began her dance training at Pat Hall&#39;s Dance Unlimited and North Carolina Dance and Theatre. She graduated from NorthWest School of the Arts and studied at SUNY Purchase before becoming a fellowship student at The Ailey School. In 2009, Stamatiou received the Leonore Annenberg Fellowship in the performing and visual arts. She performed at the White House Dance Series and has been a guest performer on <em>So You Think You Can Dance<\/em>, <em>Dancing with the Stars<\/em>, Logo&#39;s Trailblazer Honors, and <em>The Today Show<\/em>. Stamatiou has also danced in the films <em>Shake Rattle &amp; Roll<\/em> and in Dan Pritzker&#39;s <em>Bolden<\/em>. Stamatiou was a member of Ailey ll a guest artist for Darrell Grand Moultrie and Caroline Calouche and Co. She is a certified Gyrotonic and Gyrokinesis instructor and a mother of two. Stamatiou first joined the Company in 2007 and rejoined in 2016.<\/p><p>Solomon Dumas was introduced to dance through AileyCamp. He later began his formal training at The Chicago Academy For The Arts and the Russell Talbert Dance Studio, where he received his most inﬂuential training. Dumas studied at New World School Of The Arts and was a fellowship Level 1 student at The Ailey School. He has performed with companies including Garth Fagan Dance; Ronald K. Brown\/Evidence A Dance Company; and Labyrinth Dance Theater and was a member of Ailey II. Mr. Dumas joined the Company in 2016.<\/p><p>Samantha Figgins began dancing at Duke Ellington School of the Arts under the tutelage of Charles Auggins and Sandra Fortune-Greene and attended summer intensives at Dance Theatre of Harlem under the direction of Arthur Mitchell.&nbsp; She continued her education at SUNY Purchase Conservatory of Dance. There, she performed works by George Balanchine, Bill T. Jones, Paul Taylor and Twyla Tharp. Upon graduating cum laude, Figgins became a member of Complexions Contemporary Ballet, performing works by Dwight Rhoden, Jae Man Joo and Camille A. Brown. She also performed at the 2014 DanceOpen Festival in St. Petersburg, Russia. Figgins was featured both on the cover of <em>Dance Spirit<\/em> magazine and in <em>Pointe<\/em> magazine&#39;s &quot;10 Careers to Watch&quot; in 2013. She has worked with Beyonc&eacute; and can be seen in the film Enemy Within alongside Tiler Peck and Matthew Rushing. Figgins joined the Company in 2014.<\/p>","slug":"alvin_ailey_american_dance_theater","published_at":"2019-03-06 18:37:00","updated_at":"2019-10-11 15:01:16"}}