{"speaker":{"id":5230,"title":"","firstname":"Andrew","middleinitial":"","lastname":"Marantz","description":"Writer","whotheyare":"Andrew Marantz writes narrative journalism about politics, the internet and the way we understand our world.","whylisten":"<p>Since 2016, Andrew Marantz has been at work on a book about the perils of virality, the myth of linear progress and the American far right. To report the book, he spent several years embedded with some of the conspiracists, white supremacists and nihilist trolls who have become experts at using social media to advance their corrosive agendas. He also watched as some of social media&#39;s earliest and most influential founders started to reckon with the forces they&#39;d unleashed. The book, forthcoming in October from Viking Press, is called&nbsp;<a href=\"https:\/\/geni.us\/kDTR\" target=\"_blank\"><em>Antisocial: Online Extremists, Techno-Utopians, and the Hijacking of the American Conversation<\/em><\/a>.&nbsp;<\/p><div>Marantz became a staff writer at the&nbsp;<em>New Yorker<\/em> in 2017. Prior to that, he worked on the magazine&#39;s editorial staff, splitting his time between writing stories (about such topics as hip-hop purism and the Truman Show delusion) and editing stories (about Las Vegas night clubs, Liberian warlords and many other things). Ultimately, Marantz&#39;s&nbsp;main interest lies not in any particular subject matter, but in how people form beliefs -- and under what circumstances those beliefs can change for the better.<\/div><p>Marantz is also a contributor to <em>Radiolab<\/em> and <em>The New Yorker Radio Hour<\/em>, and has written for <em>Harper&#39;s<\/em>, <em>Mother Jones<\/em>, the <em>New York Times<\/em>&nbsp;and many other outlets. He holds an undergraduate degree in religion from Brown University and a master&#39;s degree in literary nonfiction from New York University. He lives in Brooklyn with his wife, who is a criminal-justice reformer; his two-year-old son, who is an excellent dancer; and an endless supply of peanut butter.<\/p>","slug":"andrew_marantz","published_at":"2019-03-13 15:12:00","updated_at":"2019-08-29 15:01:22"}}