{"speaker":{"id":524,"title":"","firstname":"David","middleinitial":"","lastname":"Logan","description":"Professor of management","whotheyare":"David Logan is a USC faculty member, best-selling author, and management consultant.","whylisten":"<p>David Logan studies how people communicate within a company -- and how to harness our natural gifts to make change within organizations. He looks at emerging patterns of corporate leadership, organizational transformation, generational differences in the workplace, and team building for high-potential managers and executives.<br \/><br \/>He&#39;s the co-founder and senior partner at CultureSync, a management consulting firm, and works with Fortune 500 companies, governments, and nonprofits. Much of CultureSync&#39;s work is derived from a ten-year study of over 24,000 people published at <em>Tribal Leadership<\/em> (2008), which shows how organizational culture evolves over time and how leaders can nudge it forward. <br \/><br \/>He teaches management and leadership in the USC Executive MBA, and is also on the faculty at the International Centre for Leadership in Finance (ICLIF), endowed by the former prime minister of Malaysia, and on the Foundation for Medical Excellence in Portland.<br \/><br \/>From 2001-2004, he served as Associate Dean of Executive Education at USC. During that time, he started the Master of Medical Management (MMM), a business degree for midcareer medical doctors. He also initiated new executive education programs (often, in concert with the USC School of Policy, Planning and Development) with organizations as diverse as the Sierra Health Foundation, Northrop Grumman, and the City of Los Angeles. He continued to oversee many programs, including one of USC&#39;s first distance learning education courses for managers in Japan and a senior executive program at Toyota.<br \/><br \/>Logan is co-author of four books including&nbsp;<a href=\"http:\/\/geni.us\/triballeadership\" target=\"_blank\"><em>Tribal Leadership<\/em><\/a>&nbsp;and&nbsp;<a href=\"http:\/\/geni.us\/threelawsofperformance\" target=\"_blank\"><em>The Three Laws of Performance<\/em><\/a>.<\/p>","slug":"david_logan","published_at":"2009-10-06 01:00:00","updated_at":"2015-09-24 16:40:35"}}