{"speaker":{"id":5246,"title":"","firstname":"Alexander","middleinitial":"","lastname":"MacDonald","description":"Economist","whotheyare":"TED Senior Fellow Alexander MacDonald develops strategies to advance space exploration and encourage private-sector space activities.","whylisten":"<p>Alexander MacDonald founded NASA&#39;s Emerging Space Office, helps build small satellite programs around the world, and is the author of&nbsp;<a href=\"https:\/\/geni.us\/31KjN\" target=\"_blank\"><em>The Long Space Age<\/em><\/a>. He is an economist with the Jet Propulsion Laboratory (JPL) and is currently assigned to serve as the Senior Economic Advisor at NASA Headquarters, Washington, D.C.<\/p><p>MacDonald is the author and editor of a number of NASA reports including &quot;Emerging Space: The Evolving Landscape of 21st Century American Spaceflight,&quot; &quot;Public-Private Partnerships for Space Capability Development&quot; and &quot;Economic Development of Low-Earth Orbit.&quot; He also led the development of &quot;A Strategy for Human Spaceflight in Low Earth Orbit and Economic Growth in Space,&quot; submitted to the National Space Council in 2018 by NASA, the Department of State and the Department of Commerce. And he helped develop the NASA strategy for the 2016 Presidential Transition. He is an advocate for the use of small satellites -- cubesats -- for technical and capacity development throughout the world, having helped initiate cubesat projects in Lithuania and Kyrgyzstan and having helped establish nationwide cubesat initiatives in the US and Canada.&nbsp;&nbsp;<br \/>&nbsp;<br \/>MacDonald&nbsp;was a research faculty member at Carnegie Mellon University and worked for the Universities Space Research Association while at NASA&#39;s Ames Research Center where he worked on small satellite mission designs and served as the center&#39;s first research economist on staff. He received his undergraduate degree in economics from Queen&#39;s University in Canada, his master&#39;s degree in economics from the University of British Columbia and was a Clarendon Scholar at the University of Oxford, where he obtained his doctorate on the long-run economic history of American space exploration. He was also an inaugural TED Senior Fellow and received the History Manuscript of the Year Award in 2016 from the American Institute of Aeronautics and Astronautics.<\/p>","slug":"alex_macdonald","published_at":"2019-03-25 20:53:00","updated_at":"2019-04-29 20:35:58"}}