{"speaker":{"id":5264,"title":"","firstname":"Christoph","middleinitial":"","lastname":"Keplinger","description":"Roboticist, mechanical engineer","whotheyare":"Christoph Keplinger aims to fundamentally challenge current limitations of robotic hardware, combining soft matter physics and chemistry with advanced engineering technologies to create a new generation of lifelike robots.","whylisten":"<p>Robots today rely on rigid components and electric motors that use metal and magnets, making them heavy, unsafe near humans, expensive and ill-suited for unpredictable environments. Nature, in contrast, makes extensive use of soft materials such as muscles and skin and has produced organisms that drastically outperform robots in terms of agility, dexterity and adaptability. Christoph Keplinger aims to fundamentally challenge current limitations of robotic hardware, using an interdisciplinary approach that synergizes concepts from soft matter physics and chemistry with advanced engineering technologies to introduce intelligent materials systems for a new generation of life-like robots.<\/p><p>A major theme of Keplinger&#39;s&nbsp;research is the development of new classes of actuators -- a key component of all robotic systems -- that replicate the sweeping success of biological muscle, a masterpiece of evolution. He is the principal inventor of HASEL artificial muscles, a new class of high-performance muscle-mimetic actuators for use in next-generation robots that replicate the vast capabilities of biological systems. In 2018 he cofounded&nbsp;<a href=\"https:\/\/www.artimusrobotics.com\/\" target=\"_blank\">Artimus Robotics<\/a>&nbsp;to commercialize the technology.<\/p><p>Originally from Austria, Keplinger studied physics at the Johannes Kepler University Linz before moving to the US to research mechanics and chemistry at Harvard. He is an assistant professor of mechanical engineering and a fellow of the Materials Science and Engineering Program at the University of Colorado Boulder, where he leads a highly interdisciplinary research group that works on soft robotics, energy harvesting and functional polymers. His work has been published in&nbsp;<em><a href=\"https:\/\/science.sciencemag.org\/content\/359\/6371\/61\" target=\"_blank\">Science Magazine<\/a>, <\/em>among others, and&nbsp;highlighted in popular outlets such as&nbsp;<a href=\"https:\/\/news.nationalgeographic.com\/2018\/01\/university-scientists-create-artificial-muscle-hasel-actuator-spd\/\" target=\"_blank\"><em>National Geographic<\/em><\/a>. Keplinger&nbsp;he has received prestigious awards including a 2017 Packard Fellowship for Science and Engineering.<\/p>","slug":"christoph_keplinger","published_at":"2019-04-12 15:54:00","updated_at":"2019-04-15 23:52:02"}}