{"speaker":{"id":5267,"title":"","firstname":"Cady","middleinitial":"","lastname":"Coleman","description":"Astronaut","whotheyare":"Cady Coleman draws from her time at NASA and her missions on the International Space Station to share insights about team building, leadership and innovation.","whylisten":"<p>Cady Coleman is a scientist, wife, mother, pilot, musician, retired NASA Astronaut and a veteran of two Space Shuttle missions and a six-month trip aboard the International Space Station (ISS). Passionate about sharing her experiences aboard the ISS, Coleman delivered the&nbsp;<a href=\"https:\/\/vimeo.com\/20527833\" target=\"_blank\">introductory talk for TED2011<\/a>&nbsp;from space.<\/p><p>Coleman currently serves as University Explorer at Arizona State University and as a consultant for a wide range of space-related projects. Her first Space Shuttle mission set the stage for astronauts to conduct pioneering research aboard the ISS in materials science, biotechnology, combustion science and fluid physics. Launching the Chandra X-Ray Observatory was the focus of her second mission, making it possible for scientists everywhere to learn about black holes and dark matter. During her space station expedition, Coleman was the Lead Robotics and Lead Science officer, performing hundreds of science experiments and the second-ever robotic capture of a supply ship from the station. During her ISS mission, she and her crew coached actress Sandra Bullock in preparation for Bullock&#39;s role in the movie <em>Gravity<\/em>.&nbsp;&nbsp;<\/p><p>On the ground at NASA, Coleman served in a variety of roles within the Astronaut Office, including Chief of Robotics, lead for tile repair efforts after the Columbia accident, and, most notably, the lead astronaut for the integration of supply ships. She paved the way for commercial spaceflight collaborations that are now commonplace.&nbsp;<\/p><p>Before retiring from NASA, Coleman led open-innovation and public-private partnership efforts for the Office of the Chief Technologist at NASA Headquarters. As a volunteer test subject for the US Air Force centrifuge program, she set several human endurance\/tolerance records while performing physiological and new equipment studies.<\/p><p>In addition to her role as University Explorer at ASU, Coleman is a research affiliate at the MIT Media Lab. She serves on several boards, including the Smithsonian National Museum of Natural History, Earthrise Alliance, Dent the Future, Skycatch and Greenfield Community College.<\/p><p>Coleman earned a BS in chemistry from MIT in 1983 and a Ph.D. from the University of Massachusetts in 1991. She is married to glass artist Josh Simpson, has two sons, Josiah and Jamey, and calls Shelburne Falls, Massachusetts her home. In their spare time, Coleman and Josh share a love of flying, diving and the exploration of new worlds right here on earth.<\/p>","slug":"cady_coleman","published_at":"2019-04-13 04:47:00","updated_at":"2019-11-13 16:07:42"}}