{"speaker":{"id":5281,"title":"","firstname":"Yeonmi","middleinitial":"","lastname":"Park","description":"Human rights activist ","whotheyare":"North Korean defector Yeonmi Park is becoming a leading voice of oppressed people around the world through her writing, speaking and work as a director at the Human Rights Foundation.","whylisten":"<p>Yeonmi Park&#39;s escape from North Korea has given the world a window into the lives of its people. At the 2014 Oslo Freedom Forum and the One Young World Summit in Dublin, Park became an international phenomenon, delivering passionate and deeply personal speeches about the brutality of the North Korean regime. Her address to One Young World on the horrors of detention camps, political executions and sex trafficking has been viewed over 320 million times on YouTube. The BBC named her one of their &quot;Top Global Women.&quot;<\/p><p>In 2017, Park joined the Tory Burch Foundation&#39;s Embrace Ambition campaign, a global effort to dispel the double standard of ambition as a positive trait in men and a negative trait in women. Her searing memoir,&nbsp;<a href=\"https:\/\/www.amazon.com\/Order-Live-Korean-Journey-Freedom\/dp\/014310974X\/\" target=\"_blank\"><em>In Order to Live: A North Korean Girl&#39;s Journey to Freedom<\/em><\/a>, was released in the fall 2015, and now she&#39;s urging the world to recognize the oppressed people of Kim Jong-Un&#39;s reign. She believes that change will come through young people like herself, whose exposure to capitalism and Western media is eroding the authority of the Kim dynasty.<\/p><p>Currently a student at Columbia University, Park has published an op-ed about North Korea&#39;s &quot;black market generation&rdquo; in the <em>Washington Post<\/em>&nbsp;and has been featured on CNN, CNBC and the BBC, as well as in the <em>New York Times<\/em> and <em>Wall Street Journal<\/em>. She serves on the executive board of directors of the Human Rights Foundation, the world&#39;s preeminent organization devoted to disrupting dictatorships.<\/p>","slug":"yeonmi_park","published_at":"2019-04-19 14:51:00","updated_at":"2019-09-19 14:49:19"}}