{"speaker":{"id":5301,"title":"","firstname":"Heidi","middleinitial":"","lastname":"Boisvert","description":"Artist and creative technologist","whotheyare":"Heidi Boisvert harnesses the power of popular culture, emerging technology and neuroscience to ignite culture change.","whylisten":"<p>Heidi Boisvert is an interdisciplinary artist, experience designer, creative technologist and academic researcher who interrogates the neurobiological and socio-cultural effects of media and technology.\u2028 Simply put, she studies the role of the body, the senses and emotion in human perception and social change.<\/p><p>Boisvert is currently mapping the world&#39;s first media genome, while taking great care with its far-reaching ethical implications.\u2028 She founded futurePerfect lab, a creative agency and think-tank that works with social justice organizations to design playful emerging media campaigns to transform the public imagination. She also co-founded XTH, a company creating novel modes of expression through biotechnology and the human body. Presently, she is working with David Byrne on Theater of the Mind, a new immersive theater piece to debut in August 2020.<\/p><p>Boisvert, who holds a Ph.D. in Electronic Arts from Rensselaer Polytechnic Institute, is the Director of Emerging Media Technology at City University of New York, where she teaches. She is also a Senior Research Fellow at the Norman Lear Center (based at the University of Southern California&rsquo;s Annenberg School for Communication), a research affiliate in the Open Documentary Lab at the Massachusetts Institute of Technology and a member of NEW INC, the cultural incubator at The New Museum of Contemporary Art. She serves on the advisory board of American Documentary POV Spark and was selected by ZERO1 and the U.S. Department of State&#39;s Bureau of Educational and Cultural Affairs to represent the United States in Turkey.<\/p>","slug":"heidi_boisvert","published_at":"2019-05-08 19:11:00","updated_at":"2019-12-02 20:55:34"}}