{"speaker":{"id":5305,"title":"","firstname":"Mohammad","middleinitial":"","lastname":"Modarres","description":"Social entrepreneur","whotheyare":"Mohammad Modarres developed the first-ever Zabihah Halal and Glatt Kosher \"Interfaith Meat\" to make faith-based foods more accessible.  ","whylisten":"<p>As the founder of Abe&#39;s Eats, Mohammad Modarres&nbsp;is working to create a more inclusive and equitable food system for all. With past lives as the cofounder of a biotech company, award-winning political cartoonist and creative strategist for nonprofits and public companies alike, he&#39;s always sought to produce products and programs that break barriers and bring people together. Today, he&nbsp;uses the power of food to foster interfaith unity and inclusivity by making the growing need for faith-based (religious) Halal and Kosher foods more accessible and more inclusive.<\/p><p>A public health practitioner by training, Modarres&nbsp;entered the food world by accident when he produced the first two-in-one &quot;Interfaith Meat&quot; that is both (Zabihah) Halal and (Glatt) Kosher. The product was made for his &quot;Shabbat Salaam&quot; dinner, which was meant to bring friends together to foster community as a response to the rising wave of anti-Semitic and anti-Muslim bigotry after the 2016 US election cycle. In just over a year, more than 1,000 attendees have participated in Shabbat Salaam, while Interfaith Meat helps early adopters save on time, money and inventory space and reduce food waste.<\/p><p>Through the TED Residency program, Modarres&nbsp;incubated Abe&rsquo;s Eats, a food brand that offers Interfaith Meat and other food products. In his journey to produce Interfaith Meat, he has worked with food experts and religious leaders, given talks on regenerative agriculture and its impact on carbon soil and now promotes food production that benefits the local American rancher and farmer.<\/p>","slug":"mohammad_modarres","published_at":"2019-05-08 19:13:00","updated_at":"2019-10-01 16:11:33"}}