{"speaker":{"id":5311,"title":"","firstname":"Britt","middleinitial":"","lastname":"Wray","description":"Science storyteller, author, broadcaster","whotheyare":"Britt Wray's work is about life and what we make of it: past, present and future. ","whylisten":"<p>Author of the book&nbsp;<a href=\"https:\/\/www.amazon.com\/Rise-Necrofauna-Science-Ethics-Extinction-dp-1771644729\/dp\/1771644729\/\" target=\"_blank\"><em>Rise of the Necrofauna<\/em><\/a>, cohost of the BBC podcast&nbsp;<a href=\"https:\/\/www.bbc.co.uk\/programmes\/p009fksm\" target=\"_blank\"><em>Tomorrow&#39;s World<\/em><\/a>&nbsp;and guest host on Canada&#39;s legendary national science TV show&nbsp;<a href=\"https:\/\/www.cbc.ca\/natureofthings\/\" target=\"_blank\"><em>The Nature of Things<\/em><\/a>, Britt Wray shows audiences what&#39;s happening at the forefront of science, technology, ethics and environment, probing how it affects us. <em>The New Yorker<\/em> named her first book <em>Rise of the Necrofauna: The Science, Ethics, and Risks of De-Extinction<\/em> one of the &quot;books we loved&quot; in 2017 and the <em>Sunday Times<\/em> called it a &quot;must-read.&quot; By making science accessible and illuminating its possible consequences, Wray&#39;s writing, broadcasting and talks help us understand how the world is changing, creating a rich space for conversation about how each of us can respond to those changes.<\/p><p>Wray has been a summer host on CBC Radio 1&#39;s flagship science show <em>Quirks and Quarks<\/em>, and produced several radio documentaries for outlets such as BBC Radio 4, CBC IDEAS, WNYC&#39;s Studio 360 and <em>Love and Radio<\/em>. She created the interactive audio diary platform for frank speech about science called Aurator (aurator.org) which won the 2018 Society for the Social Studies of Science Award. Wray has a PhD in science communication with a focus on synthetic biology from the University of Copenhagen and holds a BSc (Hon) in biology from Queen&#39;s University and an interdisciplinary master&#39;s in art, media and design from OCAD University. She has also been a visiting scholar at the NYU Arthur L. Carter Institute for Journalism and was a 2019 TED Resident. Wray is currently writing a book about intimate dilemmas in the climate crisis.<\/p>","slug":"britt_wray","published_at":"2019-05-08 19:16:00","updated_at":"2019-08-27 14:41:44"}}