{"speaker":{"id":5378,"title":"","firstname":"Bob","middleinitial":"","lastname":"Langert","description":"Corporate sustainability expert","whotheyare":"Bob Langert consults, writes and speaks about corporate sustainability, showing how companies can successfully navigate and manage today’s controversial societal issues, become better corporate citizens and make their businesses stronger, more relevant and more profitable.","whylisten":"<p>As VP of sustainability at McDonald&#39;s, Bob Langert shaped the restaurant chain&#39;s commitment to the environment, supply chain sustainability and balanced menu choices. After retiring from McDonald&#39;s in 2015, Langert joined the GreenBiz Group, writing a regular column (&quot;The Inside View&quot;). He has advised several organizations on sustainability strategies, including the National Pork Council, Big Dutchman, Cadbury, Shell and Corteva. He is a popular speaker who has addressed audiences that include the Sustainable Agricultural Alliance, the United Egg Producers and the American Feed Industry Association.<\/p><p>In January 2019, Langert published&nbsp;<a href=\"https:\/\/geni.us\/ylWx5\" target=\"_blank\"><em>The Battle to Do Good; Inside McDonald&#39;s Sustainability Journey<\/em><\/a>. Based&nbsp;on his 25 years leading McDonald&#39;s sustainability and corporate responsibility efforts, Langert shares how he helped address some of the most significant societal issues of our times -- obesity, waste and packaging, deforestation in the Amazon, animal well-being and much more.&nbsp;<em>The Economist<\/em> wrote: &quot;<em>The Battle to Do Good: Inside McDonald&#39;s Sustainability Journey<\/em> is a must-read even for those who are cynical about the business of corporate social responsibility.&quot;<\/p><p>From the late 80s, McDonald&#39;s landed smack in the middle of one contentious issue after another, often locking horns with powerful NGOs such as Greenpeace, People for the Ethical Treatment of Animals and Corporate Accountability. This sudden shift from being the beloved Golden Arches since opening its doors in 1955, to the demon of many societal ills, caught McDonald&#39;s off guard. Langert chronicles the highs and lows that McDonald&#39;s experienced in turbulent times and how its sustainability journey evolved from playing defense to strategically solving issues with unlikely partners, including a whirling dervish, autistic animal scientist and avid environmentalists from the World Wildlife Fund and Conservation International.&nbsp;<\/p>","slug":"bob_langert","published_at":"2019-05-29 21:09:00","updated_at":"2019-10-29 15:31:10"}}