{"speaker":{"id":5399,"title":"","firstname":"Lynn","middleinitial":"","lastname":"Rothschild","description":"Astrobiologist, synthetic biologist","whotheyare":"Lynn Rothschild is passionate about the origin and evolution of life on earth or elsewhere -- while at the same time pioneering the use of synthetic biology to enable space exploration.","whylisten":"<p>Lynn Rothschild wears several hats as a senior scientist NASA&#39;s Ames Research Center and Bio and Bio-Inspired Technologies, Research and Technology Lead for NASA Headquarters Space Technology Mission Directorate, as well as Adjunct Professor at Brown University. Her research has focused on how life, particularly microbes, has evolved in the context of the physical environment, both here and potentially elsewhere.<\/p><p>More recently Rothschild has brought her imagination and creativity to the burgeoning field of synthetic biology, articulating a vision for the future of synthetic biology as an enabling technology for NASA&#39;s missions, including human space exploration and astrobiology. Since 2011 she has served as the faculty advisor of the award-winning Stanford-Brown iGEM (international Genetically Engineered Machine Competition) team, which has pioneered the use of synthetic biology to accomplish NASA&#39;s missions, particularly focusing on the human settlement of Mars, astrobiology and such innovative technologies as BioWires and making a biodegradable UAS (drone) and a bioballoon. Her lab is testing these plans in space on in the PowerCell synthetic biology secondary payload on a DLR satellite, EuCROPIS, launched in December 2018.<\/p><p>Rothschild is a fellow of the Linnean Society of London, The California Academy of Sciences and the Explorer&rsquo;s Club. In 2015, she was awarded the Isaac Asimov Award from the American Humanist Associatio and was the recipient of the Horace Mann Award from Brown University, and she has been a NASA Innovative Advanced Concepts (NIAC) fellow three times, most recently in 2018.<\/p>","slug":"lynn_rothschild","published_at":"2019-05-31 21:05:00","updated_at":"2019-06-20 14:24:21"}}