{"speaker":{"id":54,"title":"","firstname":"Cameron","middleinitial":"","lastname":"Sinclair","description":"Co-founder, Architecture for Humanity","whotheyare":"2006 TED Prize winner Cameron Sinclair is co-founder of Architecture for Humanity, a nonprofit that seeks architecture solutions to global crises -- and acts as a conduit between the design community and the world's humanitarian needs.","whylisten":"<p>After training as an architect, Cameron Sinclair (then age 24) joined Kate Stohr to found <a href=\"http:\/\/www.architectureforhumanity.org\/\" target=\"_blank\">Architecture for Humanity<\/a>, a nonprofit that helps architects apply their skills to humanitarian efforts. Starting with just $700 and a simple web site in 1999, <a href=\"http:\/\/www.architectureforhumanity.org\/\" target=\"_blank\">AFH<\/a>  has grown into an international hub for humanitarian design, offering <strong>innovative solutions to housing problems in all corners of the globe<\/strong>. <br \/><br \/>Whether rebuilding earthquake-ravaged Bam in Iran, designing a soccer field doubling as an HIV\/AIDS clinic in Africa, housing refugees on the Afghan border, or helping Katrina victims rebuild, <a href=\"http:\/\/www.architectureforhumanity.org\/\" target=\"_blank\">Architecture for Humanity<\/a>  works by Sinclair&#39;s mantra: &quot;<strong>Design like you give a damn<\/strong>.&quot; (Sinclair and Stohr cowrote <a href=\"http:\/\/geni.us\/giveadamndesign\" target=\"_blank\">a book<\/a>  by the same name, released in 2006.) <br \/><br \/>A regular contributor to the sustainability blog <a href=\"http:\/\/www.worldchanging.com\/\" target=\"_blank\">Worldchanging.com<\/a>, Sinclair is now working on the <a href=\"http:\/\/www.openarchitecturenetwork.org\/\" target=\"_blank\">Open Architecture Network<\/a>, born from the wish he made when he accepted the <a href=\"\/pages\/view\/id\/108\" target=\"_blank\">2006 TED Prize<\/a>: to build <strong>a global, open-source network where architects, governments and NGOs can share and implement design plans<\/strong> to house the world.<\/p>","slug":"cameron_sinclair","published_at":"2007-02-17 16:45:00","updated_at":"2015-07-13 18:22:58"}}