{"speaker":{"id":5463,"title":"","firstname":"Melanie","middleinitial":"","lastname":"Nezer","description":"Refugee and immigrants rights attorney","whotheyare":"Melanie Nezer is a national leader in efforts to inform and educate individuals, institutions, elected officials and communities about refugees and asylum seekers.","whylisten":"<p>Melanie Nezer is Senior Vice President for Public Affairs for HIAS, the American Jewish community&#39;s international refugee agency. Founded in 1881, HIAS is the oldest refugee agency in the world and has helped refugees from all over the world find safety and freedom. In 17 years at HIAS, Nezer&nbsp;has shaped much of the agency&#39;s policy and advocacy agenda and its legal work. She previously served as HIAS&#39;s Vice President for Policy and Advocacy, as Migration Policy Counsel and as Director of HIAS&#39;s Employment Visa Program, representing at-risk Jewish professionals and religious workers seeking to work in the US during times of instability and crisis in their home countries.<\/p><p>Before joining HIAS, Nezer&nbsp;was the Immigration Policy Director for the organization now known as US Committee for Refugees and Immigrants, where -- in addition to conducting advocacy on immigration and asylum issues -- she was co-editor of Refugee Reports and a writer for the annual World Refugee Survey. Prior to her work in Washington DC, Nezer&nbsp;was in private legal practice in Miami, Florida, where she specialized in immigration law and criminal defense.<\/p><p>Learn more about Nezer&#39;s work by watching &quot;<a href=\"https:\/\/elitalks.org\/melanie\" target=\"_blank\">The Ground Beneath My Children&#39;s Feet: Refugees and the Jewish Story<\/a>,&quot;&nbsp;&quot;<a href=\"https:\/\/www.youtube.com\/watch?v=ctiwQ71KsVc\" target=\"_blank\">&#39;We Stand with You&#39;&quot;: HIAS Responds to Synagogue Massacre with Message of Hope for Refugees<\/a>,&quot; by listening to &quot;<a href=\"https:\/\/www.wnyc.org\/story\/hias-responds-deadly-attack-pittsburgh-synagogue\/\" target=\"_blank\">HIAS Responds to Deadly Attack on Pittsburgh Synagogue<\/a>,&quot; and by reading &quot;<a href=\"https:\/\/jewishjournal.com\/news\/nation\/214201\/refugee-order-demystified-q-melanie-nezer-hias\/\" target=\"_blank\">Refugee Order Demystified, Q&amp;A with Nezer of HIAS<\/a>,&quot; and &quot;<a href=\"https:\/\/qz.com\/536886\/the-global-plan-for-dealing-with-refugees-isnt-broken-its-nearly-broke\/\" target=\"_blank\">The Global Plan for Dealing with Refugees Isn&#39;t Broken, It&#39;s Nearly Broke.<\/a>&quot;<\/p>","slug":"melanie_nezer","published_at":"2019-07-09 01:43:00","updated_at":"2019-07-16 16:49:16"}}