{"speaker":{"id":5484,"title":"","firstname":"Dessa","middleinitial":"","lastname":"","description":"Rapper, singer and writer","whotheyare":"Dessa is an internationally touring rapper, singer and writer who built a career by defying genre conventions and audience expectations.","whylisten":"<p>As a writer, Dessa has contributed to the<em> New York Times<\/em>, <em>National Geographic Traveler <\/em>and literary journals across the United States. As a musician, she&#39;s recorded critically acclaimed studio albums,&nbsp;co-composed for a 100-voice choir, collaborated with full orchestras and contributed to <em>The Hamilton Mixtape <\/em>on the invitation of Lin-Manuel Miranda.&nbsp;<\/p><p>On stage and on the page, Dessa&#39;s work is driven by an interest in finding unexpected connections -- between heartache and neuroscience, aerodynamics and grief, or simply between two people who live far away and in disparate circumstances. Her delivery is crafted to balance wit and tenderness, intellectual rigor and a poetic sensibility.&nbsp;&nbsp;<\/p><p>Dessa started out in Minneapolis, Minnesota as a member of the Doomtree hip-hop crew, a tight-knit group known for their explosive live shows, innovative sound and fiercely independent business model. For years, the seven-member crew shared stages, hotel rooms and head colds building an international following one sweaty show at a time. Dessa&#39;s work within the collective and as a solo artist earned several entries on the Billboard Top 200 charts (<em>Chime<\/em>, <em>Parts of Speech<\/em> and <em>All Hands<\/em>). Alone or with Doomtree, she&#39;s performed at Lollapalooza, Glastonbury, SXSW, velvet-lined theaters in LA and New York, punk venues in Central Europe, black box rooms from Tijuana to Beijing and once while standing on a wooden chair in South Africa. According to the&nbsp;<em>LA Times<\/em>, Dessa&nbsp;&quot;sounds like no one else&quot; and was called &quot;a national treasure&quot; by NPR&#39;s&nbsp;<em>All Songs Considered.<\/em><\/p><p>Since her teenage years, however, Dessa wanted to become a published writer. So while recording and touring as a musician, she continued to write poetry, essays and short stories. Under the Doomtree banner, she began printing short books, some barely larger than a matchbook. In 2013, Doomtree Press published <em>Spiral Bound<\/em>, a collection of poetry and prose. In 2015, Dessa partnered with Rain Taxi on a poetry chapbook titled<em> A Pound of Steam<\/em>. On the strength of that collection, a New York literary agent telephoned; within a few years, Dutton Books (Penguin Random House) published her first book-length collection of essays, <em>My Own Devices: True Stories from the Road on Music, Science, and Senseless Love<\/em>, named one of the best books of 2018 by both NPR and Amazon. She also became a frequent radio contributor: on behalf of Minnesota Public Radio, she&#39;s interviewed best-selling authors in front of live audiences (most recently talking with Michael Pollan about his exploration into psychedelic drugs). At WNYC&#39;s The Greene Space, she served as Artist in Residence, designing a series called HEARTBREAKERS that investigated research on love, sex and determinism with both scientists and musicians.&nbsp;&nbsp;<\/p><p>In recent years, Dessa partnered with the Grammy-winning Minnesota Orchestra to stage six sold-out performances at Minneapolis&#39;s Orchestra Hall (all arranged by composer\/musician Andy Thompson and conducted by Sarah Hicks). The Minnesota Orchestra and Dessa cut a live record together in March of 2019,&nbsp;<em>Sound the Bells: Recorded Live at Orchestra Hall<\/em>,&nbsp;slated for release in November of 2019.<\/p>","slug":"dessa","published_at":"2019-08-20 00:47:00","updated_at":"2019-08-29 14:53:17"}}