{"speaker":{"id":5487,"title":"","firstname":"Erika","middleinitial":"","lastname":"Pinheiro","description":"Immigration attorney","whotheyare":"Erika Pinheiro fights to protect migrant rights and reunify families. She leads non-profits whose projects have helped thousands of immigrants on both sides of the US-Mexico border.","whylisten":"<p>As Litigation and Policy Director of the direct legal services non-profit&nbsp;<a href=\"https:\/\/alotrolado.org\/\" target=\"_blank\">Al Otro Lado<\/a>, Erika Pinheiro leads her organization&#39;s efforts in filing class action lawsuits challenging the Trump administration&#39;s attacks on the US asylum system, as well as slave labor practices and severe medical neglect in immigration detention facilities. Her team has reunified dozens of separated families, including parents who were deported without their children, and has freed dozens of asylum seekers detained at the border. Before joining Al Otro Lado, Pinheiro administered one of the largest DACA programs in California, as well as representation programs for Unaccompanied Children. She also oversaw high-volume Legal Orientation Programs for adults and children detained in immigration prisons.<\/p><p>Pinheiro&#39;s work on behalf of unaccompanied children, refugee families and vulnerable detained migrants is&nbsp;<a href=\"https:\/\/docs.google.com\/spreadsheets\/d\/e\/2PACX-1vS4lL0WyZ3gVtDq6HrNQmZI0yt_LR1s1xvLdEYNsrsRXhjGTZ-T-ODRLxYcby-SiZH4jIa-WL6LknWh\/pubhtml\" target=\"_blank\">frequently featured<\/a> in national and international media outlets. She also provides on-the-ground context regarding US border policies to policy makers, including state Attorneys General, members of the US Congress and California elected officials. She has also provided technical assistance and numerous trainings regarding immigration law and policy to attorneys, the California State Bar, Federal Public Defender offices and Los Angeles County agencies.<\/p><p>Pinheiro holds both a JD and MPP from Georgetown University and is trained in econometric analysis of immigration policy. Her thesis analyzed the intersection between immigration enforcement by local police and crime.&nbsp;<\/p><div><br \/><\/div>","slug":"erika_pinheiro","published_at":"2019-08-27 17:49:00","updated_at":"2019-11-14 15:35:52"}}