{"speaker":{"id":55,"title":"","firstname":"Jehane","middleinitial":"","lastname":"Noujaim","description":"Filmmaker","whotheyare":"TED Prize winner Jehane Noujaim is a gutsy filmmaker whose astonishing documentaries reveal the triumphs and hardships of courageous individuals. ","whylisten":"<p>Two weeks before the US invaded Iraq in 2003, Jehane Noujaim gained access to both <a href=\"http:\/\/www.aljazeera.com\/\" target=\"_blank\">Al Jazeera<\/a>  and the US military&#39;s Central Command offices in Qatar. By being in the right place at that very wrong time, she caught the onset and outbreak of the Iraq war on film. The resulting documentary, <a href=\"http:\/\/www.noujaimfilms.com\/\" target=\"_blank\"><em>Control Room<\/em> (2004)<\/a>, exposed the very divergent ways the Middle East and the West covered the war. Since then, Noujaim has continued to document the Middle East, lending a personal eye to the world&#39;s most startling current events. Her film&nbsp;<em><a href=\"http:\/\/blog.ted.com\/revolution-in-the-square-qa-with-jehane-noujaim\/\" target=\"_blank\">The Square<\/a><\/em><a href=\"http:\/\/blog.ted.com\/revolution-in-the-square-qa-with-jehane-noujaim\/\" target=\"_blank\"> (2013)<\/a>, which premiered at Sundance and was shown on Netflix, give viewers an intimate look at the personal stories and cultural complexities of the 2011 Egyptian revolution.<\/p><p>Raised between Egypt and the US, the exploration of culture is one of Jehane&#39;s driving forces. So is creating empathy and compassion through film. With the 2006 TED Prize, Noujaim wished for&nbsp;<a href=\"\/participate\/ted-prize\/prize-winning-wishes\/pangea-day\" target=\"_blank\">Pangea Day<\/a>, a moment for people around the world come together to watch films and understand one another through their magic. Pangea Day took place in May 2008 and united people across 100 cities and online through a worldwide festival of film, music, art, performance and speakers.<\/p>","slug":"jehane_noujaim","published_at":"2007-02-17 16:54:00","updated_at":"2017-06-27 19:34:59"}}