{"speaker":{"id":5547,"title":"","firstname":"Alejandro","middleinitial":"","lastname":"Durán","description":"Multimedia artist","whotheyare":"Alejandro Durán collects the international trash washing up on the Caribbean coast of Mexico, transforming it into aesthetic yet disquieting artworks that wake us up to the threat of plastic pollution.","whylisten":"<div>Through photography, installation and video, Alejandro Dur&aacute;n&#39;s&nbsp;work examines the fraught intersections of man and nature, revealing the pervasive impact of consumer culture on the natural world. He also engages audiences through environmental, community-based art-making and speaking engagements. Some of his work coalesced in his outdoor exhibition &quot;The Museum of Garbage,&quot; which showcased the photographs and installations from his project &quot;Washed Up: Transforming a Trashed Landscape.&quot;<\/div><div><br \/><\/div><div>Born in Mexico City in 1974, Dur&aacute;n is now based between Brooklyn, New York and Sian Ka&rsquo;an, M&eacute;xico where he continues to gather trash for the &quot;Washed Up&quot; project. He received an MA in teaching from Tufts University and an MFA in poetry from the New School for Social Research. As an educator, Dur&aacute;n has taught youth and adult classes in photography and video at The Museum of Modern Art and The International Center of Photography. His media production company, Luma Projects, includes clients such as MoMA, Microsoft, UNICEF and the Stone Barns Center for Food and Agriculture.<\/div><div><br \/><\/div><div>Dur&aacute;n received a 2019 Creative Capital Award, Art With Me Tulum&rsquo;s Social Impact Award 2018 and was Hunter College&rsquo;s artist-in-residence in 2014-15. His work has been featured at the Mt. Rokko International Photography Festival in Japan, the Fotografie Forum in Germany and Basta con la Plastica, Italy&rsquo;s first Ocean Awareness Week. &quot;Washed Up&quot; has been published in&nbsp;<a href=\"https:\/\/www.nationalgeographic.com\/photography\/proof\/2016\/06\/an-oceans-trash-is-an-artists-treasure\/#close\" target=\"_blank\"><em>National Geographic<\/em><\/a>,&nbsp;<em><a href=\"https:\/\/time.com\/4358434\/world-oceans-day-art-marine-plastic\/\" target=\"_blank\">Time<\/a>&nbsp;<\/em>and&nbsp;<a href=\"https:\/\/www.huffpost.com\/entry\/alejandro-duran-trash-sian-kaan_n_7103584\" target=\"_blank\">The Huffington Post<\/a>, as well as in the books <em>Art &amp; Ecology Now<\/em>, <em>Unexpected Art<\/em> and <em>Photo Viz<\/em>, among others.<\/div>","slug":"alejandro_duran","published_at":"2019-09-13 21:32:00","updated_at":"2020-01-23 20:00:03"}}