{"speaker":{"id":5549,"title":"","firstname":"Bright","middleinitial":"","lastname":"Simons","description":"Entrepreneur ","whotheyare":"Bright Simons is a technology thinker, social innovator and \"ideas activist.\"","whylisten":"<p>As president of&nbsp;<a href=\"\/admin.php\/speakers\/edit\/speakerid\/www.mpedigree.com\" target=\"_blank\">mPedigree<\/a>, Bright Simons has worked for more than a decade across three continents to promote solutions to the fraud, counterfeiting and corruption crisis in global health and food security, as well as other transparency and governance domains. He bridges grassroots invention with the industrial scale of the Fortune 100 and combines patent-pending work in smart sensors for bio-med cold chains with civic reform activism.<\/p><p>&nbsp;<br \/>Simons writes periodically for the likes of <em>Harvard Business Review<\/em>, <em>Quartz<\/em>, the BBC&#39;s <em>Business Daily Show<\/em> and The&nbsp;Huffington Post. He has served as a board-level advisor to Care International, the Africa Population Health Research Center, Microsoft Africa Advisory Council, RED Media, the Lancet Commission on the Future of Health in Africa, the Center for Global Development&#39;s Study Group on Technology, the World Economic Forum&#39;s Africa Strategy Group, IMANI Center for Policy &amp; Education and the inaugural Ashoka Globalizer initiative, among others.&nbsp;<\/p><p>Simons consistently connects powerful action on the periphery with forceful advocacy in the halls of global thought leadership. For this commitment, he has been recognised in <em>MIT&#39;s Tech Review<\/em> list of &quot;35 Innovators Under 35&quot; as one of the most impressive global technology visionaries, <em>Quartz<\/em>&rsquo;s top 30 innovators list; and was the 2016 CNBC All-Africa Business Leader of the Year (for innovation). Furthermore, in 2016, <em>Fortune <\/em>magazine named him on their &quot;The World&rsquo;s 50 Greatest Leaders&quot; list in 2016.&nbsp;&nbsp;<\/p>","slug":"bright_simons","published_at":"2019-09-13 21:33:00","updated_at":"2019-12-12 19:30:43"}}