{"speaker":{"id":5588,"title":"","firstname":"Priti","middleinitial":"","lastname":"Krishtel","description":"Health justice advocate","whotheyare":"Priti Krishtel wants to reinvent the patent system. A lawyer and veteran of the global access to medicines movement, she is exposing how the failures of the patent system are affecting all of us -- and how we can fix it.","whylisten":"<p>As a young lawyer working with low-income communities in India in the early 2000s, Priti Krishtel had an epiphany. Many of her clients were struggling and even dying, because they couldn&#39;t afford the lifesaving medicines they needed. When Krishtel looked more closely at patent systems, she discovered a pattern of behavior in which corporations were incentivized to seek as many patents as possible on a single medicine. These &quot;patent walls&quot; prolonged monopolies and blocked access to medicines. As the human toll of the global HIV\/AIDS epidemic reached its peak, Krishtel helped lead a successful grassroots movement pressing the Indian government to pass a first-of-its-kind, health-friendly patent law.<\/p><p>That momentous win inspired her to co-found&nbsp;<a href=\"https:\/\/www.i-mak.org\/\" target=\"_blank\">I-MAK<\/a>, a team of &quot;patent detectives&quot; who expose and challenge manipulation of the patent system that fuels high drug prices. Since then, Krishtel and I-MAK have expanded their work to nearly 50 countries, saving health systems over 2 billion dollars and increasing access to treatment for millions of people.&nbsp;<\/p><p>The U.S. is the latest -- and most challenging -- front for Krishtel&#39;s work. She is now working to crack open the black box that is the U.S. patent office and helping Americans understand how intimately patent decisions affect their lives. In 2018, her team published a&nbsp;<a href=\"https:\/\/www.i-mak.org\/overpatented\/\" target=\"_blank\">groundbreaking investigative series<\/a>&nbsp;exposing the scale of patent abuse in the U.S., which was cited extensively in media and congressional hearings on the topic. As medicine and technology increasingly intersect, Krishtel is leading the charge to democratize the patent system and make it more accountable to the public. Krishtel envisions a future in which people can actively participate in decisions that impact their health and the health of their loved ones.<\/p>","slug":"priti_krishtel","published_at":"2019-10-03 17:13:00","updated_at":"2020-01-15 20:52:52"}}