{"speaker":{"id":5589,"title":"","firstname":"Chris","middleinitial":"","lastname":"Fisher","description":"Archaeologist and founder of the Earth Archive","whotheyare":"Chris Fisher’s research focuses on unraveling the complex relationship that links humans to their past and present environments.","whylisten":"<div>Christopher T. Fisher, PhD, is an archaeologist, professor of anthropology at Colorado State University, a National Geographic Explorer and the founder of the Earth Archive.&nbsp;<\/div><div>&nbsp;<\/div><div>He views archaeology as a &lsquo;future building&rsquo; endeavor that takes what it learns about the past and projects this knowledge into the future for scientists, policy makers and lay-people. His ultimate goal is for everyone to understand that archaeology is a vital part of a successful 21st Century.<\/div><div><br \/><\/div><div>Since the early 1990&rsquo;s Dr. Fisher&rsquo;s research has centered on unraveling the complex set of social and environmental variables that resulted in the formation of the Late Postclassic (CE 1350-1520) Pur&eacute;pecha (Tarascan) Empire located in the Lake P&aacute;tzcuaro Basin, Michoac&aacute;n, Mexico. During the course of this work in 2007, he and his team first documented an ancient city which they now call Angamuco. Work at Angamuco is on-going.<\/div><div><br \/><\/div><div>To better characterize this new urban center they turned to LiDAR -- a technique that creates a 3D map of the ground surface -- to better understand this new urban center. The resulting data, new kinds of analysis, and sophisticated understanding of this place changed the course of his career. Initial survey and analysis was followed by two years of excavation and survey. The analysis of this work and materials is on-going.<\/div><div><br \/><\/div><div>In 2012, a pair of documentary filmmakers (Steve Elkins and Bill Benenson) contacted Fisher and his team to see if they could better analyze newly acquired LiDAR for the Mosquitia region of Honduras. Ground verification of one of these settlements in 2015, now called the City of the Jaguar,&nbsp; resulted in the discovery of a cache of artifacts left at the center of the city as an offering when the city was abandoned. This expedition was covered in the October 2015 issue of <em>National Geographic<\/em> and is covered in the book <em>Lost City of the Monkey God: A True Story<\/em>. In 2016, with the support of National Geographic and the Honduran Government Chris returned to the City of the Jaguar for a month of excavation and conservation. The analysis of this work and materials is on-going.<\/div><div><br \/><\/div><div>His work appears in many professional venues including edited volumes, such as <em>Seeking a Richer Harvest: An Introduction to the Archaeology of Subsistence Intensification<\/em>, <em>Innovation, and Change<\/em>, <em>The Archaeology of Environmental Change: Socionatural Legacies of Degradation and Resilience<\/em>&nbsp;and journals such as the <em>Proceedings of the National Academy of Sciences<\/em>&nbsp;and the <em>American Anthropologist<\/em>. In addition his work has appeared in popular publications such as the <em>New Yorker<\/em>, <em>National Geographic<\/em>, and many other sources.<\/div><div><br \/><\/div><div>Fisher has conducted fieldwork and directed projects in several areas of the United States, Mexico, Honduras, Portugal, and Albania. His work is supported by the National Science Foundation, National Geographic, the Heinz Foundation, and private sources. In 2007 Fisher received the Gordon R. Willey Award from the American Anthropological Association.<\/div><div>&nbsp;<\/div><div>He earned a BA from Michigan State University and an MA and PhD from the University of Wisconsin-Madison.<\/div><div>&nbsp;<\/div>","slug":"chris_fisher","published_at":"2019-10-04 16:44:00","updated_at":"2020-08-10 18:01:09"}}