{"speaker":{"id":560,"title":"","firstname":"Shashi","middleinitial":"","lastname":"Tharoor","description":"Politician and writer","whotheyare":"After a long career at the UN, and a parallel life as a novelist, Shashi Tharoor became a member of India's Parliament. He spent 10 months as India's Minister for External Affairs, building connections between India and the world.","whylisten":"<p>In May 2009, Shashi Tharoor was elected to Parliament, representing the Thiruvananthapuram constituency in Kerala. For 10 months, he also served as Minister for External Affairs, charged with helping India <a href=\"http:\/\/www.telegraphindia.com\/1100509\/jsp\/frontpage\/story_12428739.jsp\" target=\"_blank\">engage with the world<\/a>. Follow him on Twitter, <a href=\"http:\/\/twitter.com\/ShashiTharoor\" target=\"_blank\">@shashitharoor<\/a>, or <a href=\"http:\/\/www.youtube.com\/user\/shashitharoor#p\/a\/u\/0\/s3o7cWm4XkM\" target=\"_blank\">his YouTube channel<\/a>, to get a look in at his whirlwind life of service.<\/p><p>Before entering politics, Tharoor spent almost three decades with the UN as a refugee worker and peace-keeper, working as a senior adviser to the Secretary-General. Meanwhile, he maintained a parallel career as a writer, producing three novels, a biography of Nehru and several collections of essays on literature and global affairs (plus hundreds of articles for magazines and journals). <strong>He was the UN Under-Secretary General for Communications and Public Information under Kofi Annan<\/strong>, and was India&#39;s candidate in 2006 for the post of Secretary-General. He left the UN in 2007. <\/p><p>His latest book is&nbsp;<a href=\"http:\/\/geni.us\/indianpakistancricket\" target=\"_blank\"><em>Shadows Across the Playing Field: 60 Years of India-Pakistan Cricket<\/em><\/a>, written with former Pakistan foreign secretary (and cricket legend) Shaharyar Khan.<\/p>","slug":"shashi_tharoor","published_at":"2009-11-30 00:30:00","updated_at":"2015-09-24 19:54:06"}}