{"speaker":{"id":5634,"title":"","firstname":"Kelsey","middleinitial":"","lastname":"Johnson","description":"Astrophysicist, writer, educator","whotheyare":"Kelsey Johnson has spent her life in awe of the universe, and she works to inspire that awe in future generations.","whylisten":"<p>Kelsey Johnson teaches students both inside and outside of the classroom, using astronomy as a &quot;gateway&quot; science to nurture curiosity and support science literacy.&nbsp;Raised by a single mom, Johnson spent countless nights outside under the stars, where she developed a love for &quot;big picture&quot; questions about the nature of reality and the universe. Influenced by her own experience, she founded the Dark Skies, Bright Kids program in 2009 to enhance science education in under-served areas.<\/p><p>Johnson&#39;s curiosity about the cosmos -- and everything in it -- has been the primary driver of her career, leading her to devote her life to learning, exploration and teaching. Her research has tackled questions ranging from &quot;How were the most ancient objects in the universe formed?&quot; to &quot;What can the smallest galaxies tell us about the evolution of the universe?&quot; She has also broken new ground teaching, developing nontraditional courses such as &quot;Unsolved Mysteries in the Universe&quot; and &quot;Math and Beauty in the Cosmos.&quot; Johnson is a professor at the University of Virginia and the president of the Astronomical Society of the Pacific.<\/p><p>In 2016, Johnson was appointed by the White House Office of Science and Technology Policy to the Astronomy and Astrophysics Advisory Committee, and in 2017 she was elected to the board of the American Astronomical Society. Her research has received awards including the NSF CAREER Award, a Packard Fellowship and an NSF Distinguished lectureship, as well as being a Kavli Frontiers of Science Fellow. Johnson has also won several teaching awards, and she was recently named as one of four &ldquo;ACC Distinguished Professors&rdquo; in the Atlantic Coast Conference of universities.&nbsp;She received an inaugural &quot;Public Service&quot; award from UVA for her work promoting science literacy<\/p><p>Johnson&#39;s writing has appeared in <em>Scientific American<\/em>, <em>Washington Post<\/em>, the <em>New York Times<\/em>, <em>Ms. Magazine<\/em>&nbsp;and <em>The Chronical of Higher Education<\/em>. She earned her BA in physics from Carleton College, and her MS and PhD in astrophysics from the University of Colorado. She lives in rural Virginia with her family, including three cats and two very large dogs.<\/p>","slug":"kelsey_johnson","published_at":"2019-10-24 15:55:00","updated_at":"2019-12-04 16:16:48"}}