{"speaker":{"id":5646,"title":"","firstname":"Norma","middleinitial":"","lastname":"Pimentel","description":"Religious leader","whotheyare":"Sister Norma Pimentel is a sister with the Missionaries of Jesus and a licensed professional counselor.","whylisten":"<p>As executive director of Catholic Charities of the Rio Grande Valley, Sister Norma Pimentel oversees the charitable arm of the Diocese of Brownsville, providing oversight of the different ministries and programs in the areas of emergency assistance, housing assistance, counseling and pregnancy care to all four counties in the Rio Grande Valley.<\/p><p>Pimentel chairs the local Emergency Food and Shelter Program that distributes federal funds to local agencies providing assistance to the area&#39;s poor. She also leads efforts in the community that respond to emergency needs and provide relief in times of disaster and crisis. She was instrumental in organizing community resources to respond to the surge of Central Americans seeking asylum in the United States and setting up Humanitarian Respite Centers in McAllen and Brownsville, Texas in June 2014. These efforts brought Pimentel&nbsp;recognition as a recipient of the 2015 Martin Luther King, Jr. &quot;Keep the Dream Alive&quot; award from Catholic Charities USA and a nomination for &quot;Texan of the Year.&quot;<\/p><p>In March 2015, Pimentel&nbsp;spoke at the UN Headquarters in New York City at the invitation of the Permanent Observer of the Holy See to the United Nations. During the US Papal visit, Pimentel&nbsp;met with Pope Francis in New York City and presented him with one of her original paintings of an immigrant mother and child. She was first introduced to Pope Francis in August 2015 via a &quot;virtual town hall&quot; arranged by ABC news, which later aired in a one-hour special edition of <em>20\/20.&nbsp;<\/em>In December 2015, Our Sunday Visitor named Pimentel&nbsp;as one of eight &quot;Catholics in the Year,&quot; awarded to &quot;men and women, religious and lay who made an indelible mark in 2015.&quot;<\/p><p>Before overseeing Catholic Charities of the Rio Grande Valley, Pimentel&nbsp;was one of the leaders who directed Casa Oscar Romero, a refugee shelter in San Benito and later Brownsville for Central Americans fleeing war-torn countries in the 1980s. The shelter provided emergency relief and temporary housing for hundreds of thousands of refugees. Pimentel&nbsp;received her bachelor&#39;s degree in fine arts from Pan American University in Edinburg, Texas; a master&#39;s degree in theology from St. Mary&#39;s University in San Antonio, Texas; a master&#39;s degree in counseling psychology from Loyola University in Chicago, IL; and an honorary PhD in humane letters from Holy Family University in Philadelphia, Pennsylvania.<\/p>","slug":"norma_pimentel","published_at":"2019-10-25 20:40:00","updated_at":"2020-04-29 21:31:02"}}