{"speaker":{"id":5691,"title":"","firstname":"Tom","middleinitial":"","lastname":"Rivett-Carnac","description":"Political strategist","whotheyare":"A political strategist focused on creating a better future, Tom Rivett-Carnac works at the highest levels of business and government to find creative ways to accelerate solutions to the climate crisis.","whylisten":"<p>We have just entered the most consequential decade in history. That fact is overwhelming for most of us, but the simple truth is that by 2030 we will have decided the future for the fate of this planet for at least the next several hundred years. We have left responding to the climate crisis so late that we cannot prevaricate further. We are about to find out if we are serious about dealing with the climate crisis or not.<\/p><p>Tom Rivett-Carnac thinks that how we show up, the attitude we bring to our lives, makes a profound difference to what will happen next, and to our chance of success. Far from cowering from the monumental nature of this moment, we should be riding out to meet it, full of the sense of purpose and intent that comes from living at the crossroads of one of the great transitions in human history. Living right now is a huge privilege, and we should have the confidence to embrace that. No future generation will have the luxury of being able to have such an impact on the future as we do at this precise moment. We cannot afford to feel powerless.<\/p><p>Rivett-Carnac has spent his career working on solutions to the climate crisis. He ran political strategy for the UN towards the Paris Agreement of 2015, widely regarded as one of the great achievements of global diplomacy. Since then he founded&nbsp;<a href=\"https:\/\/globaloptimism.com\/\" target=\"_blank\">Global Optimism<\/a>&nbsp;with&nbsp;<a href=\"https:\/\/www.ted.com\/speakers\/christiana_figueres\" target=\"_blank\">Christiana Figueres<\/a>,&nbsp;and from that platform he seeks to elevate and support individuals and entities that are delivering real change on the road to a regenerative future. He is an advisor at X (formerly Google X) and a founding partner at the Climate Pledge, in partnership with Amazon. He recently co-authored&nbsp;<a href=\"https:\/\/geni.us\/9pBIDYX\" target=\"_blank\"><em>The Future We Choose<\/em><\/a>&nbsp;and cohosts the weekly podcast&nbsp;<a href=\"https:\/\/globaloptimism.com\/podcast\/\" target=\"_blank\"><em>Outrage and Optimism<\/em><\/a>. Early in his career, he spent three years as a Buddhist monk in southeast Asia.<\/p>","slug":"tom_rivett_carnac","published_at":"2019-12-02 22:33:00","updated_at":"2020-04-28 14:20:49"}}