{"speaker":{"id":5695,"title":"","firstname":"Hiro","middleinitial":"","lastname":"Mizuno","description":"Financier, Former Executive Managing Director of Japan's Government Pension Investment Fund","whotheyare":"As chief investment officer of Japan's Government Pension Investment Fund, Hiro Mizuno led substantial transitions in the portfolio's asset allocation, marked by a strong environmental, social, and governance mentality.","whylisten":"<p>Hiro Mizuno is a Japanese financial executive and former executive management director and CIO of Government Pension Investment Fund (GPIF) of Japan where he managed USD 1.5 trillion assets between Jan 2015 and March 2020. At GPIF, he promoted and developed environmental, social and governance (ESG) investment for long-term and sustainable capital markets by establishing ESG related indices and green bond partnership initiatives. He also worked to promote the task force for climate-related financial disclosures (TCFD) enhancement by Paris Agreement of UNFCCC as an integral part of ESG initiatives.<\/p><p>Prior to joining GPIF, Mizuno was a partner of Coller Capital, a London-based private equity firm. He previously worked at Sumitomo Trust and Banking Co., Ltd. in Japan, Silicon Valley and New York.&nbsp;<\/p><p>Mizuno promotes long term investment in the following capacities: he is a member of the board of Principles for Responsible Investment (PRI) Association; a World Economic Forum (WEF) Global Future Council member; special adviser of Milken Institute&#39;s; CFA Institute Future of Finance Advisory Council member; One Planet Lab TCFD Work Stream cochair; a leader of The B Team; member of Global Business Coalition for Education Advisory board; and Guardian of the Coalition for Inclusive Capitalism at Vatican.<\/p><p>Mizuno advises Japanese governments in several capacities, including special advisor to Ministry of Economy, Trade and Industry (METI); Green Innovation and Finance Advisor; TCFD Summit Ambassador; executive adviser to Japanese Cabinet on Healthcare and Medical Growth Strategy; member of Japanese Government Strategic Funds Integrated Advisory Board; and member for Ministry of Education, Culture, Sports, Science and Technology-Japan National Universities Evaluation Committee.<\/p><p>Mizuno&#39;s engagements in academics include: advisor of Office of the President of the University of Tokyo and a guest professor at Osaka University Graduate School of Medicine; guest professor of Osaka University Graduate School of Medicine; executive in residence and Global Leadership Council member of Said Business School, Oxford University; executive fellow of Harvard Business School; visiting fellow of Cambridge Judge Business School, University of Cambridge; senior fellow of Tel Aviv University Graduate School of Management; member of the International Executive Committee for the Einstein Legacy Project at Hebrew University.<\/p>","slug":"hiro_mizuno","published_at":"2019-12-03 20:13:00","updated_at":"2020-07-08 16:40:27"}}