{"speaker":{"id":57,"title":"","firstname":"Robert","middleinitial":"","lastname":"Fischell","description":"Biomedical inventor","whotheyare":"Robert Fischell invented the rechargeable pacemaker, the implantable insulin pump, and devices that warn of epileptic seizures and heart attacks. Yet it's not just his inventive genius that makes him fascinating, but his determination to make the world a better place. ","whylisten":"<p>Robert Fischell began his work in space development, and created a 16-satellite system called <a href=\"http:\/\/www.fas.org\/spp\/military\/program\/nav\/transit.htm\" target=\"_blank\">Transit<\/a>  that was a key precursor to GPS. When he turned his attention to medical devices, he had the key insight that a pacemaker is like a tiny satellite within the body. <strong>The medical devices he has pioneered -- starting with a pacemaker that didn&#39;t require a new battery every two years -- have saved thousands of lives<\/strong> and improved countless more.<strong> <\/strong><\/p><p><strong>Fischell&#39;s true genius is his ability to see across technologies and sciences.<\/strong> His uncanny intuition allowed him to invent special features of the implantable cardiac defibrillator that has saved more than 60,000 lives -- followed by the implantable insulin pump, coronary stents used to open clogged arteries, and two extraordinary feedback systems that provide early warning of epileptic seizures and heart attacks. Though he is officially retired, he continues to create new devices to treat a wide range of ailments, from heart attacks to chronic migraines. <\/p><p>Accepting his <a href=\"\/index.php\/pages\/view\/id\/104\" target=\"_blank\">2005 TED Prize<\/a>, Fischell made three <a href=\"\/index.php\/pages\/view\/id\/109\" target=\"_blank\">wishes<\/a>. First, he wished for help in developing an implantable device to treat brain disorders such as obsessive-compulsive disorder; second, he asked for help in designing his portable Transcranial Magnetic Stimulator (TMS), <strong>a drug-less migraine treatment<\/strong> -- for the latest news on this device, see the website for his company <a href=\"http:\/\/www.neuralieve.com\/\" target=\"_blank\">Neuralieve<\/a>. For his third wish, Fischell took on the medical malpractice system, which, he believes, puts doctors at the mercy of lawyers and insurers.<\/p>","slug":"robert_fischell","published_at":"2007-02-17 17:05:00","updated_at":"2008-09-15 11:35:18"}}