{"speaker":{"id":5705,"title":"","firstname":"Aparna","middleinitial":"","lastname":"Pallavi","description":"Journalist","whotheyare":"Aparna Pallavi researches and writes about uncultivated foods available in India's forest, Indigenous people's knowledge and culture around them.","whylisten":"<div>Aparna Pallavi&#39;s research focus on the Mahua flower, a once nutritious staple among the Indigenous people of India that is now quickly losing its identity as a food. She is currently in the process of writing her book on the subject. Her research is free of institutional funding and funded entirely by the generosity of individuals around the world.<\/div><div><br \/><\/div><div>Pallavi began as an environment journalist and has written extensively on ecological issues in India over two decades, which also includes numerous articles on Indigenous food. Her work has been featured extensively in two books published by Centre for Science and Environment -- her former employer and a premier organisation for environmental study and research in India -- on indigenous food, entitled&nbsp;<em><a href=\"https:\/\/www.cseindia.org\/first-food-a-taste-of-indias-biodiversity-5115\" target=\"_blank\">First Food:&nbsp;A Taste of India&#39;s Biodiversity<\/a>&nbsp;<\/em>and&nbsp;<a href=\"https:\/\/www.cseindia.org\/first-food-culture-of-taste-7974\" target=\"_blank\"><em>First Food: Culture of Taste<\/em><\/a>.&nbsp;<\/div><div>&nbsp;<\/div><div>In 2006, she was the recipient of the National Foundation for India Fellowship for studying the female angle of farmer suicides in India&nbsp; and the Women&#39;s Feature Service-Care Fellowship for studying the world of women change makers in the area of agriculture.<\/div><div><br \/><\/div><div>Pallavi is currently drawing up a plan of action for reviving Mahua as a food in India, which she hopes to start working on in the coming Mahua season in March 2021. She is currently based out of Auroville town in Pondicherry, India.&nbsp;<\/div>","slug":"aparna_pallavi","published_at":"2019-12-13 19:28:00","updated_at":"2020-06-30 21:28:57"}}