{"speaker":{"id":5710,"title":"","firstname":"Mitch","middleinitial":"","lastname":"Zeller","description":"Health policy expert","whotheyare":"Mitch Zeller leads the US Food and Drug Administration's efforts to reduce disease and death from tobacco use and bring previously unavailable information about its dangers to light.","whylisten":"<p>As director of the Center for Tobacco Products (CTP), Mitch Zeller, JD, is dedicated to carrying out CTP&#39;s charge to reduce the harm from all tobacco products across the entire population -- with a focus on how and why people start, stop or start using these products again.<\/p><p>Zeller became director of the FDA&#39;s Center for Tobacco Products in March 2013. The mission of CTP -- established by enactment of the 2009 Family Smoking Prevention and Tobacco Control Act -- is &quot;to make tobacco-related death and disease part of America&#39;s past, not America&#39;s future, and, by doing so, ensure a healthier life for every American family.&quot;<\/p><p>A graduate of Dartmouth College and the American University Washington College of Law, Zeller has been working on FDA issues for more than 30 years. He began his career as a public interest attorney in 1982 at the Center for Science in the Public Interest (CSPI). In 1988, Zeller left CSPI to become counsel to the Human Resources and Intergovernmental Relations Subcommittee of the House of Representatives Government Operations Committee, where he conducted oversight of enforcement of federal health and safety laws.<br \/>In 1993, Zeller joined the staff of then-FDA Commissioner Dr. David Kessler, MD. What began as a two-week assignment by Kessler in 1994 to examine the practices of the tobacco industry led to his serving as associate commissioner and director of FDA&#39;s first Office of Tobacco Programs. Instrumental in crafting the agency&#39;s 1996 tobacco regulations, Zeller also represented FDA before Congress, federal and state agencies. Zeller also served as an official US delegate to the World Health Organization (WHO) Working Group for the Framework Convention on Tobacco Control.<\/p><p>In 2000, Zeller left FDA to continue his work for tobacco control as executive vice president of the American Legacy Foundation. His responsibilities there included marketing, communications, strategic partnerships and creating the foundation&#39;s first Office of Policy and Government Relations. In 2002, Zeller joined Pinney Associates where, as senior vice president, he provided strategic planning and communications advice on domestic and global public health policy issues involving the treatment of tobacco dependence and the regulation of tobacco products and pharmaceuticals.<\/p>","slug":"mitch_zeller","published_at":"2019-12-16 17:52:00","updated_at":"2021-04-20 19:41:12"}}