{"speaker":{"id":5724,"title":"","firstname":"Shameran","middleinitial":"","lastname":"Abed","description":"Global poverty activist","whotheyare":"Shameran Abed helps households around the world create a path out of extreme poverty.","whylisten":"<p>Shameran Abed is senior director of BRAC&#39;s groundbreaking&nbsp;<a href=\"https:\/\/www.brac.net\/program\/ultra-poor-graduation\/\" target=\"_blank\">Ultra-poor Graduation program<\/a>, which has helped more than two million households in Bangladesh &ldquo;graduate&rdquo; from the direst forms of poverty and social deprivation. The program&#39;s impact in Bangladesh has inspired BRAC&#39;s Ultra-Poor Graduation Initiative (UPGI) to scale the Graduation approach through integration in existing government social protection programs in countries with the greatest potential for impact. By scaling Graduation through government integration, BRAC UPGI aims to help 21 million more people out of extreme poverty. In addition, Shameran leads BRAC&#39;s microfinance program, which serves more than seven million clients in seven countries in Asia and Africa and has total assets exceeding 2.5 billion dollars.<\/p><p>Abed also chairs the board of BRAC Bank&#39;s mobile financial services subsidiary,&nbsp;<a href=\"https:\/\/www.bkash.com\/\" target=\"_blank\">bKash<\/a>, one&nbsp;of the world&#39;s largest mobile money providers, and serves on the boards of BRAC Bank and the Global Alliance for Banking on Values (GABV). Additionally, he is the chairman of the Microfinance Network and is also a member of the Partnership for Responsible Financial Inclusion (PRFI) and the World Economic Forum Financial Inclusion Steering Committee. He is a lawyer by training, having been made a barrister by the Honourable Society of Lincoln&#39;s Inn in London, UK. He completed his undergraduate studies at Hamilton College in the United States, majoring in economics and minoring in political science.&nbsp;<\/p>","slug":"shameran_abed","published_at":"2020-01-18 14:01:00","updated_at":"2020-09-04 15:09:10"}}