{"speaker":{"id":5725,"title":"","firstname":"Christian","middleinitial":"","lastname":"Happi","description":"Molecular biologist, genomist","whotheyare":"A powerhouse of scientific leadership in Africa, Christian Happi sequences and studies the genomes of infectious diseases like Ebola, HIV and coronavirus.","whylisten":"<p>Christian Happi is a professor of molecular biology and genomics and the director of the African Center of Excellence for Genomics of Infectious Diseases (ACEGID) at Redeemer&#39;s University in Nigeria. He researches the human genome as well as the genomics of infectious diseases, including malaria, Lassa fever, Ebola, yellow fever, monkeypox, coronavirus and HIV. In 2014, he confirmed the first case of Ebola in Nigeria and worked closely with Nigerian health authorities to successful contain the outbreak in Nigeria.<\/p><p>Happi used next generation sequencing technology to perform the first sequence of the SARS-CoV-2 virus in Africa within 48 hours of receiving the sample. This seminal work provided insight into the detailed genetic map of the coronavirus in Africa, confirmed the origin of the virus and paved the way for the development of new countermeasures, including new diagnostics, therapeutics and vaccines.<\/p><p>During the 2014-2016 Ebola outbreak, Happi and colleagues used advanced genomics and deep sequencing technology to develop a rapid diagnostics test (15 minutes) for Ebola within four months of the outbreak. He also developed a 10-minute rapid diagnosis test for Lassa fever. In 2015, he discovered two new viruses (EKV-1 and EKV-2) in Ekpoma Edo State using microbial metagenomics, a new cutting-edge technology.<\/p><p>Happi has received several international awards for innovation and health leadership, including the Merle A. Sande Health Leadership Award in 2011 and the 2019 Human Genome Organization (HUGO) African Prize for his contributions in applying genomics knowledge in addressing major infectious diseases challenges in Africa, especially malaria, Lassa fever and Ebola.<\/p>","slug":"christian_happi","published_at":"2020-01-18 14:01:00","updated_at":"2020-05-11 15:02:55"}}