{"speaker":{"id":573,"title":"","firstname":"Ian","middleinitial":"","lastname":"Goldin","description":"Economist, development visionary","whotheyare":"Ian Goldin brings fresh thinking to bear on the big, looming issues of the future.","whylisten":"<p>Ian Goldin is Professor of Globalisation and Development at the University of Oxford, Professorial Fellow at Balliol College, Oxford University, Director of the Oxford Martin Programme on Technological and Economic Change and founding Director of the Oxford Martin School. Previously he was Vice President of the World Bank and the Group&#39;s Director of Policy, after serving as Chief Executive of the Development Bank of Southern Africa and Economic Advisor to President Nelson Mandela.<\/p><p>Goldin has served as Principal Economist at the EBRD and the Director of the Trade and Sustainable Growth Programmes at the OECD Development Centre. He has a MSc from the London School of Economics and an MA and DPhil from the University of Oxford. Goldin has been knighted by the French Government and received numerous awards. He has published 22 books, including&nbsp;<a href=\"https:\/\/iangoldin.org\/books\/terra-incognita-100-maps-to-survive-the-next-100-years\/\" target=\"_blank\"><em>Terra Incognita: 100 Maps to Survive the Next 100 Years<\/em><\/a><em>&nbsp;<\/em>(co-authored with Rober Muggah). His previous books include&nbsp;<a href=\"https:\/\/geni.us\/Ct53lsY\" target=\"_blank\"><em>Age of Discovery: Navigating the Storms of Our Second Renaissance<\/em><\/a><em>;<\/em>&nbsp;<a href=\"https:\/\/geni.us\/hMkV1Bj\" target=\"_blank\"><em>The Butterfly Defect: Why Globalization Creates Systemic Risks and What to Do<\/em><\/a>,&nbsp;in which he predicted that a pandemic was the most likely cause of the next financial crisis;&nbsp;<a href=\"https:\/\/www.amazon.com\/Exceptional-People-Migration-Shaped-Define\/dp\/069115631X\" target=\"_blank\"><em>Exceptional People: How Migration Shaped Our World and Will Define Our Future<\/em><\/a>; and&nbsp;<a href=\"https:\/\/geni.us\/FV2s\" target=\"_blank\"><em>Development: A Very Short Introduction<\/em><\/a>. He has authored and presented three BBC documentary series: <em>After The Crash<\/em>; <em>Will AI Kill Development?<\/em> and <em>The Pandemic that Changed the World<\/em>. He provides advisory and consultancy services to the IMF, UN, EU, OECD and numerous governments and companies. He has been nominated by the World Economic Forum as Global Leader of Tomorrow and regularly presents at their Davos meetings. He has served as a non-executive Director on globally listed companies, including as the Senior Independent Director and chaired all board committees. He is Chair of the core-econ.org initiative to transform economics, and is an honorary trustee of Comic Relief and other charities.<\/p>","slug":"ian_goldin","published_at":"2009-10-23 07:59:00","updated_at":"2020-08-21 15:56:18"}}