{"speaker":{"id":5739,"title":"","firstname":"Rahaf","middleinitial":"","lastname":"Harfoush","description":"Digital anthropologist","whotheyare":"Rahaf Harfoush is a strategist, digital anthropologist and author who focuses on the intersections of emerging technology, innovation and digital culture.","whylisten":"<p>Rahaf Harfoush&#39;s research centers on the human impacts of artificial intelligence, algorithms, social networks and big data. She is the Executive Director of the Red Thread Institute of Digital Culture, a think-tank and consultancy that focuses on helping organizations translate innovation trends into strategic opportunities.<\/p><p>Harfoush teaches &quot;Innovation and Emerging Business Models&quot; at SciencePo&#39;s School of Management and Innovation in Paris. She is named a Young Global Changer at the G20 Think Tank Summit. Her 2019 book&nbsp;<a href=\"https:\/\/geni.us\/vFqwc\" target=\"_blank\">Hustle and Float: Reclaim Your Creativity and Thrive in a World Obsessed with Work<\/a>&nbsp;reveals how the collision of disruptive technologies and centuries-old beliefs about work is creating an untenable tension for workers in the idea economy -- and what organizations need to do to help their creatives thrive.&nbsp;<\/p><p>Harfoush is the coauthor of&nbsp;<a href=\"https:\/\/geni.us\/sqx4u3\" target=\"_blank\"><em>The Decoded Company: Know Your Talent Better Than You Know Your Customers<\/em><\/a>, which was listed on both the <em>New York Times<\/em> and <em>USA Today<\/em> best-seller list, and won a 2015 Gold Axiom Award for Best Business Technology book. <em>The Decoded Company<\/em> explores how big data is providing an unprecedented opportunity for organizations to dramatically improve their decision making, increase their performance and, most importantly, intentionally create ethical, happy, and vibrant work cultures. Harfoush&#39;s first book,&nbsp;<a href=\"https:\/\/geni.us\/kcoo6\" target=\"_blank\"><em>Yes We Did: An Insider&#39;s Look at How Social Media Built the Obama Brand<\/em><\/a>, chronicled her experiences as a member of Barack Obamas digital media team during the 2008 presidential elections and explored how social networking revolutionized political campaign strategy.<\/p><p>Harfoush sits on the Steering Committee for the Peter Drucker Forum as well as the Peer Reviewing Committee for the Association of Internet Researchers. Formerly, she was the Associate Director of the Technology Pioneer Programme at the World Economic Forum in Geneva.<\/p>","slug":"rahaf_harfoush","published_at":"2020-01-29 19:16:00","updated_at":"2020-02-09 21:04:48"}}