{"speaker":{"id":579,"title":"Imam","firstname":"Feisal Abdul","middleinitial":"","lastname":"Rauf","description":" Chairman of the Cordoba Initiative","whotheyare":"Imam Feisal Abdul Rauf has devoted himself to healing relations between Muslim-Americans and their neighbors, and bringing that message of peace to the wider Muslim world. ","whylisten":"<p>In 2003, Imam Feisal Abdul Rauf founded the <a href=\"http:\/\/www.cordobainitiative.org\/\">Cordoba Initiative<\/a>, a non-partisan and international organization that works to provide innovative <strong>solutions to conflict between Muslim and Western communities<\/strong>. He also serves as chair of the Initiative, actively promoting and moderating dialogue between individuals and groups. What&rsquo;s more, this project was not the Imam&#39;s first foray into interreligious talks. In 1997, he started the <a href=\"http:\/\/www.asmasociety.org\/index_splash.html\">American Society for Muslim Advancement<\/a> (ASMA), a group that brings American Muslims and non-Muslims together through programs in policy, current affairs and culture. <br \/><br \/>Also, Imam Rauf regularly attends the Council on Foreign Relations and the World Economic Forum (both Davos and Dead Sea) and has written three books on the topic of <strong>bringing peace to Islam&#39;s relations<\/strong>:&nbsp;<a href=\"http:\/\/geni.us\/islammeaning\" target=\"_blank\"><em>Islam: A Search for Meaning<\/em><\/a>;&nbsp;<a href=\"http:\/\/geni.us\/islamsacredlaw\" target=\"_blank\"><em>Islam: A Sacred Law<\/em><\/a>; and&nbsp;<a href=\"http:\/\/geni.us\/rightwithislam\" target=\"_blank\"><em>What&#39;s Right With Islam: A New Vision for Muslims and the West<\/em><\/a>. He continues to balance his mission of creating peace with his regular duties as Imam of Masjid al-Farah, a mosque twelve blocks from Ground Zero in New York City, that he has led for 25 years. <\/p>","slug":"imam_feisal_abdul_rauf","published_at":"2009-10-31 04:34:00","updated_at":"2015-10-04 18:15:45"}}