{"speaker":{"id":58,"title":"","firstname":"Larry","middleinitial":"","lastname":"Brilliant","description":"Epidemiologist, philanthropist","whotheyare":"TED Prize winner Larry Brilliant has spent his career solving the world's biggest problems, from overseeing the last smallpox cases to saving millions from blindness.","whylisten":"<p>Dr. Larry Brilliant is a physician and epidemiologist, proud member of the TED community, CEO of Pandefense Advisory and Chair of the Advisory Board of the NGO Ending Pandemics. He is a senior advisor to Jeff Skoll and serves on the board of the&nbsp;<a href=\"http:\/\/www.skollglobalthreats.org\/\" target=\"_blank\">Skoll Foundation<\/a>. Previously, he was president and CEO of the Skoll Global Threats Fund, vice president of Google and the founding executive director of Google.org. He also cofounded the&nbsp;<a href=\"\/admin.php\/speakers\/edit\/speakerid\/www.seva.org\" target=\"_blank\">Seva Foundation<\/a>, an NGO whose programs have given sight back to more than five million blind people in two dozen countries. He also cofounded The Well, a progenitor of today&#39;s social media platforms. Earlier in his career, Brilliant was a professor of epidemiology and international health planning at the University of Michigan.<\/p><p>Brilliant lived in India for nearly a decade, where he was a key member of the successful WHO Smallpox Eradication Programme for southeast Asia as well as the WHO Polio Eradication Programme. More recently, he was chairman of the National Biosurveillance Advisory Committee, which was created by presidential directive of President George W. Bush. He was also a member of the World Economic Forum&#39;s Agenda Council on Catastrophic Risk and a &quot;First Responder&quot; for CDC&#39;s bio-terrorism response effort.<\/p><p>Brilliant&#39;s wards and honors include the 2006&nbsp;<a href=\"https:\/\/www.ted.com\/participate\/ted-prize\/prize-winning-wishes\/instedd\" target=\"_blank\">TED Prize<\/a>, <em>Time<\/em> magazine&#39;s 100 Most Influential People, &quot;International Public Health Hero&quot; and four honorary doctorates. He has lectured at Oxford, Harvard, Berkeley and many other colleges, spoken at the Royal Society, the Pentagon, NIH, the United Nations and some of the largest companies and non-profits all over the world. He has written for <em>Forbes<\/em>, the <em>Wall Street Journal<\/em>, <em>The<\/em> <em>Guardian<\/em>&nbsp;and other magazines and peer reviewed journals. He was part of the Global Business Network where he learned Scenario Planning and is the author of a memoir about working to eradicate smallpox,&nbsp;<em><a href=\"https:\/\/geni.us\/Qzk8joW\" target=\"_blank\">Sometimes Brilliant<\/a>,<\/em>&nbsp;and a guide to managing vaccination programs in a book <em>The Management of Smallpox Eradication<\/em>.<\/p>","slug":"larry_brilliant","published_at":"2007-02-17 17:10:00","updated_at":"2020-04-24 15:11:44"}}