{"speaker":{"id":5836,"title":"","firstname":"David","middleinitial":"","lastname":"Heymann","description":"Epidemiologist, professor","whotheyare":"David Heymann is a professor of infectious disease epidemiology at the London School of Hygiene and Tropical Medicine. He led the World Health Organization's global response to the SARS epidemic in 2003.","whylisten":"<p>Dr. David Heymann is head of the Centre on Global Health Security at Chatham House, London. From 2012 to March 2017 he was chairman of Public Health England. For the 22 years prior, Heymann worked at the World Health Organization (WHO) in Geneva on secondment from the Centers for Disease Control and Prevention (CDC). During that time he rose from chief of research of the Global Programme on AIDS to founding director of the Programme on Emerging and other Communicable Diseases. He was then named executive director of the Communicable Diseases Cluster, a position from which he headed the global response to SARS, and finally was named assistant director for Health Security and the Director General&rsquo;s representative for polio eradication.<\/p><p>Before joining WHO, Heymann was based for 13 years in sub-Saharan Africa on assignment from CDC where he worked Cameroon, Cote d&rsquo;Ivoire, DRC and Malawi. During this period he participated in the response to the first, second and third outbreaks of Ebola hemorrhagic fever in DRC, investigated human monkeypox outbreaks throughout central and western Africa and supported ministries of health in field research aimed at better control of malaria, measles, tuberculosis and other infectious diseases. Prior to joining CDC, he worked in India for two years as a medical epidemiologist in the WHO smallpox eradication programme.&nbsp;<\/p><p>Heymann is an elected fellow of the Institute of Medicine of the National Academies (US) and the Academy of Medical Sciences (UK) and has received seven different public health awards, including the Heinz Award on the Human Condition. He has published more than 200 peer-reviewed articles, commentaries and book chapters, and is the editor of the&nbsp;<a href=\"https:\/\/www.apha.org\/ccdm\" target=\"_blank\"><em>Control of Communicable Diseases Manual<\/em><\/a>, a major global reference for public health and health protection.<\/p>","slug":"david_heymann","published_at":"2020-02-24 21:26:00","updated_at":"2020-03-04 04:16:32"}}