{"speaker":{"id":5841,"title":"","firstname":"Mary L.","middleinitial":"","lastname":"Gray","description":"Anthropologist","whotheyare":"Anthropologist and media scholar Mary L. Gray focuses on how the everyday use of technology (including artificial intelligence) transforms our lives -- for better and worse.","whylisten":"<p>Mary L. Gray is the coauthor of&nbsp;<a href=\"https:\/\/geni.us\/C9zgjmy\" target=\"_blank\"><em>Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass<\/em><\/a><em>,&nbsp;<\/em>a <em>Financial Times<\/em> critics&#39; pick in 2019. She is senior principal researcher at Microsoft Research as well as a 2019-20 E.J. Safra Center for Ethics Fellow and Berkman Klein Center for Internet and Society Faculty Affiliate at Harvard University. An anthropologist and media scholar by training, Gray focuses on how everyday uses of technologies transform people&#39;s lives. Her other books include&nbsp;<a href=\"https:\/\/www.amazon.com\/Your-Face-Stories-Haworth-Lesbian\/dp\/1560238879\/\" target=\"_blank\"><em>In Your Face: Stories from the Lives of Queer Youth<\/em><\/a>,&nbsp;<a href=\"https:\/\/www.amazon.com\/Queering-Countryside-Frontiers-Studies-Intersections\/dp\/1479880582\" target=\"_blank\"><em>Queering the Countryside: New Directions in Rural Queer Studies<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.amazon.com\/Out-Country-Visibility-America-Intersections\/dp\/0814731937\/\" target=\"_blank\"><em>Out in the Country: Youth, Media, and Queer Visibility in Rural America<\/em><\/a>, which explore how young people in rural Appalachia use the internet to craft their identities and build connections to both local and distant queer communities.<\/p><p>Gray is chair of the Microsoft Research Ethics Review Program -- the only federally registered review board of its kind in the tech industry -- and is a leading expert in the emerging field of AI and ethics, particularly the intersections of computer and social sciences. She holds a faculty post in the School of Informatics, Computing and Engineering with affiliations in Anthropology and Gender Studies at Indiana University. She sits on the editorial boards of Cultural Anthropology, Television and New Media, the International Journal of Communication and Social Media + Society. Additionally, she currently sits on the California Governor&#39;s Council of Economic Advisors and serves on several boards, including Public Responsibility in Medicine and Research (PRIM&amp;R) and Stanford University&#39;s One-Hundred-Year Study on Artificial Intelligence (AI100) Standing Committee, commissioned to reflect on the future of AI and recommend directions for its policy implications.<\/p>","slug":"mary_gray","published_at":"2020-02-25 19:04:00","updated_at":"2020-07-20 20:15:22"}}