{"speaker":{"id":5858,"title":"","firstname":"Karoline","middleinitial":"","lastname":"Hjorth","description":"Artist","whotheyare":"Karoline Hjorth is a Norwegian photographer, artist and writer whose collaborative work reinforces humanity's connection to the natural world.","whylisten":"<p>Driven by curiosity and imagination, Karoline Hjorth seeks to understand our relationship with our surroundings. With her longtime collaborator Riitta Ikonen, the Norwegian-Finnish artist duo started the series <em>Eyes as Big as Plates<\/em>&nbsp;in 2011, studying the personifications of nature and folkloric traditions in the Nordic countries. They have traveled to 14 countries,&nbsp;and the series has grown to over one hundred portraits. Their collaboration continues with new works and exhibitions in Senegal, Outer Hebrides and Turkey.<\/p><p>Karoline Hjorth&#39;s first book,&nbsp;<a href=\"https:\/\/fpress.no\/boker\/mormormonologene-pocket\" target=\"_blank\"><em>Mormormonologene<\/em><\/a>, was published in 2011 (Press Publishing, Oslo), followed by&nbsp;<a href=\"https:\/\/eyesasbigasplates.com\/\" target=\"_blank\"><em>Eyes as Big as Plates<\/em><\/a>, with&nbsp;Riitta Ikonen, in 2017 (Press Publishing). <em>Eyes as Big as Plates<\/em> was awarded gold for best cover in Grafill&rsquo;s annual book award show&nbsp;&Aring;rets Vakreste B&oslash;ker 2018&nbsp;and nominated for the Paris Photo \/ Aperture Foundation Photobook Awards in 2017.&nbsp;<a href=\"https:\/\/newkirkeneshospital.com\/\" target=\"_blank\"><em>Time is a ship that never casts anchor<\/em><\/a>, created with Riitta Ikonen and&nbsp;Kulturbyr&aring;et Mes&eacute;n, was published in 2018 in conjunction with the completion of a public art commission for New Kirkenes Hospital. Most recently, Hjorth&#39;s&nbsp;solo project&nbsp;<a href=\"https:\/\/karolinehjorth.com\/billett-merket-personals\/\" target=\"_blank\"><em>Algoritmeanekdoter<\/em><\/a>, a contemporary portrait series of online daters in Norway, came out on Press Publishing in February 2019.<\/p><p>Karoline Hjorth completed her BA in photographic arts and MA in international journalism at the University of Westminster (London) in 2009 and is currently based in Oslo. Her photographic work has received the Deloitte Award at the National Portrait Gallery in London and has been exhibited and published internationally.&nbsp;<\/p>","slug":"karoline_hjorth","published_at":"2020-02-26 16:05:00","updated_at":"2020-08-31 13:54:35"}}