{"speaker":{"id":5893,"title":"","firstname":"Varun","middleinitial":"","lastname":"Sivaram","description":"Clean energy executive, physicist, author","whotheyare":"To combat climate change, Varun Sivaram seeks to scale up clean energy technologies and cultivate innovation ecosystems spanning industry, academia and government.","whylisten":"<p>Varun Sivaram believes that slowing climate change will require accelerating clean energy innovation, a goal he has pursued from the corporate, academic and public sectors. Most recently, as chief technology officer of ReNew Power, he led research and development for a multibillion-dollar company recognized as India&#39;s largest producer of renewable energy as well as its most innovative energy company.<\/p><p>A widely published scientist and innovation scholar, Sivaram is a senior research scholar at Columbia University&#39;s Center on Global Energy Policy, serves on the boards of Stanford University&#39;s energy and environment institutes and created the course &quot;Clean Energy Innovation&quot; as a Georgetown University professor to train the next generation of energy leaders. He has also shaped government policies supportive of innovation as the director of the energy and climate program at the Council on Foreign Relations and as a senior energy advisor to the Los Angeles mayor and New York governor&#39;s office. He serves as one of the 25 advisors to the UN COP26 climate conference in 2021; on the World Economic Forum&#39;s Global Future Council for the Energy Transition; as senior fellow at the Aspen Institute, ITIF and Energy for Growth; and on the board of Peridot Acquisition Corp. (NYSE:PDAC.U) and as an advisor to Camus Energy, Glint Solar and Radia, Inc.<\/p><p><em>TIME<\/em> Magazine named him one of its &quot;100 Next most influential people in the world,&quot; and <em>PV<\/em> Magazine called him &quot;the Hamilton of the Solar Industry.&quot; His books include&nbsp;<em><a href=\"https:\/\/geni.us\/kURL\" target=\"_blank\">Taming the Sun: Innovations to Harness Solar Energy and Power the Planet<\/a>&nbsp;--&nbsp;<\/em>which <em>The<\/em> <em>Economist<\/em> called &quot;prescient&quot; -- and&nbsp;<em><a href=\"https:\/\/geni.us\/mhBpgCV\" target=\"_blank\">Digital Decarbonization: Promoting Digital Innovations to Advance Clean Energy Systems<\/a>.&nbsp;<\/em>His newest book,&nbsp;<a href=\"https:\/\/geni.us\/tk8M\" target=\"_blank\"><em>Energizing America: A Roadmap to Launch a National Energy Innovation Mission<\/em><\/a>, was endorsed by John Kerry as &quot;a plan to make the United States the world leader in clean energy innovation.&quot; Bill Gates praised his essay in <em>Foreign Affairs<\/em> as &quot;one of the best arguments I&#39;ve read for why the US should invest in a clean energy revolution.&quot; A Rhodes and Truman Scholar, Sivaram holds a PhD in condensed matter physics from Oxford University and undergraduate degrees from Stanford University.<\/p>","slug":"varun_sivaram","published_at":"2020-02-26 23:00:00","updated_at":"2020-10-08 22:32:20"}}