{"speaker":{"id":59,"title":"","firstname":"","middleinitial":"","lastname":"Bono","description":"Musician, activist","whotheyare":"Bono, the lead singer of U2, uses his celebrity to fight for social justice worldwide: to end hunger, poverty and disease, especially in Africa. His nonprofit ONE raises awareness via media, policy and calls to action.","whylisten":"<p>Irreverent, funny, iconoclastic and relentless, Bono has proven himself stunningly effective in encouraging and cajoling the world&#39;s most powerful leaders to take seriously the challenge of disease and hunger and seize the historic opportunity we now have to beat extreme poverty, especially in Africa, through technological innovation, smart aid, transparency and investments which put citizens in charge.&nbsp;<\/p><p>As lead singer of&nbsp;<a href=\"http:\/\/www.u2.com\" target=\"_blank\">U2<\/a>, Bono performed at&nbsp;<a href=\"http:\/\/www.imdb.com\/title\/tt0261024\/\" target=\"_blank\">Live Aid<\/a> in 1985, which inspired him to travel to Ethiopia with his wife, Ali. There they spent several weeks helping with a famine relief project. The experience shocked him and ignited a determination to work for change. In Bono&#39;s own words, &quot;What are the blind spots of our age? It might be something as simple as our deep-down refusal to believe that every human life has equal worth&quot;. In 2005, the year of&nbsp;<a href=\"http:\/\/www.makepovertyhistory.org\/2005\/index.shtml\" target=\"_blank\">Make Poverty History<\/a>, Bono became one of the inaugural winners of the&nbsp;<a href=\"http:\/\/www.tedprize.org\" target=\"_blank\">TED Prize<\/a>; he used his wish to raise awareness and inspire activism.<\/p><p>In 2002, he co-founded&nbsp;<a href=\"http:\/\/data.d202.org\" target=\"_blank\">DATA<\/a> (Debt, AIDS, Trade, Africa), which later became the advocacy and campaign organization,&nbsp;<a href=\"http:\/\/www.one.org\" target=\"_blank\">ONE<\/a>. Today ONE has more than 3 million members who pressure politicians around the world to improve policies to empower the poorest. Thanks to these efforts, along with those of partners and grassroots leaders in Africa, these policies have delivered results. For example, eight million people are now on life preserving antiretoviral medications, malarial death rates have been halved in eight target countries, 50 million more children are in school and 5.4 million lives have been saved through vaccines.<\/p><p>In 2006, Bono and Bobby Shriver launched&nbsp;<a href=\"http:\/\/www.joinred.com\" target=\"_blank\">(RED)<\/a>&nbsp;to engage the private sector in the fight against AIDS in Africa. (RED) Partners direct a portion of their profits from (RED)-branded products, services and events directly to the Global Fund to Fight AIDS, Tuberculosis and Malaria. In just six years, (RED) has contributed more than $200 million - every penny of which goes directly to HIV\/AIDS programs with the goal of eliminating mother-to-child transmission of HIV. To date, (RED) dollars have helped the lives of more than 14 million people in Africa through education, testing, counseling, and treatment programs. <\/p><p>Bono also co-founded EDUN with his wife Ali.&nbsp;<a href=\"http:\/\/www.edun.com\" target=\"_blank\">EDUN<\/a>&nbsp;is a global fashion brand which does business in an number of countries in Africa and beyond, sourcing materials and manufacturing clothing. In Uganda, EDUN is supporting over 8,000 farmers in their move from subsistence to sustainable business practices. &nbsp;<\/p>        <p>Granted knighthood in 2007 and dubbed a &quot;Man of Peace&quot; in 2008, Bono mobilized in 2010 following the devastating earthquake in Haiti, performing the song &quot;Stranded&quot; with bandmate The Edge -- and Rihanna and Jay-z -- during the for Hope for Haiti Now telethon. The event was watched by 83 million people in the United States alone and raised a reported $58 million for relief.<\/p><p>Bono&rsquo;s journey in activism spans a generation and where he is coming from, and above all where he is going, is something we should all pay close attention to.&nbsp;<\/p>","slug":"bono","published_at":"2007-02-17 17:13:00","updated_at":"2013-03-13 22:50:49"}}