{"speaker":{"id":5905,"title":"","firstname":"Marcelo","middleinitial":"","lastname":"Mena","description":"Former environment minister of Chile","whotheyare":"An environmentalist and former minister of the environment, Marcelo Mena is helping Chile make a low emission, resilient and inclusive transition to zero emissions by 2050.","whylisten":"<p>Marcelo Mena is a scientist and professor turned activist and policymaker. He is the director of the Climate Action Center at Pontificia Universidad Cat&oacute;lica de Valpara&iacute;so (PUCV) and the Chile Office of the Global Center on Adaptation. Previously he was the practice manager in climate research at the World Bank and the former vice minister and minister of the environment for Chile under President Bachelet from 2014 to 2018. He spearheaded multiple environmental initiatives such as taxes on new car sales and power generation based on local and global air pollution -- the first of their kinds globally. He helped craft a landmark agreement to phase out coal power generation, create 45 thousand square kilometers of national parks, protect 1.3 million square kilometers of ocean and institute the first national plastic bag ban in the Americas.&nbsp;<\/p><p>At the World Bank, Mena helped create the&nbsp;<a href=\"http:\/\/pubdocs.worldbank.org\/en\/646831555088732759\/FM-Coalition-Brochure-final-v3.pdf\" target=\"_blank\">Coalition of Finance Ministers for Climate Action<\/a>, which includes 53 ministers that manage 2.9 trillion dollars a year in national budgets, or 10 percent of global GDP, contributed to the&nbsp;<a href=\"http:\/\/documents.worldbank.org\/curated\/en\/519821547481031999\/The-World-Bank-Groups-Action-Plan-on-Climate-Change-Adaptation-and-Resilience-Managing-Risks-for-a-More-Resilient-Future.pdf\" target=\"_blank\">Action Plan on Climate Change Adaption and Resilience<\/a>&nbsp;and helped design of the new phase of&nbsp;<a href=\"https:\/\/www.worldbank.org\/en\/programs\/ndc-support-facility\" target=\"_blank\">NDC Support Facility<\/a>.<\/p><p>Mena earned his PhD in environmental engineering, focusing his research on estimating the externalities of biofuels, power generation, transportation and residential heating. He used his research to advocate for renewable energy and push for more stringent regulations to stop dirty coal power generation in Chile. In his career, he has received awards from UNEP, National Geographic, Oceans Unite, NASA and EPA as well as fellowships from MIT and the Fulbright Commission.<\/p>","slug":"marcelo_mena_carrasco","published_at":"2020-02-28 20:37:00","updated_at":"2020-05-29 12:35:34"}}