{"speaker":{"id":5909,"title":"","firstname":"Mandë","middleinitial":"","lastname":"Holford","description":"Venom scientist","whotheyare":"Mandë Holford investigates the power of venom to transform organisms (and lives) when it is adapted to create new therapeutics that treat human diseases and disorders.","whylisten":"<p>Dr. Mand&euml; Holford is an Associate Professor in Chemistry and Biochemistry at Hunter College and CUNY-Graduate Center, with scientific appointments at The American Museum of Natural History and Weill Cornell Medicine. Her interdisciplinary research, which ranges from mollusks to medicine, combine chemistry and biology to discover, characterize and deliver novel peptides from venomous marine snails for manipulating cellular physiology. Her laboratory investigates the power of venom to transform organisms and to transform lives when adapted to create new therapeutics for treating human diseases and disorders. Holford&#39;s research program is global, interdisciplinary and collaborative with impacts ranging from evolution and molecular systematics to nanotechnology, biomedicine and drug discovery.<\/p><p>Holford is actively involved in science education, advancing the public understanding of science and science diplomacy. She cofounded&nbsp;<a href=\"https:\/\/www.killersnails.com\/\" target=\"_blank\">Killer Snails, LLC<\/a>, an EdTech XR learning games company that inspires a love of science. The mission of Killer Snails is to bring science out of the lab and into the hands of learners globally. In the past three years, the company created award-winning games that include three tabletop games (Assassins of the Sea, Biome Builder and Funded), two digital games (Assassins of the Sea 2.0), one augmented reality experience (Killer Snails All Around), one virtual reality experience (Scuba Adventure: Philippines) and one hybrid digital\/virtual reality experience (BioDive) with partners such as the American Museum of Natural History, the New York Hall of Science and Google. Holford has also developed several science education programs at informal science venues such as The American Museum of Natural History and the Utah Museum of Natural History.<\/p><p>Holford is also active in science and technology policy issues related to biodiversity, oceans and women. She codeveloped the first short course on Science Diplomacy offered at CUNY Graduate Center, The Rockefeller University and Hunter College. She is a member of the Council on Foreign Relations, a former World Economic Forum Global Council fellow, a member of the U.S. National Academy of Sciences Engineering and Medicine (NASEM) Global Science Diplomacy Roundtable and Planning Committee and an American Association for the Advancement of Science (AAAS) Science &amp; Technology Policy Fellow.<\/p><p>Holford has received several awards, including being named a New Champion Young Scientist and a 2020 Sustainability Pioneer by the World Economic Forum, the prestigious Camille Dreyfus Teacher-Scholar Award, an NSF CAREER Award, named a &quot;Breakthrough Women in Science&quot; by the Howard Hughes Medical Institute (HHMI) and NPR&#39;s Science Friday, and she was recently named a Wings WorldQuest Women of Discovery Fellow and a Fellow of the California Academy of Sciences. She received her PhD in Synthetic Protein Chemistry from The Rockefeller University.<\/p>","slug":"mande_holford","published_at":"2020-02-28 22:31:00","updated_at":"2020-10-29 17:22:25"}}