{"speaker":{"id":5921,"title":"","firstname":"Elizabeth","middleinitial":"","lastname":"Stordeur Pryor","description":"Historian","whotheyare":"Elizabeth Stordeur Pryor writes, teaches and engages questions on race and racism in the US.","whylisten":"<p class=\"p1\">Elizabeth Stordeur Pryor&nbsp;is an associate professor of history at Smith College, focusing specifically on African American activism in the 19th century and how historical ideologies on race inform contemporary discourse. Her research centers on the etymology of the N-word and the complicated and corrosive idea behind it.&nbsp;<\/p><p class=\"p1\">In the classroom, Pryor explores questions of citizenship, race and racism and the history of US slavery, looking carefully at how enslaved people&#39;s histories are remembered and who remembers them. Her classes are designed to help students make connections between the anti-blackness of the past and present. Pryor is a 2016 recipient of the&nbsp;<a href=\"https:\/\/www.smith.edu\/about-smith\/college-events\/sherrerd-prizes\"><span class=\"s1\">Sherrerd Prize for Distinguished Teaching<\/span><\/a>.&nbsp;<\/p><p class=\"p2\">As Smith College&#39;s Faculty Teaching Mentor for Inclusive and Equitable Pedagogies, Pryor conducts faculty workshops on navigating the N-word and other racist language in the classroom. She holds an MA from Cornell University and PhD from the University of California, Santa Barbara.&nbsp;&nbsp;<\/p> <p class=\"p1\">Pryor&#39;s essay, &quot;<a href=\"https:\/\/scholarworks.smith.edu\/cgi\/viewcontent.cgi?article=1003&amp;context=hst_facpubs\" target=\"_blank\">The Etymology of [N-word]: Resistance, Language, and the Politics of Freedom in the Antebellum North<\/a>,&quot; won the Ralph D. Gray Prize for Best Article of 2016 in the&nbsp;<em>Journal of the Early Republic<\/em>. She is currently writing her second book, a historical and pedagogical study of the N-word framed, in part, by her experience as a biracial woman in the United States&nbsp;and as the daughter of iconic comedian Richard Pryor.<\/p>","slug":"elizabeth_stordeur_pryor","published_at":"2020-03-12 14:20:00","updated_at":"2020-04-06 19:15:17"}}