{"speaker":{"id":5926,"title":"","firstname":"Eric","middleinitial":"","lastname":"Sannerud","description":"Farmer, entrepreneur ","whotheyare":"Eric Sannerud engages with agricultural issues across disciplines and seeks to boost access to farmland for new and young farmers.","whylisten":"<p>Eric&nbsp;Sannerud is the founding farmer at Mighty Axe Hops, the midwest&rsquo;s largest hop farm raising specialty hops for craft brewers around the world.<\/p><p>His work has been recognized by the <em>Minneapolis St. Paul Business Journal<\/em>&rsquo;s prestigious 40 Under 40 award, the University of Minnesota Alumni Society&rsquo;s U40 Leader Award and the Greater St. Cloud Development Corporation&rsquo;s Innovation Award.<\/p><p>Outside of the hop yard, Sannerud&nbsp;serves as a board member of Minnesota Department of Agriculture&rsquo;s Rural Finance Authority and advisor to the Minnesota Agricultural Water Quality Certification Program. He has held positions with the Institute on the Environment, Healthy Foods Healthy Lives Institute and Farmers&rsquo; Legal Action Group.&nbsp;<\/p><p>He currently serves on the executive committee on the board of Environmental Initiative, a solutions-focused environmental non-profit, and is a chair member of the Farmland Access Steering Committee, a working group seeking to boost access to farmland for new and young farmers.<\/p><p>Sannerud&nbsp;is an active member of various leadership groups including Central Minnesota Young Farmers Coalition, National Young Farmers Coalition and Minnesota Farmers Union. He is Fellow of the Future and a mentor to University of Minnesota students. He graduated Cum Laude from the University of Minnesota with an individualized degree in Sustainability, Business and Social Justice in 2013.&nbsp;<\/p><p>He lives on a small farm in a tiny house with his wife Rachel, their two barn cats, mama pig, ducks and chickens outside of Milaca, Minnesota.<\/p><div><br \/><\/div>","slug":"eric_sannerud","published_at":"2020-03-18 14:38:00","updated_at":"2020-03-18 14:41:33"}}