{"speaker":{"id":5939,"title":"","firstname":"Fareed","middleinitial":"","lastname":"Zakaria","description":"Journalist, author","whotheyare":"Fareed Zakaria hosts \"Fareed Zakaria GPS\" for CNN Worldwide and is a columnist for \"The Washington Post,\" a contributing editor for \"The Atlantic\" and a bestselling author.","whylisten":"<p>Fareed Zakaria&#39;s weekly international and domestic affairs program,&nbsp;<em>Fareed Zakaria GPS<\/em>,&nbsp;airs on CNN\/US and around the world on CNN International. Since its debut in 2008, it has become a prominent television forum for global newsmakers and thought leaders. Interviews on <em>Fareed Zakaria GPS<\/em> have included US President Barack Obama, French President Emmanuel Macron, Chinese Premier Wen Jiabao, Russian President Vladimir Putin, Israeli Prime Minister Benjamin Netanyahu and Turkish President Recep Tayyip Erdoğan. The program earned the Peabody Award in 2011 and an Emmy Award nomination in 2013.<\/p><p>Zakaria is the author of three <em>New York Times<\/em> bestselling books: <em>In Defense of a Liberal Education<\/em> (2015), a commentary on the importance of a well-rounded education; the international bestselling <em>The Post-American World<\/em> (1st ed. 2008, 2nd ed. 2011), a discussion of the rise of non-Western powers; and <em>The Future of Freedom<\/em> (2003), a study of &quot;illiberal democracy&quot; in various countries, also an international bestseller.<\/p><p>Prior to his tenure at CNN Worldwide, Zakaria was editor of <em>Newsweek International<\/em>, managing editor of <em>Foreign Affairs<\/em>, a columnist for <em>Time<\/em>, an analyst for ABC News, and the host of <em>Foreign Exchange with Fareed Zakaria<\/em> on PBS. In 2017, Zakaria was awarded the Arthur Ross Media Award by the American Academy of Diplomacy. He was named a &quot;Top 10 Global Thinker of the Last 10 Years&quot; by <em>Foreign Policy<\/em> magazine in 2019, and Esquire once called him &quot;the most influential foreign policy adviser of his generation.&quot;<\/p><p>Zakaria serves on the boards of the Council of Foreign Relations and New America. He earned a bachelor&#39;s degree from Yale University, a doctorate in political science from Harvard University and has received numerous honorary degrees.<\/p>","slug":"fareed_zakaria","published_at":"2020-04-09 18:56:00","updated_at":"2020-04-10 16:51:11"}}