{"speaker":{"id":594,"title":"","firstname":"Michael","middleinitial":"","lastname":"Sandel","description":"Political philosopher","whotheyare":"Michael Sandel teaches political philosophy at Harvard, exploring the most hotly contested moral and political issues of our time.","whylisten":"<p>Michael Sandel is one of the best known American public intellectuals. <em>London Observer<\/em>&nbsp;calls him a &quot;master of life&#39;s big questions&quot; while&nbsp;<em>Newsweek<\/em>&nbsp;describes him as &quot;the most relevant living philosopher&quot; and a &quot;rock-star moralist.&quot;<\/p><p>Sandel&#39;s latest book,&nbsp;<a href=\"https:\/\/geni.us\/uwQ540p\" target=\"_blank\"><em>The Tyranny of Merit: What&rsquo;s Become of the Common Good?<\/em><\/a>, shows how the divide between winners and losers has poisoned our politics and driven us apart, and points the way to a new politics of the common good. His books&nbsp;<a href=\"http:\/\/geni.us\/justicewhatsright\" target=\"_blank\"><em>Justice: What&#39;s the Right Thing to Do?<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.amazon.com\/What-Money-Cant-Buy-Markets\/dp\/0374533652\/ref=pd_sim_14_4?tag=tedspeakers-20&amp;ie\" target=\"_blank\"><em>What Money Can&#39;t Buy: The Moral Limits of Markets<\/em><\/a> were international best sellers and have been translated into 27 languages. His legendary course, &quot;Justice,&quot; is the first Harvard course to be made freely available online and has been viewed by tens of millions.<\/p><p>Sandel&#39;s BBC series&nbsp;<a href=\"https:\/\/www.bbc.co.uk\/programmes\/b075ft6f\" target=\"_blank\"><em>The Global Philosopher<\/em><\/a> explores the ethical questions lying behind the headlines with audiences around the world, on issues such as immigration, climate change, new technologies and the COVID-19 pandemic. His lecture tours have taken him across five continents and packed such venues as St. Paul&#39;s Cathedral (London), the Sydney Opera House (Australia) and an outdoor stadium in Seoul (South Korea), where 14,000 people came to hear him speak.<\/p>","slug":"michael_sandel","published_at":"2009-12-09 14:26:00","updated_at":"2020-08-25 15:09:00"}}