{"speaker":{"id":5947,"title":"","firstname":"Dick M.","middleinitial":"","lastname":"Carpenter II","description":"Law researcher","whotheyare":"Dick M. Carpenter II studies cutting edge issues at the intersection of social science and constitutional law. ","whylisten":"<p>Dick M. Carpenter II serves as a director of strategic research for the Institute for Justice (IJ). He works with IJ staff and attorneys to define, implement and manage social science research related to the Institute&rsquo;s mission.<\/p><p>As an experienced researcher, Carpenter has presented and published writing on property rights, economic regulation, education policy, free speech and a host of other topics. His work has appeared in academic journals, such as <em>Economic Development Quarterly<\/em>, <em>Economic Affairs<\/em>, <em>The Forum, Fordham Urban Law Journal<\/em>, <em>International Journal of Ethics<\/em>, <em>Education and Urban Society<\/em>, <em>Urban Studies<\/em>, <em>Regulation and Governance<\/em>, and magazines, such as <em>Regulation<\/em>, <em>Phi Delta Kappan<\/em> and the <em>American School Board Journal<\/em>. Moreover, the results of his research have been quoted in newspapers such as the <em>New York Times<\/em>, <em>Washington Post<\/em>&nbsp;and the <em>Wall Street Journal<\/em>. Carpenter also coauthored<em>&nbsp;<a href=\"https:\/\/www.amazon.com\/Bottleneckers-Gaming-Government-Private-Profit\/dp\/1594039070\" target=\"_blank\">Bottleneckers<\/a><\/em>, which published in 2016.<\/p><p>Before working with IJ, Carpenter worked as a school teacher and principal, public policy analyst and faculty member at the University of Colorado Colorado Springs, where he currently serves as a professor. He holds a Ph.D. from the University of Colorado.<br \/>&nbsp;<br \/>As a classically trained percussionist, he performs regularly in Colorado. He has flown private planes for 25 years.&nbsp;<\/p>","slug":"dick_m_carpenter_ii","published_at":"2020-04-27 22:01:00","updated_at":"2020-04-28 17:33:17"}}