{"speaker":{"id":595,"title":"","firstname":"Chip","middleinitial":"","lastname":"Conley","description":"Hospitality entrepreneur, author","whotheyare":"Chip Conley disrupted the hospitality industry -- twice.","whylisten":"<p><em>New York Times<\/em> bestselling author and hospitality entrepreneur Chip Conley founded Joie de Vivre Hospitality (JdV) at age 26, transforming an inner-city motel into the second largest boutique hotel brand in America. He sold JdV after running it as CEO for 24 years; soon thereafter, the young founders of Airbnb invited him to help transform their promising start-up into the world&#39;s leading hospitality brand. Conley&nbsp;served as Airbnb&#39;s Head of Global Hospitality and Strategy for four years, and today he acts as the company&#39;s Strategic Advisor for Hospitality and Leadership.<\/p><p><a href=\"https:\/\/www.amazon.com\/Wisdom-Work-Making-Modern-Elder\/dp\/0525572902\" target=\"_blank\"><em>Wisdom@Work: The Making of a Modern Elder<\/em><\/a> is Conley&#39;s&nbsp;fifth book and makes the case for a new kind of &quot;elderhood&quot; and the value of intergenerational collaboration. His previous books,&nbsp;<a href=\"https:\/\/www.amazon.com\/Peak-Great-Companies-Their-Maslow\/dp\/0787988618\" target=\"_blank\"><em>PEAK<\/em><\/a> and&nbsp;<a href=\"https:\/\/www.amazon.com\/Emotional-Equations-Creating-Happiness-Business\/dp\/1451607261\" target=\"_blank\"><em>Emotional Equations<\/em><\/a>, are inspired by the works of famed psychologists Abraham Maslow and Viktor Frankl and their theories on transformation and meaning.<\/p><p>Conley is the founder of the world&#39;s first &quot;midlife wisdom school,&quot; the Modern Elder Academy in Baja California Sur, Mexico, where students learn how to repurpose a lifetime of experience. He&#39;s also the founder of Fest300 (part of Everfest) and San Francisco&#39;s Celebrity Pool Toss and Hotel Hero Awards. Conley&nbsp;holds a BA and MBA from Stanford University, and an honorary doctorate in psychology from Saybrook University. He serves on the boards of the Burning Man Project and the Esalen Institute, home of the Conley Library.<\/p><p>Photo: Marc Olivier Leblanc<\/p>","slug":"chip_conley","published_at":"2009-12-09 14:27:00","updated_at":"2018-10-11 15:06:30"}}