{"speaker":{"id":5954,"title":"","firstname":"Kristalina","middleinitial":"","lastname":"Georgieva","description":"Managing Director, International Monetary Fund","whotheyare":"Kristalina Georgieva has helped shape the agenda of the European Union.","whylisten":"<p>Kristalina Georgieva became the managing director of the International Monetary Fund (IMF) in October 2019. Before joining the IMF, she was CEO of the&nbsp;<a href=\"https:\/\/www.worldbank.org\/\" target=\"_blank\">World Bank<\/a>&nbsp;from January 2017 to September 2019 and served as interim president of the World Bank Group for three months.<\/p><p>Georgieva served as the&nbsp;<a href=\"https:\/\/ec.europa.eu\/\" target=\"_blank\">European Commission<\/a>&nbsp;vice president for Budget and Human Resources, overseeing the European Union&#39;s &euro;161 billion (US $175 billion) budget and 33,000 staff members and working to address the Euro area debt crisis and the 2015 refugee crisis. As commissioner for International Cooperation, Humanitarian Aid and Crisis Response, she managed one of the world&#39;s largest humanitarian aid budgets.&nbsp;<\/p><p>Prior to joining the European Commission, Georgieva worked for 17 years at the World Bank, where she began as an environmental economist in 1993. In 2008, she became its vice president and corporate secretary, serving as the interlocutor between the World Bank Group&#39;s senior management, its board of directors and its shareholder countries. While at the World Bank, she held a number of other senior positions, including director for Sustainable Development, director for the Russian Federation in Moscow, director for Environment, and director for Environment and Social Development for the East Asia and Pacific Region.<\/p><p>Georgieva serves as cochair of the Global Commission on Adaptation to climate change and cochair of the United Nations Secretary-General&#39;s High-Level Panel on Humanitarian Financing. She has authored and coauthored more than 100 publications on environmental and economic policy topics, including textbooks on macro- and microeconomics.&nbsp;<\/p><p>Born in Sofia, Bulgaria in 1953, Georgieva holds a PhD in economic science and a MA in political economy and sociology from the University of National and World Economy, Sofia, where she was an associate professor from 1977 to 1993. During her academic career, she was a visiting fellow at the London School of Economics and at the Massachusetts Institute of Technology. In 2010, she was named &quot;European of the Year&quot; and &quot;Commissioner of the Year&quot; by European Voice for her leadership in the EU&#39;s humanitarian response to crises.<\/p>","slug":"kristalina_georgieva","published_at":"2020-05-07 20:46:00","updated_at":"2020-05-20 01:04:38"}}