{"speaker":{"id":5962,"title":"","firstname":"Russell","middleinitial":"","lastname":"Wilson","description":"Seattle Seahawks quarterback","whotheyare":"An elite NFL quarterback, entrepreneur and community leader, Russell Wilson is dedicated to excellence.","whylisten":"<p>Drafted by the Seattle Seahawks in 2012, Russell Wilson has led the team to more wins than any other quarterback in team history, including a victory in Super Bowl XLVIII (2013). In 2014, he led Seattle to a second straight Super Bowl berth as a two-time NFC Champion (2013, 2014). He holds the NFL record for most regular season wins by a quarterback in his first eight seasons and the record for the most passing touchdowns in a season by a rookie. He also holds the second-highest passer rating in NFL history, behind Aaron Rodgers.&nbsp;He played collegiate football at North Carolina State and the University of Wisconsin, where he set numerous records and garnered national acclaim.<\/p><p>As an extension of his work on the field, Russell partnered with famed mental conditioning coach Trevor Moawad to found&nbsp;<a href=\"https:\/\/www.thinkbig-gofar.com\/\" target=\"_blank\">Limitless Minds<\/a>, a business coaching consultancy dedicated to optimizing performance and enriching culture within some of the world&#39;s top organizations. In 2014, he founded the&nbsp;<a href=\"https:\/\/whynotyoufdn.org\/\" target=\"_blank\">Why Not You Foundation<\/a>, a nonprofit dedicated to creating real and lasting change in the world by motivating and empowering youth. In 2019, Russell and his wife, singer Ciara, founded Why Not You Productions, a production company focused on scripted and unscripted film, television and digital content projects with inspiring and aspiring narratives and human interest stories. Russell also heads Seattle-based West2East, a brand management, creative content and production company.&nbsp;<\/p><p>Russell established the&nbsp;<a href=\"https:\/\/rwqbacademy.com\/\" target=\"_blank\">Russell Wilson Quarterback Academy<\/a>&nbsp;to develop quarterback prospects using a unique and cutting-edge curriculum based on his own experiences and knowledge. The quarterback school exists as an extension of the Russell Wilson Passing Academy (RWPA), a summer football camp for children of all ages. Since its inception in 2012, the RWPA has held camps in nine cities and worked with more than 9,000 children.<\/p>","slug":"russell_wilson","published_at":"2020-05-11 20:16:00","updated_at":"2020-06-16 16:42:24"}}