{"speaker":{"id":5965,"title":"","firstname":"Tracy","middleinitial":"","lastname":"Edwards","description":"Trailblazer","whotheyare":"Tracy Edwards MBE battled against the odds (and the sea) to become the first woman to win the Yachtsman of the Year Trophy.","whylisten":"<p>Tracy Edwards MBE gained international fame in 1990 as the skipper of the first all-female crew to sail around the world. The team raced in the 1989\/90 Whitbread Round the World Race. Her 58-foot yacht <em>Maiden<\/em> won two legs and came second overall in her class, the best result for a British boat since 1977 and unbeaten to this day. Edwards was awarded an MBE and became the first woman in its 34 year history to be awarded the Yachtsman of the Year Trophy. She paved the way for other women to follow. She published the book&nbsp;<em><a href=\"https:\/\/geni.us\/kreDL\" target=\"_blank\">Maiden<\/a>&nbsp;<\/em>in 1990, and it became number one on <em>The&nbsp;Times <\/em>bestseller list for 19 weeks.<\/p><p>Following her success with <em>Maiden<\/em>, Edwards entered the Jules Verne Trophy in 1998, again with an all-female crew. This yachting trophy is for the fastest circumnavigation around the world with no stopping and no outside assistance. While on course to smash the record for more than half of their route, her team was thwarted when the mast snapped in treacherous seas off coast of Chile. During their attempt, Edwards and her team broke seven world records.<\/p><p>In 2014 <em>Maiden<\/em> was found rotting in the Seychelles. Edwards began raising funds in order to bring the yacht back to the UK. Thanks to the generous support of HRH Princess Haya bint Al Hussein, <em>Maiden<\/em> has been restored to her former glory. Now this iconic piece of British maritime history has embarked on a three-year world tour to raise funds for&nbsp;<a href=\"https:\/\/www.themaidenfactor.org\/\" target=\"_blank\">The Maiden Factor Foundation<\/a>, a funding&nbsp;project that empower girls through education.<\/p>","slug":"tracy_edwards","published_at":"2020-05-12 14:56:00","updated_at":"2020-07-03 01:40:42"}}