{"speaker":{"id":5967,"title":"","firstname":"Darria","middleinitial":"","lastname":"Long","description":"Emergency room physician","whotheyare":"Dr. Darria Long leverages the best of science to make lives healthier, better and easier. ","whylisten":"<p>By combining her life&#39;s work as an emergency room physician and a mom of two, Dr. Darria Long shares simple, evidence-based advice on physical and mental wellness from Western, Eastern and integrative medicine -- and the health guidance you&#39;d expect and trust from a close friend.<\/p><p>Long is a Clinical Assistant Professor at the University of Tennessee. She earned her medical degree from the University of Rochester School of Medicine, her residency in emergency medicine from Yale University School of Medicine where she was a Clinical Instructor and her MBA from Harvard Business School.<\/p><p>Long understands having too much to do in the most stressful of situations -- and too little time to do it. She quickly learned techniques to save time and lives. But when she developed autoimmune arthritis, she went from running daily to barely able to walk, and had her own wakeup call to find solutions for her own health challenges. Having turned around her own health, she now brings these same high-yield strategies her audiences every single day.<\/p><p>Long is a national spokesperson for the American College of Emergency Physicians and now a TV regular across national and international networks. She also is an author in the pre-eminent textbook of emergency medicine,&nbsp;<a href=\"https:\/\/www.amazon.com\/Harwood-Nuss-Clinical-Practice-Emergency-Medicine-dp-1451188811\/dp\/1451188811\/\" target=\"_blank\"><em>Harwood-Nuss Clinical Practice of Emergency Medicine<\/em><\/a>, as well as author of multiple medical research journal articles. She previously was an Instructor of Medicine at Harvard Medical School and served as SVP of Clinical Strategy at Sharecare, a leading health engagement website.<\/p><p>Long resides in Atlanta with her husband, renowned hand surgeon Dr. Bryce Gillespie, and their two children. She loves hiking with them, impromptu dance parties and squeezing any snuggle time she can.<\/p>","slug":"darria_long","published_at":"2020-05-12 23:33:00","updated_at":"2021-05-21 18:40:56"}}