{"speaker":{"id":5968,"title":"","firstname":"Georges C.","middleinitial":"","lastname":"Benjamin","description":"Executive Director, American Public Health Association","whotheyare":"One of the United States' most influential physician leaders, Georges C. Benjamin speaks passionately about the health issues that have the most impact on our nation today.","whylisten":"<p>Georges C. Benjamin, MD, is a health policy leader, practitioner and administrator and serves as the executive director of the American Public Health Association (APHA), the nation&#39;s oldest and largest organization of public health professionals, since 2002. He is a former secretary of health for the Maryland Department of Health and Mental Hygiene, where he oversaw the expansion and improvement of the state&#39;s Medicaid program. In April 2016 President Obama appointed him to the National Infrastructure Advisory Council, a council that advises the President on how best to assure the security of the nation&#39;s critical infrastructure.<\/p><p>An established administrator, author and orator, Benjamin started his medical career in 1981 in Tacoma, Washington, where he managed a 72,000-patient visit ambulatory care service as chief of the Acute Illness Clinic at the Madigan Army Medical Center and was an attending physician within the Department of Emergency Medicine. He then served as chief of emergency medicine at the Walter Reed Army Medical Center in Washington, D.C. After leaving the Army, he chaired the Department of Community Health and Ambulatory Care at the District of Columbia General Hospital. He was promoted to acting commissioner for public health for the District of Columbia and later directed one of the busiest ambulance services in the nation as interim director of the Emergency Ambulance Bureau of the District of Columbia Fire Department.<\/p><p>Benjamin is a graduate of the Illinois Institute of Technology and the University of Illinois College of Medicine. He is board-certified in internal medicine, a master of the American College of Physicians, a fellow of the National Academy of Public Administration, a fellow emeritus of the American College of Emergency Physicians and a member of the National Academy of Medicine. He serves on several nonprofit boards such as&nbsp;<a href=\"https:\/\/www.researchamerica.org\/\" target=\"_blank\">Research!America<\/a>, the Truth Foundation and the Reagan-Udall Foundation.<\/p>","slug":"georges_c_benjamin","published_at":"2020-05-14 16:24:00","updated_at":"2020-07-03 01:16:08"}}