{"speaker":{"id":5973,"title":"","firstname":"Marah J.","middleinitial":"","lastname":"Hardt","description":"Marine scientist and storyteller","whotheyare":"Marah J. Hardt keeps one foot wet in the field while the other wanders the crossroads of science, storytelling and strategy.","whylisten":"<p>The Director of Discovery at the nonprofit&nbsp;<a href=\"http:\/\/futureoffish.org\/\" target=\"_blank\">Future of Fish<\/a>, Dr. Marah J. Hardt works to identify solutions to the global overfishing crisis that focus on helping small scale fishers continue to make a living while leaving enough fish for the future. Firmly rooted in advancing environmental sustainability of the oceans along with social equity and economic prosperity of coastal communities, she has engaged in projects on breakthrough aquaculture, advancing traceability technology and the power of story to sell responsibly caught seafood.<\/p><p>Prior to her work with Future of Fish, Hardt spent five years as founder of&nbsp;<a href=\"http:\/\/www.oceanink.org\/OceanInk\/Home.html\" target=\"_blank\">OceanInk<\/a>, working as a consultant investigating coral reef health, fishery impacts, and ocean acidification. She was also a research fellow at Blue Ocean Institute, where she launched their climate change program, including an initiative to engage scientists and religious leaders in constructive conversation about halting climate change.<\/p><p>As a storyteller, Hardt seeks to peel back the shimmering surface of the sea to reveal the wonders that lie beneath -- and highlight the opportunities that exist for fostering a responsible and beneficial relationship between people and the ocean. Her work has been published in scientific journals, books, and popular magazines including <em>Scientific American<\/em> and <em>The American Prospect<\/em>. Her first book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Sex-Sea-Intimate-Connection-Sex-Changing\/dp\/1137279974\/ref=asap_bc?ie=UTF8\" target=\"_blank\"><em>Sex in the Sea<\/em><\/a> combines the timeless topic of sex with the timely issue of ocean conservation.<\/p><p> She received her PhD in marine science from Scripps Institution of Oceanography in 2007 and a B.A. in History of Science from Harvard University in 2000.&nbsp;<\/p><p>Outside of the office, Marah also spends a great deal of time these days wielding either a magic wand or light saber as a trustworthy sidekick to her two imaginative and highly energetic children. When not saving the world, she enjoys yoga, impromptu dance parties and always looks for the chance to slip beneath the waves to free dive in the blue. She lives on the Big Island of Hawaii with her husband and kids, and is forever grateful to call this beautiful, inspiring place home.<\/p>","slug":"marah_j_hardt","published_at":"2020-05-19 19:58:00","updated_at":"2021-04-22 16:42:53"}}