{"speaker":{"id":5979,"title":"","firstname":"Ethan","middleinitial":"","lastname":"Hawke","description":"Actor, writer, director","whotheyare":"\"Ethan Hawke has quietly emerged as perhaps our boldest and most distinctive screen actor,\" writes The New York Times.","whylisten":"<p>Ethan Hawke is a four-time Academy Award-nominated actor, writer and director whose career spans three decades. His prolific filmography includes <em>Dead Poets Society<\/em>; <em>Reality Bites<\/em>; <em>Gattaca<\/em>; <em>Training Day<\/em> (Academy Award and SAG nominations); <em>Before the Devil Knows You&#39;re Dead<\/em>; <em>Boyhood<\/em> (Academy Award, Golden Globe, SAG and BAFTA nominations); <em>Born to Be Blue<\/em>; <em>Maudie<\/em>; Richard Linklater&#39;s trilogy <em>Before Sunrise<\/em>, <em>Before Sunset<\/em> and <em>Before Midnight,&nbsp;<\/em>for which he received two Academy Award nominations as coscreenwriter; and 2018&#39;s <em>First Reformed<\/em>, for which he won Best Actor prizes from the Independent Spirit Awards, the New York Film Critics Circle, Los Angeles Film Critics Association and Gotham Awards.&nbsp;<\/p><p>In 2014, Hawke made his documentary filmmaking debut with <em>Seymour: An Introduction<\/em>, based on the legendary pianist and piano teacher Seymour Bernstein. He most recently directed, cowrote and produced the music biopic, <em>Blaze<\/em>, inspired by the life of Blaze Foley, released by IFC Films in 2018. <\/p><p>Hawke is also a Tony-nominated stage actor and appeared on Broadway five times, including the acclaimed revival of Sam Shepard&#39;s <em>True West<\/em>; Tom Stoppard&#39;s <em>The Coast of Utopia<\/em>; the title role in <em>Macbeth<\/em>; <em>Henry IV<\/em>; and <em>The Seagull<\/em>. He has appeared off-Broadway and regionally at BAM in <em>The Cherry Orchard<\/em> and <em>The Winter&#39;s Tale<\/em>&nbsp;and in <em>Buried Child <\/em>at Steppenwolf, among many others.<\/p><p>Hawke will make his television debut with the Showtime eight-part series <em>The Good Lord Bird<\/em>, based on the National Book Award-winning novel by James McBride, which he also cowrote and executive-produced. On screen, he will next be seen in Hirokazu Kore-eda&#39;s <em>The Truth<\/em> starring Catherine Deneuve and Juliette Binoche, released by IFC.<\/p><p>In addition to his acting career, Hawke has published several novels, including&nbsp;<a href=\"https:\/\/geni.us\/fszk8lX\" target=\"_blank\"><em>Ash Wednesday<\/em><\/a>,&nbsp;<a href=\"https:\/\/geni.us\/Ji8xiB2\" target=\"_blank\"><em>The Hottest State<\/em><\/a>, a graphic novel entitled&nbsp;<a href=\"https:\/\/geni.us\/NRMmX\" target=\"_blank\"><em>Indeh: A Story of the Apache Wars<\/em><\/a>&nbsp;and a young adult novel&nbsp;<em><a href=\"https:\/\/geni.us\/OAp1UA\" target=\"_blank\">Rules for a Knight<\/a>, <\/em>with more on the way.<\/p>","slug":"ethan_hawke","published_at":"2020-05-22 18:59:00","updated_at":"2020-07-23 14:54:03"}}