{"speaker":{"id":60,"title":"","firstname":"Charles","middleinitial":"","lastname":"Leadbeater","description":"Innovation consultant","whotheyare":"A researcher at the London think tank Demos, Charles Leadbeater was early to notice the rise of \"amateur innovation\" -- great ideas from outside the traditional walls, from people who suddenly have the tools to collaborate, innovate and make their expertise known.","whylisten":"<p>Charles Leadbeater&#39;s theories on innovation have compelled some of the world&#39;s largest organizations to rethink their strategies. A financial journalist turned innovation consultant (for clients ranging from the British government to Microsoft), Leadbeater noticed the rise of <strong>&quot;pro-ams&quot; -- passionate amateurs who act like professionals<\/strong>, making breakthrough discoveries in many fields, from software to astronomy to kite-surfing. His 2004 essay <a href=\"http:\/\/www.demos.co.uk\/publications\/proameconomy\" target=\"_blank\">&quot;The Pro-Am Revolution&quot;<\/a>   -- which <a href=\"http:\/\/nytimes.com\/\" target=\"_blank\"><em>The New York Times<\/em> <\/a> called one of the year&#39;s biggest global ideas -- highlighted the rise of this new breed of amateur. <br \/><br \/>Prominent examples  range from the mountain bike to the open-source operating system Linux, from Wikipedia to the <a href=\"http:\/\/www.jubileedebtcampaign.org.uk\/?lid=1\" target=\"_blank\">Jubilee 2000 campaign<\/a>, which helped persuade Western nations to cancel more than $30 billion in third-world debt. In his upcoming book, <em><a href=\"http:\/\/www.charlesleadbeater.net\/orange-buttons\/we-think.aspx\" target=\"_blank\">We-Think<\/a>,<\/em> <strong>Leadbeater explores how this emerging culture of mass creativity and participation could reshape companies and governments<\/strong>. A business reporter by training, he was previously an editor for the <em><a href=\"http:\/\/www.ft.com\/home\/us\" target=\"_blank\">Financial Times<\/a>,<\/em> and later, <a href=\"http:\/\/www.independent.co.uk\/\" target=\"_blank\"><em>The Independent<\/em><\/a>, where, with Helen Fielding, he developed the &quot;Bridget Jones&#39; Diary&quot; column. Currently, he is researching for <a href=\"http:\/\/www.charlesleadbeater.net\/orange-buttons\/atlas-of-ideas.aspx\" target=\"_blank\">Atlas of Ideas<\/a>, a program that is mapping changes in the global geography of science and innovation. <\/p>","slug":"charles_leadbeater","published_at":"2007-02-19 10:07:00","updated_at":"2015-07-13 18:28:28"}}