{"speaker":{"id":6010,"title":"","firstname":"Dr. Bernice","middleinitial":"","lastname":"King","description":"CEO, The King Center, Daughter of Dr. Martin Luther King, Jr.","whotheyare":"The daughter of Dr. Martin Luther King Jr., Dr. Bernice Albertine King is a connector, communicator, community builder and CEO of The King Center.","whylisten":"<p>Dr. Bernice Albertine King is the youngest daughter to the late civil rights leaders Dr. Martin Luther King, Jr. and Coretta Scott King. She was five years old when her father was assassinated in 1968. King answered the call to ministry at the age of seventeen when she gave an address advocating against the South African apartheid to the United Nations General Assembly in New York. In 1985 and again in 1986, she was arrested with her siblings while protesting against apartheid. In 1988, she gave her trial sermon at Ebenezer Baptist Church where both her father and grandfather served as pastors.<\/p><p>In 1990, King was ordained into the ministry, and she serves at New Birth Missionary Baptist Church in Lithonia, Georgia. She has coordinates women and family conferences as well as nonviolent conflict resolution conferences for college and university students. She has also led a class on race relations at Mississippi College in Jackson, Mississippi and taught a leadership development class. She is cofounder of Active Ministers Engaged in Nurturing (AMEN) and the chair of the national advisory committee on National King Week College and University Student Conference on Kingian Nonviolence.<\/p><p>King served as a law clerk in the Fulton County Juvenile Court system under Judge Glenda Hatchett, Georgia&#39;s first African American chief presiding justice of a state court and department head of one of the largest juvenile court systems in the country. She also served as a rehabilitation-outreach coordinator and counseled teens through the juvenile court system. She became a member of the State Bar of Georgia in 1992.<\/p><p>King is the author of <a href=\"https:\/\/geni.us\/JujV\" target=\"_blank\"><em>Hard Questions, Heart Answers: Sermons and Speeches<\/em><\/a>. She holds a degree in psychology from Spelman College. In 1990, she was the first official graduate of a joint degree receiving her masters of Divinity and J.D. degrees from Emory Candler School of Theology and Emory University Law School. She has also received an honorary Doctorate of Divinity degree from Wesley College.<\/p>","slug":"bernice_albertine_king","published_at":"2020-06-02 21:20:00","updated_at":"2020-06-03 21:58:06"}}