{"speaker":{"id":6020,"title":"","firstname":"Anne","middleinitial":"","lastname":"Pasternak","description":"Director, Brooklyn Museum","whotheyare":"For more than thirty years, Anne Pasternak has devoted her career to engaging broad audiences with the limitless power of art to move, motivate and inspire. ","whylisten":"<p>Since 2015, Anne Pasternak has served as the Shelby White and Leon Levy Director of the Brooklyn Museum, one of the oldest and largest fine arts institutions in the nation. As a staunch advocate for the civic and democratic roles our cultural and educational institutions can play, she is committed to projects that demonstrate the crucial links between art and social justice.<\/p><p>During her time at the Brooklyn Museum, Pasternak has focused on strengthening the museum as a center for the visual arts that is courageous, pioneering and global. Through her leadership, she has expanded exhibitions, educational and public programs, and fostered special exhibitions, including <em>The Legacy of Lynching: Confronting Racial Terror in America;<\/em>&nbsp;<em>We Wanted a Revolution: Black Radical Women, 1965&ndash;85;<\/em>&nbsp;<em>Georgia O&rsquo;Keeffe: Living Modern;<\/em>&nbsp;<em>David Bowie is;<\/em>&nbsp;<em>Soul of a Nation: Art in the Age of Black Power;<\/em>&nbsp;and <em>Frida Kahlo: Appearances Can Be Deceiving<\/em>. These initiatives build the foundations for the Brooklyn Museum&#39;s new strategic plan to further the museum&#39;s mission to create inspiring encounters with art and engage the audiences the issues of today.<\/p><p>Prior to joining the Brooklyn Museum, Pasternak served as the president and artistic director of Creative Time for two decades, where she initiated projects that gave artists opportunities to respond to political and environmental challenges, while also expanding their practice and work globally. She collaborated with hundreds of artists, including Nick Cave, Paul Chan, Jenny Holzer and Kara Walker, commissioning and presenting works that ranged from sculptural installations in Grand Central Station&#39;s Vanderbilt Hall to skywriting over Manhattan, as well as Tribute in Light, the twin beacons of light that illuminated the sky above the former World Trade Center site, and continue to be presented on the anniversaries of 9\/11.<\/p>","slug":"anne_pasternak","published_at":"2020-06-15 14:32:00","updated_at":"2020-07-06 16:23:17"}}