{"speaker":{"id":6021,"title":"","firstname":"Darren","middleinitial":"","lastname":"Walker","description":"President, Ford Foundation","whotheyare":"Darren Walker is a leader in the nonprofit and philanthropic sectors.","whylisten":"<p>Darren Walker is president of the&nbsp;<a href=\"https:\/\/www.fordfoundation.org\/\" target=\"_blank\">Ford Foundation<\/a>, a 13-billion-dollar international social justice philanthropy. He is a member of Governor Cuomo&#39;s Reimagining New York Commission and cochair of NYC Census 2020. He chaired the philanthropy committee that brought a resolution to the city of Detroit&#39;s historic bankruptcy. Under his leadership, the Ford Foundation became the first nonprofit in US history to issue a one-billion-dollar designated social bond in US capital markets for proceeds to strengthen and stabilize nonprofit organizations in the wake of COVID-19.&nbsp;<\/p><p>Before joining Ford, Walker&nbsp;was vice president at Rockefeller Foundation, overseeing global and domestic programs. In the 1990s, he was COO of the Abyssinian Development Corporation, Harlem&#39;s largest community development organization.<\/p><p>Walker cochairs New York City&#39;s Mayoral Advisory Commission on City Art, Monuments, and Markers and has served on the Independent Commission on New York City Criminal Justice and Incarceration Reform and the UN International Labour Organization Global Commission on the Future of Work. He cofounded both the US Impact Investing Alliance and the Presidents&#39; Council on Disability Inclusion in Philanthropy. He serves on many boards, including Lincoln Center for the Performing Arts, the National Gallery of Art, Carnegie Hall, the High Line, the Committee to Protect Journalists and the Smithsonian National Museum of African American History &amp; Culture. In the summer of 2020, he was appointed to the boards of Square and Ralph Lauren. He is a member of the Council on Foreign Relations, the American Academy of Arts and Sciences and is the recipient of 16 honorary degrees and university awards, including Harvard University&#39;s W.E.B. Du Bois Medal.<\/p><p>Educated exclusively in public schools, Walker&nbsp;was a member of the first Head Start class in 1965 and received BA, BS and JD degrees from the University of Texas at Austin. He has been included on numerous leadership lists: <em>Time<\/em>&#39;s annual 100 Most Influential People, <em>Rolling Stone<\/em>&#39;s 25 People Shaping the Future, <em>Fast Company<\/em>&#39;<em>s<\/em> Most Creative People in Business, <em>Ebony<\/em>&#39;s Power 100 and <em>Out <\/em>magazine&#39;s Power 50.<\/p>","slug":"darren_walker","published_at":"2020-06-15 15:28:00","updated_at":"2020-07-09 19:13:07"}}