{"speaker":{"id":6028,"title":"","firstname":"Ofer","middleinitial":"","lastname":"Levy","description":"Physician and scientist","whotheyare":"Ofer Levy uses new technologies and the principles of precision medicine to develop tailored vaccines to protect the vulnerable, such as the young and the elderly, from infection.","whylisten":"<p>Ofer Levy MD, PhD, brings precision medicine principles to vaccine research by building collaborative, multi-disciplinary international teams that create innovative vaccines tailored to the specific needs of vulnerable populations.&nbsp;<\/p><p>Together with his colleagues, Levy has developed unique, blood-based systems that enable study of human immunity outside the body. Using these tools, the team discovered that the human immune system changes markedly with age, revealing the need to develop vaccines optimized to protect specific populations at high risk of infection such as the young or elderly.<br \/>&nbsp;<br \/>He is the Director of the Precision Vaccines Program, staff physician in the Division of Infectious Diseases at Boston Children&rsquo;s Hospital and Professor of Pediatrics at Harvard Medical School in Boston, MA. He is currently leading an NIH\/NIAID-funded Human Immunology Project Consortium center, which is working to define molecular mechanisms of vaccine protection in the very young. His latest research projects also include the discovery and development of adjuvants, small molecules that boost immune responses and can be used to create age-specific vaccines. <\/p><p>Dr. Levy and the Precision Vaccines team are now working on adjuvant-boosted vaccines to provide protection against COVID-19, influenza, HIV, respiratory syncytial virus (RSV), pertussis (whooping cough) and opioid use disorder\/overdose. He is the author of over 150 peer-reviewed scientific articles and has been featured on multiple news outlets, including CNN, FOX News, Scientific American and Nature Outlook.<\/p>","slug":"ofer_levy","published_at":"2020-06-17 21:38:00","updated_at":"2020-06-18 14:52:26"}}