{"speaker":{"id":6037,"title":"","firstname":"Dwinita","middleinitial":"","lastname":"Mosby Tyler","description":"Equity advocate","whotheyare":"Dwinita Mosby Tyler specializes in the development and delivery of leadership, equity, diversity, cultural responsiveness and inclusion training programs and strategies.","whylisten":"<p>Dr. Dwinita&nbsp;Mosby Tyler is the Chief Catalyst and Founder of The Equity Project -- a consulting firm supporting organizations and communities in building diversity, equity and inclusion strategies -- as well as The HR Shop, a human resources firm designed to support non-profits and small businesses. <\/p><p>She is the former Senior Vice President and Chief Inclusion Officer for Children&rsquo;s Hospital Colorado -&ndash; the first African-American woman to hold that position in the organization&#39;s 100+ year history. She is also the former Executive Director of the Office of Human Resources for the City and County of Denver &ndash;- the first African-American woman to hold that position in the 63+ year history of the agency.<\/p><p>Dr. Mosby Tyler, a consultant accredited by the Georgetown University National Center for Cultural Competence and recipient of the Cornell University Diversity &amp; Inclusion certification, is nationally recognized for her equity work with non-profit, community, government and corporate organizations.&nbsp; has received many local and national awards for her service and leadership accomplishments including recognition from U.S. Department of Health And Human Services, U.S. Department of Agriculture and Human Rights Campaign.<\/p><p>She holds a doctorate in the field of Organizational Leadership from the University of Colorado, a Master of Arts degree in Management from Webster University and a Bachelor of Science degree in Education from the University of Alabama.&nbsp;&nbsp;<\/p><div><br \/><\/div><p>&nbsp;<\/p>","slug":"nita_mosby_tyler","published_at":"2020-06-25 17:18:00","updated_at":"2021-10-25 21:25:32"}}