{"speaker":{"id":6041,"title":"","firstname":"William \"Sandy\"","middleinitial":"","lastname":"Darity","description":"Economist","whotheyare":"William A. \"Sandy\" Darity Jr. is the Samuel DuBois Cook Professor of Public Policy, African and African American Studies and Economics and the director of the Samuel DuBois Cook Center on Social Equity at Duke University.","whylisten":"<p>William &quot;Sandy&quot; Darity&#39;s research focuses on inequality by race, class and ethnicity, stratification economics, schooling and the racial achievement gap, North-South theories of trade and development, skin shade and labor market outcomes, the economics of reparations, the Atlantic slave trade and the Industrial Revolution, the history of economics and the social psychological effects of exposure to unemployment.<\/p><p>Darity has served as chair of the Department of African and African American Studies and was the founding director of the Research Network on Racial and Ethnic Inequality at Duke. Previously he served as director of the Institute of African American Research, director of the Moore Undergraduate Research Apprenticeship Program, director of the Undergraduate Honors Program in economics and director of Graduate Studies at the University of North Carolina at Chapel Hill.<\/p><p>Darity was a visiting scholar at the Russell Sage Foundation (2015-2016), a fellow at the Center for Advanced Study in the Behavioral Sciences (2011-2012) at Stanford, a fellow at the National Humanities Center (1989-90) and a visiting scholar at the Federal Reserve&#39;s Board of Governors (1984). He received the Samuel Z. Westerfield Award in 2012 from the National Economic Association, the organization&#39;s highest honor, Politico 50 recognition in 2017 and an award from Global Policy Solutions in 2017. He is former president of the National Economic Association and the Southern Economic Association. He has taught at Grinnell College, the University of Maryland at College Park, the University of Texas at Austin, Simmons College and Claremont-McKenna College.&nbsp;<\/p><p>Darity has served as editor-in-chief of the latest edition of the International Encyclopedia of the Social Sciences, (Macmillan Reference, 2008) and as an associate editor of the 2006 edition of the Encyclopedia of Race and Racism (2013). His most recent book, coauthored with A. Kirsten Mullen, is&nbsp;<a href=\"https:\/\/geni.us\/7r2VQV\" target=\"_blank\"><em>From Here to Equality: Reparations for Black Americans in the 21st Century<\/em><\/a>&nbsp;(2020). Previous books include&nbsp;<em><a href=\"https:\/\/geni.us\/TRw3O\" target=\"_blank\">For-Profit Universities: The Shifting Landscape of Marketized Education<\/a>,&nbsp;<\/em>coedited with Tressie McMillan Cottom (2010),&nbsp;<em><a href=\"https:\/\/geni.us\/Y1chO\" target=\"_blank\">Economics, Economists, and Expectations: Microfoundations to Macroapplications<\/a>&nbsp;<\/em>coauthored with Warren Young and Robert Leeson (2004) and&nbsp;<a href=\"https:\/\/geni.us\/ycIdBr\" target=\"_blank\"><em>Boundaries of Clan and Color: Transnational Comparisons of Inter-Group Disparity<\/em><\/a>&nbsp;coedited with Ashwini Deshpande (2003). He has published or edited 13 books and published more than 300 articles in professional outlets.<\/p>","slug":"william_sandy_darity","published_at":"2020-06-29 15:13:00","updated_at":"2020-07-14 19:51:55"}}