{"speaker":{"id":6073,"title":"","firstname":"Andri Snær","middleinitial":"","lastname":"Magnason","description":"Writer, poet","whotheyare":"Known for his unusual approach to everyday issues, Andri Snær Magnason is a storyteller and environmental activist.","whylisten":"<p>Andri Sn&aelig;r Magnason is an Icelandic writer and a father of four. His books and plays are published or performed in more than 40 languages. His newest book,&nbsp;<a href=\"https:\/\/geni.us\/1X1Yv\" target=\"_blank\"><em>On Time and Water<\/em><\/a>, is a work of narrative nonfiction, a tale of glaciers, grandmothers and holy cows, an attempt to grasp the issue of climate change through science, mythology and personal stories.<\/p><p>Magnason works in many art forms and genres, sometimes surprising his audience as he switches from poetry to children&#39;s literature to science fiction to nonfiction. His children&#39;s books,<em>&nbsp;<a href=\"https:\/\/www.amazon.com\/Story-Planet-Andri-Snaer-Magnason\/dp\/1609805062\" target=\"_blank\">The Story of the Blue Planet<\/a><\/em> and&nbsp;<a href=\"https:\/\/geni.us\/Rcyd\" target=\"_blank\"><em>The Casket of Time<\/em><\/a>, both winners of the Green Earth Book Award, have been used in hundreds of schools worldwide to teach environmental philosophy through play and storytelling.&nbsp;<\/p><p>In<em>&nbsp;<a href=\"https:\/\/www.amazon.com\/Dreamland-Self-Help-Manual-Frightened-Nation\/dp\/1904945562\" target=\"_blank\">Dreamland, a Self-Help Manual for a Frightened Nation<\/a><\/em>, he stepped forth as an activist, defending the highlands of Iceland from being drowned behind big dams to sell cheap energy to aluminum smelters. He also codirected the documentary film Dreamland.<\/p><p>Magnason has won the Icelandic Literary Award in all categories, the Philip K. Dick Honorary Mention for&nbsp;<a href=\"https:\/\/www.amazon.com\/LoveStar-Novel-Andri-Snaer-Magnason\/dp\/1609804260\" target=\"_blank\">LoveStar<\/a>&nbsp;and Children&#39;s Book of the Year in China. He has recently finished a feature length documentary film,&nbsp;<em>The Hero&#39;s Journey to the Third Pole -- a Bipolar Musical Documentary with Elephants<\/em>, and is working on an other, <em>Apausalypse<\/em>, looking into the great pause we are currently living in.<\/p>","slug":"andri_snaer_magnason","published_at":"2020-08-25 16:04:00","updated_at":"2020-10-23 20:50:25"}}