{"speaker":{"id":6074,"title":"","firstname":"Severn","middleinitial":"","lastname":"Cullis-Suzuki","description":"Environmental educator","whotheyare":"Severn Cullis-Suzuki is a lifelong environmental activist seeking justice for future generations.","whylisten":"<p>Severn Cullis-Suzuki has been an activist for intergenerational justice her entire life. Deeply concerned about the environment as a child, she started the Environmental Children&#39;s Organization with friends in fifth grade, focusing on education and fundraising, and culminating in speech at the UN Earth Summit in 1992, when she was 12 years old. Since then, she has continued to advocate for future generations, speaking extensively about our current generation&#39;s legacy and returning to our deepest human values and human scales. She is proud to work on the&nbsp;<a href=\"https:\/\/earthcharter.org\/\" target=\"_blank\">Earth Charter Commission<\/a>, the&nbsp;<a href=\"https:\/\/davidsuzuki.org\/\" target=\"_blank\">David Suzuki Foundation<\/a>&nbsp;board and the&nbsp;<a href=\"https:\/\/hginstitute.ca\/\" target=\"_blank\">Haida Gwaii Higher Education Society<\/a>&nbsp;founding board.&nbsp;<\/p><p>Passionate about the Slow movement, Cullis-Suzuki&nbsp;has worked with the Sloth Club of Japan on four speaking tours, focusing on the Slow movement and the post-Fukushima Million Mothers Movement, driven by mothers who refuse nuclear power.&nbsp;&nbsp;<\/p><p>Cullis-Suzuki is a communicator and collaborator, working with filmmakers in several documentaries (including Jean Paul Jaud&#39;s <em>Severn: La Voix de Nos Enfants<\/em>,&nbsp;<em>The Nature of Things <\/em>and&nbsp;<em>A View From the Summit<\/em>) as well as hosting two TV series (Suzuki&#39;s <em>Naturequest<\/em> and <em>Samaqan: Water Stories<\/em>).&nbsp;&nbsp;<\/p><p>Today Cullis-Suzuki&#39;s&nbsp;focus is the nexus of biodiversity, worldviews, economies, language, traditional knowledge and identity. She holds an MSc in ethnoecology from the University of Victoria and is currently a Vanier and Public scholar PhD candidate studying endangered language revitalization. She lives on Haida Gwaii, the archipelago of the Haida Nation off the west coast of Canada, with her husband Gudt&rsquo;aawt&rsquo;is Judson Brown and their sons Ganhlaans and Tiisaan.<\/p>","slug":"severn_cullis_suzuki","published_at":"2020-08-25 16:22:00","updated_at":"2020-09-29 00:00:23"}}