{"speaker":{"id":6075,"title":"","firstname":"Ernestine","middleinitial":"","lastname":"Leikeki Sevidzem","description":"Climate and gender activist","whotheyare":"Sevidzem Ernestine Leikeki has a drive to care for nature, foster women's empowerment and build future nature-lovers.","whylisten":"<p>Sevidzem Ernestine Leikeki is a founding member of Cameroon Gender and Environment Watch (CAMGEW) and works as social and environment officer of CAMGEW. In her community, she works to regenerate the kilum-ijim forest, advocates for women inclusion and leadership in natural resource management, women&#39;s right to education and employment and promotes entrepreneurship for local women. She believes women and girls are key actors of development in every community.<\/p><p>Working around the Kilum-Ijim forest area, Leikeki&nbsp;believes forest conservation can be best managed by communities themselves and can only be sustained by building the capacity of women and youths to protect nature. With apiculture as her strategy to fight bush fires and conserve the forest, she has trained more than 2,000 bee farmers and organized them into five cooperatives, in which three out of six executive members are women. With her community, she has planted more than 86,000 forest trees with bee farmers and other community members to increase bee forage and fight deforestation and climate change.<\/p><p>Leikeki empowers her community members to care for nature through environmental education, tree nursery development, tree planting, economic opportunities and building local industries from natural resources, especially bee farming and entrepreneurship training. She is known in her community for building community solidarity, provoking change, community conflict management and resolution.<\/p><p>Leikeki believes in dialogue, negotiation and peace. With her counseling skills, she assists more than 1,076 community members to make proactive decisions, take responsibility and focus on the possibility to make things work in their various spaces. She has a bachelors in Common law and certificates in Creative Collaboration and Systems Training, Lay Counseling Fundamentals of Starting and Running a Business, Agroforestry, Conflict Analysis, Conflict Negotiation and Management and Advocacy and Citizen Engagement.<\/p>","slug":"ernestine_leikeki_sevidzem","published_at":"2020-08-25 16:29:00","updated_at":"2020-10-07 21:57:40"}}