{"speaker":{"id":608,"title":"","firstname":"Morgan","middleinitial":"","lastname":"Spurlock","description":"Filmmaker","whotheyare":"Morgan Spurlock makes documentary film and TV that is personal, political -- and, above all, deeply empathetic.","whylisten":"<p>Though it was as high-concept as any reality-TV show, Morgan Spurlock&#39;s 2004 film&nbsp;<a href=\"http:\/\/geni.us\/supersizeme\" target=\"_blank\"><em>Super Size Me<\/em><\/a>&nbsp;was something else entirely: a critique of modern fast-feeding, wrapped in the personal story of a charming, curious host. And &quot;host&quot; can be taken literally: eating only McDonald&#39;s for 30 days straight, Spurlock went into a shocking physical and emotional decline, showing via his own body the truth about junk food. After this Oscar-nominated doc came Spurlock&#39;s three-seasons-long unscripted TV show, <em>30 Days<\/em>, based on another lifehack: Send a person to live, for 30 days, inside another worldview. Stories from <em>30 Days<\/em> are human, engaging, surprising: An anti-immigrant activist warms to a tight-knit family of border-crossers; an outsourced US engineer meets the Indian engineer who holds his old job; a former pro football player spends 30 days navigating the world in a wheelchair.<\/p><p>In 2008, Spurlock released&nbsp;<em><a href=\"http:\/\/geni.us\/whereintheworld\" target=\"_blank\">Where in the World Is Osama Bin Laden?<\/a>,<\/em>&nbsp;about his months-long trek through Afghanistan, Saudi Arabia, Egypt, Israel, Palestine ... following leads and interviewing people along the way. (In an interview, he guessed he got within 50 miles of Osama before winding up the hunt.) He was also part of a group-filmed version of <em>Freakonomics<\/em>. He wrote a book about his fast-food odyssey, called&nbsp;<a href=\"http:\/\/geni.us\/donteatthisbook\" target=\"_blank\"><em>Don&#39;t Eat This Book<\/em><\/a>&nbsp;-- while his wife, vegan chef Alex Jamieson, wrote a bestseller about the eight-week cleansing diet she put Spurlock on after he got supersized.<\/p><p>His latest film,&nbsp;<em><a href=\"http:\/\/geni.us\/greatestmovieever\" target=\"_blank\">The Greatest Movie Ever Sold<\/a>,<\/em>&nbsp;dives into the  mysterious world of brand sponsorship, a major influence on how pop culture is developed and shared. Almost  totally sponsored itself, the film was the first to be sold at Sundance 2011,  and, it&#39;s said, made a profit before it even opened. The film debuts in  US theaters on April 22, 2011.<\/p><p>&nbsp;<\/p>","slug":"morgan_spurlock","published_at":"2009-12-09 15:56:00","updated_at":"2015-09-26 02:26:27"}}