{"speaker":{"id":6086,"title":"","firstname":"Pia","middleinitial":"","lastname":"Heidenmark Cook","description":"CSO of Ingka Group (IKEA)","whotheyare":"With passion, drive and a team of sustainability professionals, Pia Heidenmark Cook leads the sustainability agenda for the Ingka Group.","whylisten":"<p>Pia Heidenmark Cook is chief sustainability officer at Ingka Group, the largest IKEA franchisee with 377 stores in 30 markets across the world. She leads the sustainability agenda for the Ingka businesses within retail, shopping centers and Ingka Investment, setting bold goals for the company and its more than 160,000 employees. To address key sustainability topics, she engages and collaborates with other companies, governmental bodies and NGOs, including the Cambridge Institute for Sustainable Leadership, Climate Week, the World Business Council for Sustainable Development and the&nbsp;World Economic Forum. For several years until 2017, she was cochair of Retailers Environmental Action Programme (REAP) together with a member of the EU Commission.<\/p><p>Joining IKEA in 2008, Heidenmark Cook was acting CSO and head of sustainability of IKEA Group retail and expansion, embedding sustainability into IKEA&#39;s retail operations. Before joining IKEA, she was VP of corporate social responsibility at the Rezidor Hotel Group and chaired the tourism branch of Prince of Wales Business Leader&#39;s Forum, a membership organization for major international hotel brands. Since 1996, she&#39;s worked with, lectured on and studied sustainability topics across academia, consultancy and business. She holds a Technical Licentiate degree, an MSc in environmental management from the University of Lund and a MSc in international business administration and economics from Uppsala University, Sweden. She has lived in France and Belgium, and now lives in Sweden with her husband and two daughters.<\/p>","slug":"pia_heidenmark_cook","published_at":"2020-08-31 17:40:00","updated_at":"2020-10-09 20:25:21"}}