{"speaker":{"id":6088,"title":"","firstname":"Myles","middleinitial":"","lastname":"Allen","description":"Climate science scholar","whotheyare":"Myles Allen studies how human activities and natural drivers contribute to changes in global climate and risks of extreme weather.","whylisten":"<p>Recently described by the BBC as &quot;the physicist behind net zero,&quot; Myles&nbsp;Allen developed the methods used by the Intergovernmental Panel on Climate Change (IPCC) in 2001 to quantify the size of human influence on observed and projected changes in global temperature. He founded the&nbsp;<a href=\"https:\/\/www.climateprediction.net\/\" target=\"_blank\">climateprediction.net<\/a> project, enabling members of the public to volunteer computing resources to run the world&#39;s largest climate modeling experiments, and in 2003 he proposed how probabilities could be used to assign responsibility for individual extreme weather events. In 2010 he was awarded the Appleton Medal and Prize from the Institute of Physics &quot;for his important contributions to the detection and attribution of human influence on climate and quantifying uncertainty in climate predictions.&quot;<\/p><p>At a conference in 2005, Allen first proposed the concept of a global carbon budget: the idea that peak warming is determined by the total amount of carbon dioxide we emit into the atmosphere before emissions are reduced to net zero, not the amount we emit in any given year or the eventual long-term atmospheric concentration. He has been working on the implications for climate policy ever since, most recently as coordinating lead author for the 2018 IPCC Special Report on 1.5 degrees, and has long been a proponent of fossil fuel producers taking responsibility for cleaning up after the products they sell, rather than placing the onus on relatively powerless consumers.<\/p><p>Allen&nbsp;works and lectures in the School of Geography and the Environment and the Department of Physics, University of Oxford. He is a Fellow of Linacre College and is married to Professor Irene Tracey, a world-leading neuroscientist and warden of Merton College. They have three wonderful children and recently acquired a lockdown puppy.<\/p>","slug":"myles_allen","published_at":"2020-08-31 18:20:00","updated_at":"2020-10-08 23:00:25"}}