{"speaker":{"id":6094,"title":"","firstname":"Christiane-Marie","middleinitial":"","lastname":"Abu Sarah","description":"World historian and conflict resolution specialist","whotheyare":"By traversing the globe and digging through archives to recover records of aggression, radicalization and conflict, Christiane-Marie Abu Sarah educates and trains audiences in innovative dispute management techniques. ","whylisten":"<div>On a mission to recover the lost police confessions, trial records, diaries and manifestos of activists who participated in violent attacks, Christiane-Marie Abu Sarah is a behavioral historian who explores how ordinary individuals make extraordinary decisions. In pursuit of records of human aggression and conflict, she has traversed the globe, digging through archives and interviewing militants in Iraq, Syria, Israel&ndash;Palestine, Egypt, Cuba, the Balkans, Northern Ireland and Vietnam.<\/div><div><br \/><\/div><div>While her work circles the globe, Dr. Abu Sarah&rsquo;s goal is to raise awareness at home about how everyday habits feed social conflict. From 2009&ndash;2012, she was a Research Associate at the Center for World Religions, Diplomacy, and Conflict Resolution (CRDC) in Arlington, Virginia. Today, she directs the Center for Behavioral and Cognitive History (BACH), where she uses history to educate students and the general public on polarization, emotions and dispute management techniques.&nbsp;<\/div><div><br \/><\/div><div>In addition to her engagement in various projects targeting diversity education and conflict resolution, Dr. Abu Sarah is Assistant Professor of History at Erskine College, and Managing Editor of the peer-reviewed journal <em>al-ʿUṣūr al-Wusṭā (The Journal of Middle East Medievalists)<\/em>. She is currently finishing a book manuscript and digital history project entitled &ldquo;To Drink a Cup of Fire: Morality Tales and Moral Emotions in Egyptian, Algerian, and French Anti-Colonial Activism.&rdquo;<\/div>","slug":"christiane_marie_abu_sarah","published_at":"2020-09-02 21:18:00","updated_at":"2020-09-03 15:16:42"}}