{"speaker":{"id":61,"title":"","firstname":"Robert","middleinitial":"","lastname":"Wright","description":"Journalist, philosopher","whotheyare":"The best-selling author of \"Nonzero,\" \"The Moral Animal\" and \"The Evolution of God,\" Robert Wright draws on his wide-ranging knowledge of science, religion, psychology, history and politics to figure out what makes humanity tick -- and what makes us moral. ","whylisten":"<p>Author Robert Wright thinks the crises the human species now faces are moral in nature, and that our salvation lies in the intelligent pursuit of self-interest. In his book <em><a href=\"http:\/\/www.nonzero.org\/\" target=\"_blank\">Nonzero<\/a>,<\/em> Wright argues that life depends on a non-zero-sum dynamic. While a zero-sum game depends on a winner and loser, all parties in a non-zero-sum game win or lose together, so players will more likely survive if they cooperate. <strong>This points to an optimistic future of ultimate cooperation among humans -- if we recognize the game.<\/strong> <br \/><br \/>Well-respected for his erudition and original thinking (Bill Clinton hailed him as a genius), Wright draws from multiple disciplines -- including science, religion, history and politics -- in his search for <strong>big-picture perspectives on today&#39;s problems<\/strong>, particularly terrorism, while offering guarded hope for where we might be headed. A <a href=\"http:\/\/www.newamerica.net\/about\/current_fellows\" target=\"_blank\">Schwartz Senior Fellow<\/a>  at the <a href=\"http:\/\/www.newamerica.net\/\" target=\"_blank\">New America Foundation<\/a>, Wright also hosts an interview series with celebrated thinkers at <a href=\"http:\/\/meaningoflife.tv\/\" target=\"_blank\">Meaningoflifetv.com<\/a>.<\/p><p>Wright&#39;s newest book, <a href=\"http:\/\/evolutionofgod.net\/\" target=\"_blank\"><em>The Evolution of God<\/em><\/a>, explores the history of the idea of God in the three Abrahamic religions, Judaism, Islam and Christianity. <\/p>","slug":"robert_wright","published_at":"2007-02-19 10:12:00","updated_at":"2015-07-13 18:26:23"}}