{"speaker":{"id":610,"title":"","firstname":"Elizabeth","middleinitial":"","lastname":"Pisani","description":"Author","whotheyare":"In Elizabeth Pisani's latest book, she explores the \"improbable nation\" of Indonesia.","whylisten":"In fast-emerging Asia there is one nation that, despite being the world&#39;s fourth most-populous (and the third most-populous democracy) and the largest Muslim country (with 210 million people who identify themselves as such), is also, as Elizabeth Pisani writes, &quot;probably the most invisible country in the world&quot;. Indonesia. An archipelago of over 17,000 islands that span a distance like that from New York to Alaska, with over 700 languages and a dynamic economy -- but which, puzzingly, doesn&#39;t really feature in the global imagination.<br \/><p>Pisani spent two years travelling 23,000 kilometers by boat, bus and motorbike through Indonesia, a place that has fascinated and maddened her since she first lived there over two decades ago. Her portrait of the country, the recent&nbsp;<em><a href=\"http:\/\/geni.us\/indonesiaetc\" target=\"_blank\">Indonesia Etc.: Exploring the Improbable Nation<\/a>,<\/em>&nbsp;reveals the archipelago&#39;s complexity and contradictions, a fascinating diversity that &quot;is not just geographic and cultural: different groups are essentially living at different points in human history, all at the same time.&quot; <\/p><p>An alumna of various government health agencies, Pisani became an assumption-busting independent researcher and analyst, polling  transgendered sex workers, drug addicts and others to illuminate the  surprising (and often ignored) demographics that belie traditional  studies.<\/p><p>Pisani is fearlessly outspoken on the global failure to understand and  manage the realities of AIDS, decrying the tangled roles that money,  votes, and media play in the public health landscape. She shows how  politics and &quot;morality&quot; have hogtied funding, and advocates for putting  dollars where they can actually make a difference. As the <em>Globe and Mail  <\/em>wrote: &ldquo;Pisani is lucid, colourful, insightful and impatient.&rdquo; <\/p>","slug":"elizabeth_pisani","published_at":"2009-12-09 15:59:00","updated_at":"2015-10-01 15:34:09"}}