{"speaker":{"id":6101,"title":"","firstname":"Lisa","middleinitial":"","lastname":"Jackson","description":"Environment and social VP at Apple","whotheyare":"Lisa Jackson is an environmental and social impact leader who has dedicated her career to building a greener and more just economy.","whylisten":"<p>Lisa Jackson is Apple&#39;s Vice President of Environment, Policy and Social Initiatives, leading the company&#39;s environmental initiatives, global community education programs, product accessibility efforts, corporate giving, racial equity and justice efforts, and worldwide government affairs. Before leading environmental efforts at Apple, Jackson was the first African American to be appointed the administrator of the US Environmental Protection Agency (EPA), by President Barack Obama. While administrator, she prioritized reducing greenhouse gases, protecting air and water quality, preventing exposure to toxic contamination and championing environmental justice by expanding environmental outreach to underserved communities and communities of color.<\/p><p>Since Jackon&#39;s arrival in 2013, Apple has transformed its environmental footprint and become a pioneer in clean energy, recycling and green technology. Under her leadership, the company reached carbon neutrality for its corporate emissions and now powers its operations around the world with 100-percent renewable energy. This year, the company announced its most ambitious target yet, pledging that every Apple device will be produced with net-zero carbon emissions by 2030. Building on her environmental work at Apple and her lifelong advocacy for environmental justice, Apple CEO Tim Cook recently tapped her to lead Apple&#39;s Racial Equity and Justice Initiative. This initiative was launched in the aftermath of the killings of George Floyd, Breonna Taylor and other victims of police violence, and it will focus on racial equity efforts that address education, economic equality and criminal justice reform.<\/p>","slug":"lisa_jackson","published_at":"2020-09-08 18:05:00","updated_at":"2020-10-21 14:34:12"}}