{"speaker":{"id":6103,"title":"","firstname":"Nana","middleinitial":"","lastname":"Firman","description":"Carbon footprint activist","whotheyare":"Nana Firman wants to unite the world behind a commitment to sustainability and environmental justice.","whylisten":"<p>Nana Firman has nearly two decades of experience in advocacy and awareness-raising on environmental degradation and the climate crisis, advocating for urban sustainability and developing green economy concepts and strategies. She&#39;s currently the Muslim outreach director for GreenFaith, a global multi-faith and spiritual environment and climate action network.&nbsp;She previously worked with the World Wildlife Fund in Indonesia, directing the green recovery efforts in the wake of 2004 earthquake and tsunami and later developing a sustainable city initiative as part of urban climate adaptation and mitigation.<\/p><p>Upon moving to the US from her native Indonesia in 2012, Firman&nbsp;has been involved in encouraging the American Muslim community to practice an eco-friendly lifestyle, which prompted her to initiate the Green Mosque Project for Islamic Society of North America. In 2015, she organized the Islamic Declaration on Global Climate Change and later cofounded the Global Muslim Climate Network, which calls all Muslim nations to transition from fossil fuel to clean energy as the basis of development.<\/p><p>In 2015, Firman was named a White House &quot;Champion of Change&quot; by President Barack Obama. Recently, she received the Alfredo Sirkis Memorial Green Ring Award for climate activism excellence from the former Vice President Al Gore. She holds a bachelor&#39;s degree in industrial design from University of Bridgeport, Connecticut, and a master&#39;s degree in urban design from the Pratt Institute in New York. She lives in California with her husband, Jamal Yusuf Ali, a US Navy veteran and entrepreneur.<\/p>","slug":"nana_firman","published_at":"2020-09-08 18:11:00","updated_at":"2020-10-09 16:04:13"}}