{"speaker":{"id":6109,"title":"","firstname":"Chris","middleinitial":"","lastname":"Hemsworth","description":"Actor","whotheyare":"An active philanthropist, Chris Hemsworth is passionate about ocean conservation and finding solutions to climate change.","whylisten":"<p>Chris Hemsworth is one of the most popular and sought-after actors in Hollywood. After his massive success in the Marvel Universe franchise, Hemsworth teamed up with the Russo Brothers again for the Netflix original film <em>Extraction,<\/em> making history for the streaming service. Bringing in 90 million viewers in the first four weeks, the film became the most watched original movie the streaming service has ever seen. Of the six Marvel and Global Avengers franchise films Hemsworth has starred in, <em>Avengers: Endgame<\/em>&nbsp;remains one of the highest grossing movies of all time, accumulating more than $2.7 billion worldwide. Introduced as Thor in the 2011 eponymous film directed by Kenneth Branagh, Hemsworth will continue his legacy in <em>Thor: Love and Thunder<\/em> with director Taika Waititi and star alongside Natalie Portman and Tessa Thompson, in a feature scheduled to begin production soon.<\/p><p>Hemsworth is also set to star as renowned wrestler Hulk Hogan in a biopic with Academy Award-nominated director Todd Phillips, and in <em>National Geographic<\/em>&#39;s new series <em>Limitless<\/em>, where he will test the limits of the human body and explore the latest scientific research into health longevity.<\/p><p>A respected figure in the health and fitness realm, Hemsworth launched CENTR, a personalized digital health and fitness program in February 2019. The app brings the best hand-picked team of internationally renowned experts, including elite trainers, celebrity chefs, meditation teachers and well-being mentors to help users achieve their ultimate fitness goals.<\/p><p>Hemsworth&#39;s multifaceted career includes a starring role alongside Michael Shannon and Michael Pe&ntilde;a in <em>12 Strong<\/em>, produced by Jerry Bruckheimer, which tells the story of the first Special Forces team deployed to Afghanistan after 9\/11; and in Drew Goddard&#39;s&nbsp;<em>Bad Times at the El Royale<\/em>, with Jeff Bridges, Jon Hamm and Dakota Johnson.<\/p><p>Born and raised in Australia, where he began his acting career, Hemsworth is an active philanthropist, supporting the Australian Childhood Foundation. He is passionate about ocean conservation.<\/p>","slug":"chris_hemsworth","published_at":"2020-09-08 18:15:00","updated_at":"2020-10-30 14:50:09"}}