{"speaker":{"id":6115,"title":"","firstname":"Kara","middleinitial":"","lastname":"Hurst","description":"Head of worldwide sustainability at Amazon","whotheyare":"Kara Hurst leads the development and evolution of sustainability and social responsibility at Amazon.","whylisten":"<p>Kara Hurst leads Worldwide Sustainability at Amazon, covering multiple areas across the environmental and social sectors: renewable energy, energy efficiency, sustainable transportation, customer packaging experience, product sustainability, circular economy and waste reduction initiatives, social responsibility and responsible sourcing, sustainability science and innovation, and environmental compliance.&nbsp;<\/p><p>Prior to joining Amazon, Hurst&nbsp;was CEO of The Sustainability Consortium (TSC), a multi-sector group across academia, the retail industry and the public sector. TSC was named one of <em>Scientific American<\/em>&#39;s &quot;Top Ten World Changing Ideas&quot; of 2012. For 11 years before that, Hurst worked as vice president of BSR, where she built several global industry practices and led BSR&#39;s New York and Washington, DC offices, as well as the global partnership practice with governments, multi-laterals and foundations. Hurst also cofounded the Electronic Industry Citizenship Coalition (EICC, now the Responsible Business Alliance) and worked in Silicon Valley as executive director of the public-private venture OpenVoice, building out early teen channel content for AOL and others. In her early career, she held roles at the Children&#39;s Health Council, leading interdisciplinary educational and development programs, at the Urban Institute as a research lead in the public finance and housing division and in the offices of two elected officials -- Mayor Willie Brown of San Francisco and the late Senator Daniel Patrick Moynihan in New York. Hurst holds a BA from Barnard College of Columbia University and an MPP from the University of California, Berkeley.<\/p>","slug":"kara_hurst","published_at":"2020-09-11 15:01:00","updated_at":"2020-10-02 20:16:02"}}