{"speaker":{"id":6121,"title":"","firstname":"Wale","middleinitial":"","lastname":"Elegbede","description":"Strategist, change-maker, social justice advocate","whotheyare":"Wale Elegbede is a strategist who believes good, ethical leaders have a responsibility to bring positive change to their communities, organizations and families.","whylisten":"<p>Wale Elegbede serves as director of strategy management services at Mayo Clinic in Minnesota, where he oversees the Innovate delivery team, develops and executes strategy, project management, program management and business analysis. He is president of the National Association for the Advancement of Colored People (NAACP), Rochester, Minnesota Branch; Olmsted County Human Rights Commissioner; and a&nbsp;<a href=\"https:\/\/www.uwlax.edu\/alumni\/lantern\/a-servant-leader\/\" target=\"_blank\">Rada Distinguished Alumni<\/a> of the University of Wisconsin La-Crosse. An expert in project management, Elegbede serves as&nbsp;<a href=\"https:\/\/www.pmi.org\/chapters\/lacrosse-rochester\" target=\"_blank\">President of the La Crosse-Rochester Project Management Institute<\/a> (PMI) chapter and is an instructor of graduate project management at Viterbo University. His experience includes overseeing major project initiatives for the largest home furniture manufacturer in the world and for Mayo Clinic, the number-one ranked hospital in the nation.&nbsp;<\/p><p>Elegbede grew up witnessing the appalling effects of prejudice and bias under autocratic rule. Born in Nigeria, he observed military rule, and while living in Togo, he experienced life under the domineering regime of President Gnassingb&eacute; Eyadema, who ruled Togo for 38 years until his death.<\/p><p>An interfaith leader, Elegbede is a founding member of the La Crosse Interfaith Shoulder to Shoulder Network, established to empower people of all faiths or no faith to&nbsp;<a href=\"https:\/\/lacrossetribune.com\/news\/local\/la-crosse-muslim-to-other-americans-we-are-part-of-you\/article_6fe120e2-1d21-54e2-8217-5a981efad3e1.html\" target=\"_blank\">end anti-Muslim sentiment, Islamophobia, bias and intolerance toward any group<\/a>. He, alongside others, helped to organize the &quot;La Crosse Stands Shoulder to Shoulder with Muslims, Immigrants and Refugees&quot; rally on February 3, 2017, where community members stood together in solidarity against the travel ban on mostly Muslim-majority countries. In 2019,&nbsp;<a href=\"https:\/\/lacrossetribune.com\/news\/local\/crime-and-courts\/racist-graffiti-spray-painted-on-la-crosse-business\/article_55c7e7ac-196b-5948-ba1b-598c0cb6f4a2.html\" target=\"_blank\">when a racist and Islamophic hate crime<\/a> occurred in La Crosse, Wisconsin, Elegbede led and galvanized local community response. He regularly speaks on leadership, community and social justice issues.<\/p>","slug":"wale_elegbede","published_at":"2020-09-14 15:25:00","updated_at":"2020-11-30 18:40:47"}}