{"speaker":{"id":6132,"title":"","firstname":"Gil","middleinitial":"","lastname":"Winch","description":"Psychologist, organizational consultant","whotheyare":"Gil Winch is a psychologist, organizational consultant and keynote speaker with 30 years of experience working with some of Israel's largest organizations.","whylisten":"<p>Gil Winch PhD has served as a personal consultant to CEOs and leaders such as the Israel National Chief of Police. After learning about the extreme worldwide unemployment of people with severe disabilities, he began researching and developing a unique managerial model to enable people with disabilities achieve regular productivity in free-market businesses for regular market wages. Wanting to build a proving ground for the model, he founded&nbsp;<a href=\"https:\/\/eng.callyachol.co.il\/\" target=\"_blank\">CY<\/a> in 2008, an outsourcing services call center and for-profit social business staffed and managed by severely disabled people as well as non-disabled individuals from other marginalized populations.<\/p><p>For the past 12 years, CY&#39;s hundreds of employees have proven that a managerial model and corporate culture focused on finding and nurturing hidden potential can help any company win with underdogs, benefitting employers and employees alike. In 2011, Winch was chosen by <em>The Marker<\/em>, Israel&#39;s largest business newspaper, as one of the 100 most influential people in the Israeli economy. Over its history, CY has been covered in academic publications, featured in a United Nations brief, been visited by representatives of 70 countries and won numerous awards and recognitions, including a commendation from Shimon Peres, the late President and the Excellence Award in Social Enterprise from the Knesset (Israeli Parliament).<\/p><p>Winch lives with his wife and two daughters and is the identical twin brother of&nbsp;<a href=\"https:\/\/www.ted.com\/speakers\/guy_winch\" target=\"_blank\">Guy Winch<\/a>, who has three TED Talks of his own.<\/p>","slug":"gil_winch","published_at":"2020-09-15 16:12:00","updated_at":"2020-11-18 19:29:36"}}