{"speaker":{"id":6139,"title":"","firstname":"Patrice","middleinitial":"","lastname":"Gordon","description":"Executive coach, personal development advocate","whotheyare":"Patrice Gordon's passion for people and helping them realize their full potential led her to a career in coaching.","whylisten":"<p>Patrice Gordon is a highly qualified executive coach and personal development advocate specialising in women&#39;s development programming and reverse mentoring. Her efforts on building an inclusive environment for all has been publicly recognised by Richard Branson.<\/p><p>Gordon currently supports women in travel, hospitality and leisure. She spearheaded the development of reverse mentoring at Virgin Atlantic, with the initial focus being how race and ethnicity impact development in the workplace. She is currently building the BAME network across Virgin Atlantic and the Virgin Group.<\/p><p>Gordon has coached leaders across FTSE 250 businesses and her commitment to helping others &quot;be their best&quot; places her among the most astute personal and business coaches in the field today. Originally training as a chartered accountant with PwC, she has developed financial and commercial acumen to rise expeditiously through the ranks. She now has over 10 years experience at a senior level in the commercial airline and logistics space across British Airways, Royal Mail and Virgin Atlantic.&nbsp;<\/p><p>Gordon most recently led the formation of the groundbreaking Joint Venture relationship between Virgin Atlantic, Delta and Air France KLM. She is a key member of commercial leadership team and a people advocate within the senior leadership group at Virgin Atlantic.&nbsp;<br \/>Her unique combination of strong business acumen and negotiating skills alongside her commitment to drive change has led her to be recognised as a EMpower Ethnic Minority Future Leader (2019) and in 2020 WeAreTheCity as a Rising Star within transport and logistics.<\/p>","slug":"patrice_gordon","published_at":"2020-09-15 20:02:00","updated_at":"2020-11-23 14:34:31"}}