{"speaker":{"id":6140,"title":"","firstname":"Morra","middleinitial":"","lastname":"Aarons-Mele","description":"Anxious overachiever","whotheyare":"Morra Aarons-Mele is a (mostly) happy, successful person. She also identifies as an extremely anxious overachiever, and she's working to normalize anxiety.","whylisten":"<p>Even during the best of times, Morra Aarons-Mele&nbsp;can be found hiding in a bathroom to avoid people, experiencing a panic attack before a flight or waiting for bad news to arrive. To normalize anxiety and help others manage theirs, she launched and hosts&nbsp;<a href=\"https:\/\/hbr.org\/2019\/09\/podcast-the-anxious-achiever\" target=\"_blank\"><em>The Anxious Achiever<\/em><\/a>&nbsp;podcast for HBR Presents, which was a 2020 Webby Awards Honoree and is a top 10 management podcast. She&#39;s passionate about helping people rethink the relationship between their mental health and their leadership.<\/p><p>In addition to her work on anxiety, Aarons-Mele founded the award-winning social impact agency&nbsp;<a href=\"https:\/\/www.wearewomenonline.com\/\" target=\"_blank\">Women Online<\/a>&nbsp;and created its database of female influencers, the Mission List. Before that, she worked in digital marketing and politics, helping Hillary Clinton log on for her first online chat and founding the digital public affairs team at Edelman, where she worked with Fortune 50 clients.<\/p><p>Aarons-Mele is also a prolific writer. Since 2004, she has covered the campaign trail, the White House, the lactation room and the office cubicle. Her book,&nbsp;<a href=\"https:\/\/geni.us\/qQOY\" target=\"_blank\"><em>Hiding in the Bathroom: How To Get Out There (When You&#39;d Rather Stay Home)<\/em><\/a>, was published by Dey Street Books in 2017. She has written for the <em>New York Times<\/em>, <em>Entrepreneur<\/em>, <em>Fast Company<\/em>, <em>Slate<\/em>, <em>InStyle<\/em>, <em>O<\/em>, the <em>Wall Street Journal<\/em>, <em>Forbes<\/em>&nbsp;and the <em>Guardian<\/em>.&nbsp;<\/p><p>Aarons-Mele holds degrees from the Harvard Kennedy School and Brown University. She and Nicco Mele live in Boston with their three children.<\/p>","slug":"morra_aarons_mele","published_at":"2020-09-15 20:27:00","updated_at":"2020-10-12 14:11:54"}}