{"speaker":{"id":6143,"title":"","firstname":"Gloria","middleinitial":"","lastname":"Steinem","description":"Feminist activist, writer","whotheyare":"Gloria Steinem is an award-winning journalist, writer, political activist and feminist organizer.","whylisten":"<p>Gloria Steinem was a founder of <em>New York<\/em> and <em>Ms.<\/em> magazines. In 1993, her concern with child abuse led her to coproduce an Emmy Award-winning TV documentary for HBO,&nbsp;<em>Multiple Personalities: The Search for Deadly Memories<\/em>. In 2016, she and Amy Richards coproduced a series of eight documentaries on violence against women around the world for VICELAND.<\/p><p>Steinem has cofounded several organizations, including the National Women&#39;s Political Caucus, the Ms. Foundation for Women, the Free to Be Foundation, the Women&#39;s Media Center and Equality Now. In 2013, she was awarded the Presidential Medal of Freedom by President Barack Obama, and received the Freedom Award from the National Civil Rights Museum in 2019. She is the subject of Julie Taymor&#39;s upcoming biopic,&nbsp;<em>The Glorias<\/em>.<\/p><p>Steinem is the author of many books, including&nbsp;<a href=\"https:\/\/geni.us\/88Nz\" target=\"_blank\"><em>The Truth Will Set You Free, But First It Will Piss You Off<\/em><\/a>,&nbsp;<a href=\"https:\/\/geni.us\/85e3BRT\" target=\"_blank\"><em>My Life on the Road<\/em><\/a>,&nbsp;<em><a href=\"https:\/\/geni.us\/AQPyBt\" target=\"_blank\">Revolution from Within<\/a>,<\/em>&nbsp;<a href=\"https:\/\/geni.us\/uKmW\" target=\"_blank\"><em>Outrageous Acts and Everyday Rebellions<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/geni.us\/GswFB\" target=\"_blank\"><em>As If Women Matter<\/em><\/a>. For her writing, she received the Front Page and Clarion awards, the National Magazine Award, the Lifetime Achievement in Journalism Award from the Society of Professional Journalists and the Society of Writers Award from the United Nations.<\/p>","slug":"gloria_steinem","published_at":"2020-09-21 22:46:00","updated_at":"2020-11-13 22:34:11"}}