{"speaker":{"id":6145,"title":"","firstname":"Hasan Kwame","middleinitial":"","lastname":"Jeffries","description":"Historian","whotheyare":"Hasan Kwame Jeffries teaches, researches and writes about the African American experience from a historical perspective. ","whylisten":"<div>Hasan Kwame Jeffries has chronicled the civil rights movement in the ten episode Audible Original series &ldquo;<a href=\"https:\/\/www.amazon.com\/Great-Figures-Civil-Rights-Movement\/dp\/B0843NKC83\" target=\"_blank\">Great Figures of the Civil Rights Movement<\/a>&rdquo; and has told the remarkable story of the original Black Panther Party in&nbsp;<a href=\"https:\/\/www.amazon.com\/Bloody-Lowndes-Civil-Rights-Alabamas\/dp\/0814743315\" target=\"_blank\">Bloody Lowndes: Civil Rights and Black Power in Alabama&rsquo;s Black Belt<\/a> <em>.<\/em><\/div><div><br \/><\/div><div>He has collaborated on several public history projects, and served as the lead scholar and primary scriptwriter for the $27 million renovation of the National Civil Rights Museum at the Lorraine Hotel in Memphis, Tennessee, the site of the assassination of Dr. Martin Luther King, Jr.<\/div><div><br \/><\/div><div>Dr. Jefrries regularly shares his expertise on African American history and contemporary Black politics through public lectures, op-eds and interviews with print, radio and television news outlets. He has also contributed to several documentary film projects as a featured on-camera scholar, including the Emmy nominated, four-hour PBS documentary&nbsp;<a href=\"https:\/\/www.pbs.org\/show\/black-america-mlk-and-still-i-rise\/\" target=\"_blank\"><em>Black America Since MLK: And Still I Rise<\/em><\/a>.<\/div><div><br \/><\/div><div>His commitment to teaching &ldquo;hard history&rdquo; led him to edit&nbsp;<a href=\"https:\/\/uwpress.wisc.edu\/books\/5572.htm\" target=\"_blank\"><em>Understanding and Teaching the Civil Rights Movement<\/em><\/a>, a collection of essays by leading civil rights scholars and teachers that explores how to teach civil rights history accurately and effectively, and to host the podcast &ldquo;Teaching Hard History,&rdquo; a production of the Southern Poverty Law Center&rsquo;s Teaching Tolerance division. He also helps school districts develop anti-racism programming and culturally responsive curricular content centered on social studies by conducting professional development workshops for teachers and administrators.<\/div><div><br \/><\/div><div>An associate professor of history in the Department of History at The Ohio State University, Dr. Jeffries takes great pride in opening students&rsquo; minds to new ways of understanding the past and the present. For his pedagogical creativity and effectiveness, he has received numerous awards, including Ohio State&rsquo;s Alumni Award for Distinguished Teaching, the university&rsquo;s highest commendation for teaching.<\/div><div><br \/><\/div><div>Hasan graduated from Morehouse College with a BA in history. He earned a PhD in American history with a specialization in African American history from Duke University.&nbsp;<\/div><div><br \/><\/div>","slug":"hasan_kwame_jeffries","published_at":"2020-09-23 23:31:00","updated_at":"2020-09-24 15:25:09"}}