{"speaker":{"id":6147,"title":"","firstname":"Priyanka","middleinitial":"","lastname":"Chopra Jonas","description":"Actor, producer, activist","whotheyare":"Priyanka Chopra Jonas is a multifaceted talent and one of the most recognized personalities in the world.","whylisten":"<p>Priyanka Chopra Jonas is the recipient of numerous awards as an actor and producer, with more than sixty international and Hollywood films to her credit. She made history as the first Indian-born actor to lead an American network TV series when she starred in the ABC dramatic series <em>Quantico<\/em>, winning two People&#39;s Choice awards for her work. She was featured on the cover of <em>Time<\/em> magazine&#39;s &quot;Time 100&quot; issue in which she was named one of the &quot;Most Influential People&quot; in the world and has been recognized as one of Forbes &quot;Most Powerful Women.&quot;<\/p><p>Chopra Jonas will next be seen in the Netflix features <em>We Can Be Heroes<\/em>, directed by Robert Rodriguez, and an adaptation of the Man Booker Prize-winning novel <em>The White Tiger<\/em>, which she also executive produced. She is currently in production for the Russo Brother&#39;s&nbsp;<em>Citadel,<\/em>&nbsp;<em>The Matrix 4<\/em>&nbsp;and&nbsp;<em>Where Does My Heart Beat Now<\/em>&nbsp;with Sony Pictures.&nbsp;<\/p><p>Chopra Jonas starred in and coproduced <em>The Sky is Pink<\/em>, an independent foreign language film that premiered as an official selection at the Toronto International Film Festival in 2019, and she is currently developing an untitled buddy comedy with Mindy Kaling and Dan Goor for Universal, which she will coproduce and star in. Under her production banner Purple Pebble Pictures, she is partnered with Amazon Studios on a First Look TV deal, where she will develop a slate of global content for the streamer. Purple Pebble Pictures is also partnered with ViacomCBS to create original content focused on diversity and inclusion for its entertainment and youth channels.<span style=\"white-space: pre\">\t<\/span><\/p><p>Chopra Jonas is a global UNICEF Goodwill Ambassador and also a Global Citizen ambassador. She is involved in a number of efforts to protect children&#39;s rights and promote girls&#39; education around the world, including her namesake charity,&nbsp;<a href=\"http:\/\/thepriyankafoundation.org\/\" target=\"_blank\">The Priyanka Chopra Foundation for Health and Education<\/a>. She is dedicated to fighting for inclusion and diversity for all and strongly believes in working to create a more inclusive world where diversity is celebrated. In December 2019, she received the prestigious Danny Kaye Humanitarian award, and in 2016, she recieved the Padma Shri, one of India&#39;s highest civilian honors.<\/p><p>Chopra Jonas lives in Los Angeles with her husband, Nick, and their three dogs, Diana, Gino and Panda.<\/p>","slug":"priyanka_chopra","published_at":"2020-09-25 16:57:00","updated_at":"2020-10-30 14:48:39"}}