{"speaker":{"id":6173,"title":"","firstname":"Madison","middleinitial":"","lastname":"McFerrin","description":"Singer-songwriter, producer","whotheyare":"Madison McFerrin is an independent singer-songwriter based in Brooklyn, New York, with a distinctive \"soul-appella\" sound.","whylisten":"<p>Madison McFerrin is a singer-songwriter and producer based in Brooklyn, New York. Her critically acclaimed <em>a cappella<\/em> EP series, <em>Finding Foundations<\/em><em>: Vol. I<\/em>, led Questlove to dub her sound &quot;soul-appella.&quot; After garnering praise as a <em>Pitchfork<\/em> Rising Artist and making her debut at South by Southwest (SXSW), she mesmerized crowds on her debut US and European tours with a powerful one-woman show. Her SXSW performance led legendary KCRW DJ Anne Litt to remark, &quot;there&#39;s some sort of joy and beauty in the way that she performs that really drew me in all that much more.&quot;<\/p><p>McFerrin&#39;s latest project, the <em>You + I<\/em> EP, expands upon her <em>a cappella<\/em> sound by pairing her timeless voice with modern production by her brother, Taylor McFerrin. The combination has proven effective: the <em>COLORS<\/em> debut of the lead single &quot;TRY&quot; has racked up more than one million views. Since it&#39;s release in December 2019, <em>You + I<\/em> has continued to impress listeners with <em>The FADER<\/em> noting how McFerrin&#39;s &quot;warm harmonies feel effortless&quot;&nbsp;and <em>AFROPUNK<\/em> highlighting how &quot;lush production and instrumentation accompany her angelic voice.&quot;<\/p><p> Despite cancellation of her return to SXSW due to the COVID-19 pandemic, McFerrin has continued to create during quarantine. Via Bandcamp, she has released timely new music such as &quot;Stay TF Inside,&quot; which was featured on <em>VICE News,<\/em>&nbsp;and she debuted her first foray into beatmaking with &quot;We&#39;ll Be Okay Beat Pack.&quot;<\/p>","slug":"madison_mcferrin","published_at":"2020-10-08 17:12:00","updated_at":"2021-03-04 17:03:17"}}