{"speaker":{"id":6179,"title":"","firstname":"Ishan","middleinitial":"","lastname":"Bhabha","description":"Constitutional lawyer","whotheyare":"Ishan Bhabha counsels and represents clients on their highest-stakes matters, with a particular focus on complex issues of constitutional, regulatory and commercial law.","whylisten":"<p>Ishan Bhabha is a partner at Jenner &amp; Block. He a member of the firm&#39;s Appellate and Supreme Court group, and is cochair of the firm&#39;s Education practice. He counsels and represents clients on their highest-stakes matters -- whether in the boardroom or the courtroom -- with a particular focus on complex issues of constitutional, regulatory, and commercial law. Bhabha&nbsp;has tried cases from the filing of a lawsuit through to the appeal of a decision in the US Supreme Court. He counsels and represents numerous colleges and universities on critical matters regarding free speech, affirmative action, athletics, immigration, sexual assault, COVID-19 and a host of other issues. He also has deep experience in representing technology companies on the complex commercial and regulatory issues that arise when new technology meets old laws, and has served as outside general counsel to Shift Technologies, Inc., now listed on NASDAQ (SFT). He is regularly called upon by senior executives and boards of directors to advise on key issues of legal, regulatory and ethical risk. Recently, he was part of a team representing Princeton University, Microsoft and a Princeton student in successfully challenging President Trump&#39;s attempted rescission of the Deferred Action for Childhood Arrivals (DACA) program, ensuring that more than 700,000 individuals brought to the US as children were not deemed unlawfully in the country.<\/p><p>In addition, Bhabha&nbsp;devotes hundreds of hours a year to pro bono work. He has argued in the US Supreme Court on behalf of social security applicant who was denied benefits, and has argued numerous cases in the courts of appeals for indigent criminal defendants. He also currently represents Sarah Collins Rudolph, the &quot;fifth little girl&quot; who was grievously injured in the 16th Street Church bombing in Birmingham, Alabama in 1963, that took life of her sister and three other girls. His work on the matter, including his&nbsp;<a href=\"https:\/\/jenner.com\/system\/assets\/assets\/11302\/original\/Letter%20to%20Governor%20Ivey%209.14.20.pdf\" target=\"_blank\">letter<\/a> to Governor Kaye Ivey and the Governor&#39;s&nbsp;<a href=\"https:\/\/context-cdn.washingtonpost.com\/notes\/prod\/default\/documents\/b8f36019-2ac0-4226-847a-d22e1e9507e5\/note\/ad6c18b4-b69f-4738-9b0c-76743ab7c2c6.#page=1\" target=\"_blank\">response<\/a>&nbsp;apologizing to Ms. Rudolph, have been featured in numerous news reports including in the <em>New York Times<\/em>, <em>Washington Post<\/em>&nbsp;and on CNN.<\/p><p>Before joining Jenner &amp; Block, Bhabha&nbsp;worked at the US Department of Justice and clerked for Justice Anthony Kennedy of US Supreme Court and Judge Merrick Garland of the US Court of Appeals for the DC Circuit. He also previously worked at the Boston Consulting Group.<\/p>","slug":"ishan_bhabha","published_at":"2020-10-13 20:18:00","updated_at":"2020-10-30 14:40:19"}}