{"speaker":{"id":6186,"title":"","firstname":"Mehret","middleinitial":"","lastname":"Mandefro","description":"Filmmaker, anthropologist, physician","whotheyare":"Mehret Mandefro is an award-winning producer, writer and director.","whylisten":"<p>Mehret Mandefro champions the creative arts as a path to developing a more just society. As a member of the Jobs Creation Commission of Ethiopia&#39;s Advisory Council, she has helped advocate for and shape policies that will enable the creative sector to thrive and serve as an engine for economic growth.<\/p><p>Mandefro draws on her interdisciplinary training as a physician and anthropologist to create compelling narratives she calls &quot;visual medicine.&quot; She cofounded the multimedia production companies&nbsp;<a href=\"https:\/\/www.truthaid.com\/\" target=\"_blank\">Truth Aid<\/a> in New York and&nbsp;<a href=\"https:\/\/www.a51films.com\/\" target=\"_blank\">Area 51 Films<\/a>&nbsp;in Ethiopia and is executive producer of Kana Television. Mandefro&nbsp;also coordinates&nbsp;<a href=\"https:\/\/www.ethiopiacreates.net\/\" target=\"_blank\">Ethiopia Creates<\/a>, a multidisciplinary effort dedicated to strengthening Ethiopia&#39;s creative economy, and is cofounder of&nbsp;<a href=\"https:\/\/www.realness.institute\/\" target=\"_blank\">Realness Institute<\/a>,&nbsp;which aims to build the film and television industry across Africa.&nbsp;<\/p><p>Mandefro&#39;s filmmaking credits include the Sundance and Berlinale Audience Award winner&nbsp;<em>Difret<\/em>, the&nbsp;<em>New York Times<\/em>&nbsp;Critic&#39;s Pick&nbsp;<em>Little White Lie<\/em>, the Primetime Emmy-nominated American Masters documentary&nbsp;<a href=\"https:\/\/www.pbs.org\/wnet\/americanmasters\/blog\/american-masters-celebrates-emmy-nominated-season-3\/\" target=\"_blank\"><em>How It Feels To Be Free<\/em><\/a>, the viral digital series&nbsp;<em>The Loving Generation<\/em>, and showrunner of Ethiopia&#39;s first-ever hit teen television drama&nbsp;<em>Yegna: The Story of All of Us<\/em>.<\/p><p>Mandefro holds a BA in anthropology from Harvard University, a MD from Harvard Medical School, a MSc in public health from the London School of Hygiene and Tropical Medicine as a Fulbright Scholar and a PhD in cultural anthropology from Temple University. She is an alumna of the Sundance Institute&#39;s New Voices Lab, Film Forward, American Film Showcase, and is a 2021 EAVE Producers Workshop participant.<\/p>","slug":"mehret_mandefro","published_at":"2020-10-13 20:50:00","updated_at":"2021-07-26 21:09:21"}}