{"speaker":{"id":62,"title":"","firstname":"Wade","middleinitial":"","lastname":"Davis","description":"Anthropologist, ethnobotanist","whotheyare":"A National Geographic Explorer-in-Residence, Wade Davis has been described as “a rare combination of scientist, scholar, poet and passionate defender of all of life’s diversity.”","whylisten":"<p>Wade Davis is perhaps the most articulate and influential western advocate for the world&#39;s indigenous cultures. A National Geographic Explorer-in-Residence, he has been described as &ldquo;a rare combination of scientist, scholar, poet and passionate defender of all of life&rsquo;s diversity.&rdquo; Trained in anthropology and botany at Harvard, he travels the globe to live alongside indigenous people, and document their cultural practices in books, photographs, and film. His stunning photographs and evocative stories capture the viewer&#39;s imagination. As a speaker, he parlays that sense of wonder into passionate concern over the rate at which cultures and languages are disappearing -- 50 percent of the world&#39;s 7,000 languages, he says, are no longer taught to children. He argues, in the most beautiful terms, that language is much more than vocabulary and grammatical rules. Every language is an old-growth forest of the mind. &nbsp;<\/p><p>Indigenous cultures are not failed attempts at modernity, let alone failed attempts to be us. They are unique expressions of the human imagination and heart, unique answers to a fundamental question: What does it mean to be human and alive? When asked this question, the peoples of the world respond in 7,000 different voices, and these collectively comprise our human repertoire for dealing with all the challenges that will confront us as a species over the coming centuries.<\/p><p>Davis is the author of 15 books including&nbsp;<a href=\"http:\/\/geni.us\/serpentandrainbow\" target=\"_blank\"><em>The Serpent and the Rainbow<\/em><\/a>,&nbsp;<a href=\"http:\/\/geni.us\/oneriver\" target=\"_blank\"><em>One River<\/em><\/a>, and&nbsp;<a href=\"http:\/\/geni.us\/wayfinders\" target=\"_blank\"><em>The Wayfinders<\/em><\/a>. His many film credits include <em>Light at the Edge of the World<\/em>, an eight-hour documentary series produced for the National Geographic. In 2009 he received the Gold Medal from the Royal Canadian Geographical Society for his contributions to anthropology and conservation, and he is the 2011 recipient of the Explorers Medal, the highest award of the Explorers&rsquo; Club, and the 2012 recipient of the Fairchild Medal for Plant Exploration. His latest books are&nbsp;<a href=\"http:\/\/geni.us\/intothesilence\" target=\"_blank\"><em>Into the Silence: The Great War, Mallory and the Conquest of Everest<\/em><\/a>&nbsp;and&nbsp;<a href=\"http:\/\/geni.us\/sacredheadwaters\" target=\"_blank\"><em>The Sacred Headwaters: the Fight to Save the Stikine, Skeena and the Nass<\/em><\/a><em>.<\/em><\/p>","slug":"wade_davis","published_at":"2007-02-19 13:06:00","updated_at":"2018-01-05 17:58:42"}}