{"speaker":{"id":6221,"title":"","firstname":"Emily","middleinitial":"","lastname":"Levesque","description":"Astrophysicist","whotheyare":"Emily Levesque explores how the most massive stars in the universe evolve and die and how technology is changing the stories we tell about science and the cosmos.","whylisten":"<p>An award-winning astrophysicist, Emily Levesque has observed for upwards of fifty nights on many of the planet&#39;s largest telescopes and flown over the Antarctic stratosphere in an experimental aircraft for her research. Her critically-acclaimed popular science book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Last-Stargazers-Astronomys-Vanishing-Explorers\/dp\/1492681075\" target=\"_blank\"><em>The Last Stargazers<\/em><\/a><em>&nbsp;<\/em>shares the stories of life as a professional scientist and explores the crucial role of human curiosity in a rapidly-changing field.<\/p><p>In 2014, Levesque led a research group in discovering a completely new type of star known as a Thorne-Zytkow object, a luminous star supported by a dead stellar core that had been predicted by stellar theory nearly forty years earlier but never observed. She has spoken all over the world about her work on these &quot;weirdest stars in the universe,&quot; and currently leads a research group specializing in strange dying stars as an associate professor at the University of Washington in Seattle.<\/p><p>She is also a dedicated teacher and science communicator. She has authored two textbooks on the physics of stars. In 2017, she was an invited inspirational speaker at the Women Leaders in Science, Technology, and Engineering conference in Kuwait, which she attended as a guest of the AAAS and the US Department of State.<\/p><p>Levesque was awarded the American Astronomical Society&#39;s 2014 Annie Jump Cannon Award in 2014, and the Newton Lacy Pierce Prize for outstanding achievement in observational astronomical research in 2020. She is also a 2015 Scialog Fellow, a 2017 Alfred P. Sloan Research Fellow in Physics, a 2018 Kavli Frontiers of Science Fellow, a 2019 Cottrell Scholar and a recipient of the Gold Medal of Honorary Patronage from Trinity University&rsquo;s Philosophical Society.<br \/>&nbsp;<br \/>She received her PhD in astronomy from the University of Hawaii and her bachelors degree in physics from MIT.<\/p>","slug":"emily_levesque","published_at":"2020-12-02 23:01:00","updated_at":"2020-12-07 17:44:57"}}