{"speaker":{"id":6260,"title":"","firstname":"John","middleinitial":"","lastname":"Kerry","description":"Special Presidential Envoy for Climate","whotheyare":"John F. Kerry is the United States's first Special Presidential Envoy for Climate.","whylisten":"<p>On January 20th 2021, John F. Kerry was sworn in United States&#39;s first Special Presidential Envoy for Climate and the first-ever Principal to sit on the National Security Council entirely dedicated to climate change. President Biden announced that Kerry would have a seat at every table around the world as he combats the climate crisis to meet the existential threat that we face. In recent years, Kerry was the Carnegie Endowment for International Peace&#39;s first-ever Visiting Distinguished Statesman, following his four years as the 68th United States Secretary of State. As America&#39;s top diplomat, he guided the Department&#39;s strategy on nuclear nonproliferation, combating radical extremism, and the threat of climate change. His tenure was marked by the successful negotiation of the Iran nuclear deal and the Paris Climate Agreement.<\/p><p>From 1985 to 2013, Kerry served as a US Senator representing Massachusetts, and was Chairman of the Senate Foreign Relations Committee from 2009 to 2013. He served in the US Navy, completing two combat tours of duty in Vietnam for which he received a Silver Star, a Bronze Star with Combat V, and three Purple Hearts. He received his undergraduate degree from Yale University and his law degree from Boston College Law School. Kerry is the best-selling author of&nbsp;<a href=\"https:\/\/geni.us\/9Fb6sP6\" target=\"_blank\"><em>A Call to Service<\/em><\/a>, <a href=\"https:\/\/geni.us\/BGrg\" target=\"_blank\"><em>This Moment on Earth<\/em><\/a>&nbsp;with his wife Teresa Heinz Kerry, and his 2018 memoir,&nbsp;<a href=\"https:\/\/geni.us\/GNxiU67\" target=\"_blank\"><em>Every Day Is Extra<\/em><\/a>, which the <em>New York Times<\/em> described as &quot;a bittersweet reminder of what the country once demanded of its leaders.&quot; He was the Democratic Party&#39;s nominee for President of the United States in 2004.<\/p>","slug":"john_kerry","published_at":"2021-02-16 22:01:00","updated_at":"2021-02-19 15:08:39"}}