{"speaker":{"id":6285,"title":"","firstname":"Leslie","middleinitial":"","lastname":"Herod","description":"Colorado State Representative","whotheyare":"In 2016, Leslie Herod was elected to serve House District 8 in the Colorado House of Representatives and is the first LGBTQ+ African American to hold office in Colorado.","whylisten":"<div>Leslie Herod serves as Chair of the Appropriations Committee, is a member of the Joint Budget Committee and is the Chair of the Colorado Black Democratic Legislative Caucus. She previously served as the Chair of the Finance Committee and the Vice Chair of the Judiciary Committee.&nbsp;<\/div><div><br \/><\/div><div>She has spent her life working for community. This passion for service was first inspired by her mother, a single mother and officer in the Army Nurse Corps, who taught her the importance of discipline, hard work, a commitment to public service and &mdash; most important to her &mdash; compassion toward communities of diverse backgrounds.<\/div><div><br \/><\/div><div>Herod has served two terms as Representative for House District 8 and has sent 76 bills to the Governor&rsquo;s desk addressing criminal justice reform, mental health, addiction, youth homelessness, civil rights protections, economic development and more. Through her office, she has championed legislation to re-enfranchise voters with felony convictions, enhance law enforcement transparency and accountability and advocate for civil rights. Additionally, Herod championed the Caring 4 Denver ballot initiative, which raises $35 million annually for mental health and substance abuse treatment and services for children and adults. She now serves as the Board President of Caring 4 Denver.&nbsp;<\/div><div><br \/><\/div><div>Beyond her role as a State Representative, Herod has served on multiple organizations, boards and commissions. She is the President of Colorado Black Women for Political Action, and she serves as a Trustee for MCA Denver and on the Board of Directors for Urban Peak -- Colorado&#39;s leading homeless youth service agency. She has an extensive background in state service from her time as the Senior Policy Advisor in Governor Ritter&rsquo;s Administration, as President Obama&rsquo;s Deputy Political Director in Colorado during his 2012 Reelection Campaign and was the Colorado Co-Chair for Senator Kamala Harris&rsquo; 2020 presidential campaign.&nbsp;<\/div>","slug":"leslie_herod","published_at":"2021-03-12 23:13:00","updated_at":"2021-03-15 15:47:36"}}