{"speaker":{"id":6290,"title":"","firstname":"Jamil","middleinitial":"","lastname":"Zaki","description":"Research psychologist","whotheyare":"Jamil Zaki is a professor of psychology at Stanford University and the director of the Stanford Social Neuroscience Lab.","whylisten":"<p>Jamil Zaki is fascinated by human connection, what it does for us and how people can learn to connect better. His research demonstrates that qualities such as empathy and kindness are skills that people can build through practice, like they would strengthen a muscle. He and his colleagues think of their work as constructing &quot;empathy gyms,&quot; where they can work out their care and understanding.<\/p><p>In the last few years, Zaki has been exploring cynicism, people&#39;s loss of trust and faith in themselves and each other. He has discovered that cynicism is a modern psychological plague: that harms people, relationships and our culture, and which is spreading rapidly.&nbsp; But he has also found that by understanding cynicism, we can combat it, restoring our belief in one another and working together to build a better world.&nbsp;&nbsp;&nbsp;<\/p><p>Zaki&nbsp;has been exploring cynicism, people&#39;s loss of trust and their faith in themselves and each other. He has discovered that cynicism is a modern psychological plague that harms people, relationships and our culture -- and it&#39;s spreading rapidly. But he has also found that by understanding cynicism, we can combat it, restoring our belief in one another and working together to build a better world.&nbsp;<\/p><p>In addition to his scientific work, Zaki is active in outreach and public communication of science. He has written about the psychology of empathy and kindness for the <em>New York Times<\/em>, <em>The Washington Post<\/em>, <em>The Atlantic<\/em>,<em>&nbsp;The Wall Street Journal<\/em>&nbsp;and <em>The New Yorker<\/em>. In 2019, he published his first book,&nbsp;<a href=\"https:\/\/geni.us\/EjhWPgp\" target=\"_blank\"><em>The War for Kindness<\/em><\/a>, which NPR called a &quot;wide-ranging, practical guide to making the world better.&quot;<\/p>","slug":"jamil_zaki","published_at":"2021-03-15 21:51:00","updated_at":"2021-12-17 02:11:38"}}