{"speaker":{"id":63,"title":"","firstname":"Peter","middleinitial":"","lastname":"Donnelly","description":"Mathematician; statistician","whotheyare":"Peter Donnelly is an expert in probability theory who applies statistical methods to genetic data -- spurring advances in disease treatment and insight on our evolution. He's also an expert on DNA analysis, and an advocate for sensible statistical analysis in the courtroom.","whylisten":"<p>Peter Donnelly applies statistical methods to real-world problems, ranging from DNA analysis (for criminal trials), to the treatment of genetic disorders. <strong>A mathematician who collaborates with biologists<\/strong>, he specializes in applying probability and statistics to the field of genetics, in hopes of shedding light on evolutionary history and the structure of the human genome.<\/p><p>The Australian-born, Oxford-based mathematician is best known for his work in molecular evolution (tracing the roots of human existence to their earliest origins using the mutation rates of mitochondrial DNA). He studies genetic distributions in living populations to trace human evolutionary history -- an approach that informs research in evolutionary biology, as well as medical treatment for genetic disorders. Donnelly is a key player in the <a href=\"http:\/\/www.hapmap.org\/\" target=\"_blank\">International HapMap Project<\/a>, an ongoing international effort to model human genetic variation and <strong>pinpoint the genes responsible for specific aspects of health and disease;<\/strong> its implications for disease prevention and treatment are vast. <\/p><p>He&#39;s also a leading expert on DNA analysis and the use of forensic science in criminal trials; he&#39;s <strong>an outspoken advocate for bringing sensible statistical analysis into the courtroom<\/strong>. Donnelly leads Oxford University&#39;s <a href=\"http:\/\/www.stats.ox.ac.uk\/~mcvean\/group.html\" target=\"_blank\">Mathematical Genetics Group<\/a>, which conducts research in genetic modeling, human evolutionary history, and forensic DNA profiling. He is also serves as Director of the Wellcome Trust Centre for Human Genetics at Oxford University, which explores the genetic relationships to disease and illness.&nbsp;<\/p>","slug":"peter_donnelly","published_at":"2007-02-19 13:15:00","updated_at":"2015-07-02 18:18:13"}}