{"speaker":{"id":6318,"title":"","firstname":"John","middleinitial":"","lastname":"Marshall","description":"Environmental advocate, communications strategist","whotheyare":"John Marshall is changing the way people talk about climate change so that we can better understand and act against it.","whylisten":"<p>John Marshall is the founder and CEO of Potential Energy Coalition, a nonpartisan, nonprofit coalition that brings together America&rsquo;s leading creative, analytic and media agencies to shift the conversation on climate change. Potential Energy aims to develop new narratives that help people understand the issue, engage audiences on a personal level and build demand for a better, cleaner, more prosperous world.&nbsp;<\/p><p>Marshall is also a professor of marketing at Dartmouth College and senior advisor to Lippincott. Prior to founding Potential Energy,&nbsp;Marshall had a long career as a senior marketing executive -- as the chief strategy and innovation officer at Lippincott, global head of strategy and analytics at the digital agency Digitas, president of the public education company The Princeton Review and partner with the consulting firm Oliver Wyman. Marshall has worked with the senior leadership teams of clients such as 3M, Samsung, eBay, Bank of America, Bain Capital and Caterpillar in developing strategy and driving growth. He now dedicates his time to using these marketing skills to address the climate crisis.\u2028<\/p><p>Marshall graduated with an AB in chemistry from Princeton University and an MBA with Distinction from the Amos Tuck School at Dartmouth College, where he was a Tuck Scholar. He is also a Chartered Financial Analyst. He is a frequent industry commentator and speaker, whose writing on marketing, growth and innovation have appeared in the<em> Harvard Business Review<\/em>, <em>Forbes<\/em>, the<em> New York Times<\/em>, <em>Wired<\/em>&nbsp;and <em>Fast Company<\/em>.<\/p>","slug":"john_marshall","published_at":"2021-04-20 17:59:00","updated_at":"2021-04-22 11:57:34"}}