{"speaker":{"id":6321,"title":"","firstname":"Daniel J.","middleinitial":"","lastname":"Watts","description":"Multidisciplinary artist","whotheyare":"As a storyteller, Daniel J. Watts loves a good story whether the medium be acting, dancing, writing, reciting poetry, rapping or singing.","whylisten":"<p>Daniel J. Watts is a 2020 Tony Award nominee and Outer Critics Circle Award Winner for his portrayal of Ike Turner in the hit broadway musical &quot;TINA&quot;. He has appeared in several Broadway shows including Hamilton, Memphis and After Midnight. He received the Barrymore Award (Peoples Light) and the LA Ovation Award (Geffen Playhouse) for best featured actor for his portrayal of Sammy Davis, Jr. in &ldquo;Lights Out: Nat King Cole&quot; opposite Dul&eacute; Hill. His television credits include &ldquo;The Marvelous Mrs. Maisel&rdquo;, &ldquo;The Last OG&rdquo;, &ldquo;Blindspot&rdquo;, and &ldquo;Vinyl&rdquo;.<\/p><p>Off-Broadway he has starred as the title character in Suzan-Lori Parks&#39; &quot;Death of the Last Black Man in the Entire World AKA The Negro Book of the Dead&quot; (Signature Theatre) and &quot;Whorl Inside A Loop&quot; (2nd Stage).&nbsp;<\/p><p>A play-on-words, Daniel J. Watts&rsquo; &quot;THE JAM&quot; pays homage to Watts&rsquo; great-grandmother who, after making jam from scratch, would share with others what she was unable to consume herself. &quot;THE JAM&quot; is Watts&rsquo; continuation of that legacy, blending elements of stand-up comedy and compelling storytelling with his original spoken word, often set to music and\/or dance. &quot;The Jam: Only Child&quot; was a wide success at the 2020 Public Theatre Under The Radar Festival and has also streamed as part of the Signature Theater (DC) 2020-2021 season, and received the Inaugural (2020) ANTONYO Award Winner for Best Quarantine Content.<\/p><p>His original work and musical collaborations are featured on Raphael Saadiq&rsquo;s newest album &ldquo;Jimmy Lee&rdquo;, Tituss Burgess&rsquo; &ldquo;Saint Tituss&rdquo;, Divinity Roxx&rsquo;s ImPossible, Nick Blaemire&rsquo;s &ldquo;Ampersand&rdquo;; as a contributing artist for Armstrong Now in conjunction with The Louis Armstrong House Museum; and featured in the young adult anthology &quot;How I Resist&quot; edited by Maureen Johnson.<\/p><p>Watts is an artist-in-residence at ASU Gammage and has also served as an adjunct professor of NYU&#39;s Tisch New Studio.<br \/>He is a BFA graduate from the Elon University Music Theatre Program.<\/p>","slug":"daniel_j_watts","published_at":"2021-04-26 14:39:57","updated_at":"2021-04-26 14:42:10"}}