{"speaker":{"id":6325,"title":"","firstname":"Liam","middleinitial":"","lastname":"Young","description":"Director, production designer, architect","whotheyare":"Liam Young is a speculative architect, production designer and director who operates in the spaces between design, fiction and futures.","whylisten":"<p>Liam Young is cofounder of Tomorrows Thoughts Today, an urban futures think tank exploring the local and global implications of new technologies. He is also cofounder of Unknown Fields, a nomadic research studio that travels on expeditions to chronicle emerging conditions as they occur on the ground.<\/p><p>Described by the BBC as &quot;the man designing our futures,&quot; Young&#39;s visionary films and speculative worlds are both extraordinary images of tomorrow and urgent examinations of the environmental questions facing us today. As a worldbuilder, he visualizes the cities, spaces and props of our imaginary futures for the film and television industry. He is a BAFTA-nominated producer and has premiered with platforms such as the BBC, Channel 4, SXSW, Tribeca, the Metropolitan Museum of Art, The Royal Academy, Venice Biennale and the <em>Guardian<\/em>.<\/p><p>Young&#39;s work has been collected internationally and acclaimed in both mainstream and design media. He has held guest professorships at Princeton University, MIT and Cambridge, and he now runs the groundbreaking master&#39;s in&nbsp;<a href=\"https:\/\/www.sciarc.edu\/academics\/postgraduate\/fiction-and-entertainment\" target=\"_blank\">fiction and entertainment degree program<\/a>&nbsp;at SCI-Arc in Los Angeles. He has published several books, including<em>&nbsp;<\/em><a href=\"https:\/\/www.amazon.com\/Machine-Landscapes-Architectures-Post-Anthropocene-Architectural\/dp\/1119453011\" target=\"_blank\"><em>Machine Landscapes: Architectures of the Post Anthropocene<\/em><\/a> and<em>&nbsp;<\/em><a href=\"https:\/\/www.amazon.com\/Planet-City-Liam-Young\/dp\/0648685829\" target=\"_blank\"><em>Planet City<\/em><\/a>, a story about a fictional city for the entire population of Earth.<\/p>","slug":"liam_young","published_at":"2021-05-03 18:50:00","updated_at":"2021-09-15 20:45:03"}}