{"speaker":{"id":633,"title":"","firstname":"Jamie","middleinitial":"","lastname":"Oliver","description":"Chef, activist","whotheyare":"Jamie Oliver is transforming the way we feed ourselves, and our children. The winner of the 2010 TED Prize, he's on a mission to teach every family about eating better and living healthier lives. ","whylisten":"<p>Jamie Oliver has been drawn to the kitchen since he was a child working in his father&#39;s pub. He showed not only a precocious culinary talent but also a passion for inspiring people to eat fresh, honest, delicious food. While serving as sous chef at the River Cafe in London, the BBC took note of him. His series, <em>The Naked Chef<\/em>, debuted in 1999. In the years since, he has built a worldwide media empire of TV shows, books, cookware and magazines, all based on a formula of simple, unpretentious food that invites everyone to get busy in the kitchen.&nbsp;<\/p><p>As much as Oliver&#39;s cooking is generous, so is his business model. The Jamie Oliver Food Foundation trains young chefs from disadvantaged backgrounds to work in his restaurants and runs an extensive gardening program that teaches children where food comes from. Series like <em>Jamie&#39;s School Dinner<\/em>, <em>Jamie&#39;s Ministry of Food<\/em> and <em>Jamie Oliver&#39;s Food Revolution<\/em>&nbsp;combine his work in the kitchen with serious activism and community organizing -- to create change on both the individual and governmental level.<\/p><p>Oliver uses his fame and charm to highlight the changes people need to make in their diet and lifestyles. With the&nbsp;<a href=\"\/participate\/ted-prize\/prize-winning-wishes\/food-revolution\" target=\"_blank\" onclick=\"window.open('','','');return false;\">2010 TED Prize<\/a>, he set the vision for&nbsp;<a href=\"http:\/\/www.jamiesfoodrevolution.org\/\" target=\"_blank\" onclick=\"window.open('','','');return false;\">Jamie&#39;s Food Revolution<\/a>, a global campaign to educate kids about food and inspire families to cook again. More than 750,000 people have signed up to be a part of it. At the same time, Oliver continues to advocate for policy changes, like sugar reduction and clearer food labeling.&nbsp;<\/p>","slug":"jamie_oliver","published_at":"2009-12-21 13:52:00","updated_at":"2017-06-20 15:45:18"}}