{"speaker":{"id":6358,"title":"","firstname":"Bozoma","middleinitial":"","lastname":"Saint John","description":"CMO, Netflix","whotheyare":"Bozoma Saint John is the global Chief Marketing Officer at Netflix.","whylisten":"<p>Prior to joining Netflix,&nbsp;Bozoma Saint John served as head of global consumer marketing at Apple Music and iTunes, and chief brand officer at Uber and CMO at Endeavor. She has been recognized on the&nbsp;<em>Forbes&nbsp;<\/em>2018 &quot;World&#39;s Most Influential CMOs&quot; list, <em>Billboard<\/em>&nbsp;2018 &quot;Women in Music Hall of Fame&quot; list and&nbsp;<em>Hollywood Reporter<\/em>&nbsp;2018 &quot;Women in Entertainment Power 100&quot; list. She has also been featured on the cover of <em>Adweek<\/em> as &quot;one of the most exciting personalities in advertising&quot; and on lists ranging from <em>Ad Age<\/em>&#39;s &quot;Most Creative People&quot; to <em>Ebony<\/em>&#39;s &quot;100 Powerful Executives&quot; and&nbsp;<em>Black Enterprise<\/em>&#39;s &quot;Most Powerful Women in Business.&quot; She was inducted into the American Advertising Federation Hall of Achievement in 2014.<\/p><p>Saint John got her start in marketing at Spike Lee&rsquo;s advertising agency, Spike DDB, before&nbsp;serving in executive roles at Endeavor, Uber, Apple Music and iTunes and PepsiCo.&nbsp;In 2020, she launched a podcast alongside journalist Katie Couric, called <em>Back to Biz with Katie and Boz<\/em>, that explores the ways thought leaders, CEO, and innovators are responding to the societal shifts ushered in by the coronavirus pandemic. She also launched the #ShareTheMicNow Instagram initiative, alongside Luvvie Ajayi Jones, Glennon Doyle and Stacey Bendet.<\/p><p>Professor Frances Frei of Harvard Business School has used Saint John&#39;s successful marketing career as a case study in her MBA class&nbsp;<em>Leading Difference<\/em>. Saint John has appeared as a guest lecturer for Harvard MBA students, delving into the tactical and pivotal marketing moves she made throughout her career, which she credits as intrinsic to her success. She was asked to teach her own course, <em>Anatomy of a Badass<\/em>, during the January 2021 semester.&nbsp;<\/p><p>In June 2021, Saint John&nbsp;was a Cannes Lions jury president, leading the&nbsp;<em>Glass: The Lion for Change<\/em>&nbsp;category with the specific goal of recognizing work that challenged gender bias and shattered the stereotypical images which remain rooted in marketing messages. Her philanthropic efforts include representing Pencils of Promise as a Global Ambassador to Ghana and serving on the boards of Girls Who Code and Vital Voices. Her forthcoming memoir,&nbsp;<em>The Urgent Life: A Story of Love, Grief and Survival,<\/em>&nbsp;is set to be published by Viking\/Penguin Books in 2022.<\/p>","slug":"bozoma_saint_john","published_at":"2021-05-12 21:33:00","updated_at":"2021-11-05 14:53:22"}}