{"speaker":{"id":64,"title":"","firstname":"Bjorn","middleinitial":"","lastname":"Lomborg","description":"Global prioritizer","whotheyare":"Danish political scientist Bjorn Lomborg heads the Copenhagen Consensus, which has prioritized the world's greatest problems -- global warming, world poverty, disease -- based on how effective our solutions might be. It's a thought-provoking, even provocative list.","whylisten":"<p>Bjorn Lomborg isn&#39;t afraid to voice an unpopular opinion. In 2007, he was named one of the 100 Most Influential People by <em>Time<\/em> magazine after the publication of his controversial book <em><a href=\"http:\/\/www.cambridge.org\/uk\/economics\/lomborg\/book.htm\" target=\"_blank\">The Skeptical Environmentalist<\/a>,<\/em> which challenged widely held beliefs that the environment is getting worse. This year, he was named on of the &quot;50 people who cold save the planet&quot;  by the <a href=\"http:\/\/www.guardian.co.uk\/\" target=\"_blank\"><em>Guardian<\/em> <\/a> newspaper. In 2007 he published&nbsp;<em><a href=\"http:\/\/geni.us\/coolit\" target=\"_blank\">Cool It: The Skeptical Environmentalist&#39;s Guide to Global Warming<\/a><\/em>, further analyzes what today&#39;s science tells us about global warming and its risks. That same year, his next book&nbsp;<span style=\"text-decoration: underline\" class=\"Apple-style-span\"><em>Solutions for<\/em><\/span><em style=\"text-decoration: underline\">&nbsp;the World&#39;s Biggest Problems<\/em>&nbsp;was released, which provided a summary of the greatest challenges facing humanity.&nbsp;<\/p><p>In 2004, he convened the <a href=\"http:\/\/www.copenhagenconsensus.com\/Default.aspx?ID=788\" target=\"_blank\">Copenhagen Consensus<\/a>, which tries to <strong>prioritize the world&#39;s greatest challenges based on the impact we can make, a sort of bang-for-the-buck breakdown<\/strong> for attacking problems such as global warming, world poverty and disease. <strong><br \/><br \/>It begins from the premise that  we can&#39;t solve every problem in the world, and asks: Which ones should we fix first?<\/strong> The Copenhagen Consensus 2004 tapped the expertise of world-leading economists, as well as a diverse forum of young participants; collectively, they determined that control of HIV\/AIDS was the best investment -- and mitigating global warming was the worst. Lomborg summarized these findings in <em><a href=\"http:\/\/www.cambridge.org\/us\/catalogue\/catalogue.asp?isbn=0521685710http:\/\/www.cambridge.org\/us\/catalogue\/catalogue.asp?isbn=0521685710\" target=\"_blank\">How to Spend $50 Billion to Make the World a Better Place<\/a>.<\/em> In spring of 2008, Copenhagen Consensus convened again, assembling over 55 international economists, including 4 Nobel laureates, to assess, prioritize and brainstorm solutions for the major global challenges of today, including conflicts, malnutrition, health, education and terrorism. In 2013, he published&nbsp;<a href=\"http:\/\/geni.us\/seventyfivebillion\" target=\"_blank\"><em>How to Spend $75 Billion to Make the Wolrd a Better Place<\/em><\/a>.<\/p><h1 style=\"font-family: Arial, Helvetica, sans-serif; font-size: 1.7em; font-weight: normal; margin-bottom: 0px; margin-top: 0px\" class=\"parseasinTitle \"><br \/><\/h1>","slug":"bjorn_lomborg","published_at":"2007-02-19 13:19:00","updated_at":"2015-07-10 19:49:00"}}