{"speaker":{"id":6406,"title":"","firstname":"Lizzo","middleinitial":"","lastname":"","description":"Singer, rapper, songwriter, flutist","whotheyare":"Three-time Grammy-winning superstar Lizzo has become a household name, with more than four billion global streams and a Platinum debut album.","whylisten":"<p>&quot;[Lizzo&#39;s] sound is relentlessly positive and impossibly catchy: bangers that synthesize pop, rap and R&amp;B, with hooks so sharp it feels like they&#39;ve been in your brain forever,&quot;&nbsp;<a href=\"https:\/\/time.com\/entertainer-of-the-year-2019-lizzo\/\" target=\"_blank\">writes Samantha Irby in <em>TIME<\/em><\/a>, which named the self-described &quot;Bop Star&quot; its&nbsp;Entertainer of the Year in 2019. With the help of anthemic smash hits like the 5x Platinum &quot;Truth Hurts,&quot; the 3x Platinum &quot;Good As Hell&quot; and the Platinum &quot;Juice,&quot; Lizzo released her debut album,&nbsp;<a href=\"https:\/\/geni.us\/fH1i\" target=\"_blank\"><em>Cuz I Love You<\/em><\/a>,&nbsp;on April 19, 2019, debuting at number six on the Billboard Top 200 Albums chart and spending 24 consecutive weeks in the chart&#39;s Top 10. After spending seven weeks atop the charts, &quot;Truth Hurts&quot; became the longest running number one by a solo female rap artist in history.<\/p><p>Since the release of the meteoric <em>Cuz I Love You<\/em>, Lizzo has been named <em>Entertainment Weekly&#39;<\/em>s 2019 Entertainer of the Year and has graced the covers of&nbsp;<em>Rolling Stone<\/em>,&nbsp;<em>Billboard<\/em>,&nbsp;British<em> Vogue<\/em>,&nbsp;<em>Elle&nbsp;<\/em>and many others. She kicked off 2020 with a showstopping opening performance at the 62nd Grammy Awards, took home three big wins and was the most nominated artist of the year. She won awards for Best Female R&amp;B\/Pop Artist at the 2020 BET Awards and Entertainer of the Year and Outstanding Video at the 2020 NAACP Awards. Her list of high-profile TV performances include the 2019 American Music Awards, MTV VMAs, BET Awards and&nbsp;<em>Saturday Night Live<\/em>.<\/p>","slug":"lizzo","published_at":"2021-06-16 14:47:00","updated_at":"2021-09-16 14:53:49"}}