{"speaker":{"id":6428,"title":"","firstname":"Uğur","middleinitial":"","lastname":"Şahin","description":"Physician, immunologist","whotheyare":"Uğur Şahin is the cofounder and CEO of BioNTech and one of the world's foremost experts on messenger ribonucleic acid (mRNA) medicines. He initiated the historic development of the first mRNA vaccine for COVID-19.","whylisten":"<p>Professor Uğur Şahin, MD, cofounder and CEO of BioNTech, is a physician, immunologist and leader in the development of novel approaches to fight cancer and infectious diseases. He has pioneered several breakthroughs enabling the development of mRNA vaccines and other types of immunotherapies. He initiated and oversees &quot;Project Lightspeed,&quot; the historic development of the first mRNA vaccine for COVID-19, moving from lab and clinical testing to conditional approval within an unprecedented 11-month period. He also leads BioNTech&#39;s research and development of neoantigen specific mRNA cancer vaccines, which are individually tailored and produced on demand. Şahin&nbsp;and his team developed RNA vaccine nanoparticle delivery strategies that target tissue-derived dendritic cells body-wide. They became the first to administer an mRNA encapsulated in a nanoparticle delivery system to humans.<\/p><p>Şahin&nbsp;is coinventor of more than 500 filed patents applications and patents. His academic credentials include serving as a full professor (W3) in Translational Oncology and Immunology at Johannes Gutenberg University in Mainz, Germany, where he was the supervisor for more than 50 PhD students. He also holds the role of Chairman of the Scientific Management Board of the Helmholtz Institute for Translational Oncology (HI-TRON) in Mainz. For his contributions to scientific discovery, Şahin has received numerous awards and recognitions, including the German Sustainability Award, the Mustafa Prize and the German Cancer Award. He is married to &Ouml;zlem T&uuml;reci.<\/p>","slug":"ugur_sahin","published_at":"2021-07-09 00:53:00","updated_at":"2021-08-09 14:30:36"}}