{"speaker":{"id":6441,"title":"","firstname":"Tzeporah","middleinitial":"","lastname":"Berman","description":"Environmental campaigner","whotheyare":"Tzeporah Berman is the Chair of the Fossil Fuel Non-Proliferation Treaty Initiative and the international program director of Stand.Earth.","whylisten":"<p>Tzeporah Berman found her voice in 1993 on a logging blockade in Canada&#39;s old growth rainforest when a friend handed her a megaphone and she hasn&#39;s stopped talking since. That summer, at 22 years old, she was arrested and charged with 857 counts of criminal aiding and abetting and faced six years in jail. In 2021, she was arrested once again, at 52 years old, for blockading logging of the last old growth rainforests, proving the old adage that, indeed, some things never change.<\/p><p>In the interim 30 years, Berman&nbsp;has been designing successful environmental advocacy campaigns, environmental policy and leading environmental negotiations with industry and government in Canada and around the world. She is an adjunct professor of environmental studies at York University, the international program director at Stand.Earth, the chair of the Fossil Fuel Non-Proliferation Treaty Initiative, the cofounder of the Global Oil and Gas Network and the former codirector of Greenpeace International&#39;s Climate and Energy Program. She has held appointed positions advising the British Columbia and Alberta governments on climate policy.<\/p><p>Berman has been listed as one of the 35 Most Influential Women in British Columbia by <em>BC Business<\/em>&nbsp;magazine, awarded the YWCA Women of Distinction Award in British Columbia and was honored by inclusion into the BC Royal Museum permanent exhibit of one of 150 people who have changed the face of British Columbia. Her children find it hilarious that her lifesize cardboard cutout stands wedged in between scientist David Suzuki and actor Pamela Anderson.<\/p><p>In 2013, Berman was awarded an Honorary Doctorate from the University of British Columbia. She was notably called an eco-terrorist by one elected official in Canada on national news and several years later lauded as an &quot;eco-hero&quot; by another -- for saying the same thing.&nbsp; In 2019, she received the two-million-dollar Climate Breakthrough Project Award. She lives on unceded Tsleiwatuth, Squamish and Musquem territories in Vancouver, Canada, with her husband, two sons and two dogs.<\/p>","slug":"tzeporah_berman","published_at":"2021-07-26 17:12:00","updated_at":"2021-10-14 14:56:08"}}