{"speaker":{"id":6442,"title":"","firstname":"Gavin","middleinitial":"","lastname":"McCormick","description":"High-tech environmental activist","whotheyare":"Gavin McCormick is a cofounder of the Climate TRACE coalition, which combines satellites and artificial intelligence to detect human-caused greenhouse gases from all major sources.","whylisten":"<p>In 2013, Gavin McCormick was an environmental economics PhD student at UC Berkeley, developing algorithms to detect when and where power grids had surplus renewable electricity. One day he happened to attend a hackathon, and met several software engineers who realized his research could be applied in the real world. Nine hours later, the impromptu group had developed a simple app that had converted their laptops to run partly on surplus renewable energy. McCormick&nbsp;was astonished how quickly and easily they had slashed greenhouse gas emissions in the real world. Soon, he became obsessed with supporting software engineers in throwing their considerable talents at one of the hardest problems in the world: climate change.<\/p><p>McCormick&nbsp;and his ad hoc cofounders grew the project into WattTime, an environmental nonprofit that operates like a tech startup. Today, WattTime still deploys this same app, now called Automated Emissions Reduction, slashing the carbon footprint of growing fleets of electric vehicles, smart thermostats and other devices around the world. In 2019, WattTime and two other nonprofits teamed up to apply for Google.org&#39;s AI Impact Challenge. Their project was to apply AI to satellite imagery in order to monitor emissions from global power plants from space. Google.org accepted and, after the announcement, the teams heard from dozens of experts around the world offering to chip in.<\/p><p>In 2020, McCormick, former US Vice President Al Gore and eight like-minded founders of tech-savvy nonprofits, companies and universities teamed up to cofound the Climate TRACE coalition. Today, Climate TRACE combines their satellites and artificial intelligence to detect human-caused greenhouse gases from all major sources around the world to help empower governments, scientists, companies and activists alike. McCormick&nbsp;continues to enjoy teaming up with fellow nerds hungry to use technology to make a difference.<\/p>","slug":"gavin_mccormick","published_at":"2021-07-26 17:13:00","updated_at":"2021-11-12 01:55:43"}}