{"speaker":{"id":6456,"title":"","firstname":"Vandana","middleinitial":"","lastname":"Singh","description":"Climate imagination fellow","whotheyare":"An author of speculative fiction, professor of physics and interdisciplinary researcher, Vandana Singh is one of the four inaugural Climate Imagination Fellows.","whylisten":"<p>Vandana Singh was born and raised in India, where she acquired an early fascination with science, non-human earthlings and literature. As a teen, she was involved with Kalpavriksh, an environmental justice and action group, where she first learned about the inextricable links between social inequality and ecological problems. She has since become an acclaimed writer of speculative fiction and the author of two short story collections,&nbsp;<em>The Woman Who Thought She Was a Planet and Other Stories<\/em>&nbsp;and&nbsp;<em>Ambiguity Machines and Other Stories<\/em>, the second of which was a finalist for the Philip K. Dick Award. Her most recent work is a chapbook of essays and stories called&nbsp;<em>Utopias of the Third Kind<\/em>&nbsp;from PM Press&rsquo;s Outspoken Authors Series. Her stories have been reprinted in numerous &quot;Year&#39;s Best&quot; anthologies and includes several fictional engagements with the climate crisis.&nbsp;<\/p><p>Singh is also a professor of physics at Framingham State University in Massachusetts. Although her background is in theoretical particle physics, for over a decade she has been working on a transdisciplinary, justice-centered pedagogy of climate change, at the nexus of science, society, justice and futures studies. She has authored a case study for undergraduate education on Arctic climate change and contributed to the US National Academies deliberations on interdisciplinarity in STEM.&nbsp; Her upcoming projects include the use of stories for bringing attention to the experiences of marginalized communities in India facing the brunt of the climatic, societal and biodiversity crises, and a book on a transdisciplinary approach to teaching climate change.<\/p>","slug":"vandana_singh","published_at":"2021-08-10 19:19:00","updated_at":"2022-06-06 17:58:52"}}