{"speaker":{"id":6457,"title":"","firstname":"Bjørn Otto","middleinitial":"","lastname":"Sverdrup","description":"Political scientist, Chair of OGCI","whotheyare":"Bjørn Otto Sverdrup is the Chair of the Executive Committee of the Oil and Gas Climate Initiative, whose industry members account for almost 30 percent of global production.","whylisten":"<p>Bj&oslash;rn Otto Sverdrup&#39;s ambition is to drive change and accelerate climate action in the oil and gas industry. He is Chair of the Oil and Gas Climate Initiative (OGCI), a CEO-led initiative that aims to accelerate the industry&#39;s response to climate change. The OGCI members -- including Shell, BP, Total, Saudi Aramco, Exxon, Chevron, ENI, Repsol, CNPC, Petrobras, Oxy and Equinor -- account for almost 30 percent of global operated oil and gas production. Sverdrup is also a board member of the OGCI&#39;s one-billion USD Climate Investment fund.<\/p><p>Since 2015, Sverdrup&nbsp;has led Equinor&#39;s work on climate and energy transition as head of corporate sustainability. Key achievements include the launch of the ambition to achieve net-zero operations from 2030, reduce absolute emissions in Norway to near zero and make Equinor a net-zero company by 2050. Sverdrup has also been heavily engaged in the development of floating offshore wind solutions.<\/p><p>Following the horrible 2011 terrorist attacks in Norway on Ut&ouml;ya, Sverdrup served as chief of staff for the &quot;July 22 Commission,&quot; appointed by the Prime Minister of Norway, to investigate the attacks and the response. He is a frequent speaker at key industry events and has been a guest lecturer at Imperial College, Columbia University and Harvard Business School. Sverdrup has been a member of the board of directors at Norway&#39;s largest university, NTNU, and a member of the advisory board at the master program of the Grantham Institute of the Imperial College in London. He is a political scientist and former research fellow from the University of Oslo. He is the father of three children.<\/p><p>(Photo: Ole J&oslash;rgen Bratland)<\/p>","slug":"bjorn_otto_sverdrup","published_at":"2021-08-10 19:22:00","updated_at":"2022-01-10 16:14:12"}}