{"speaker":{"id":6462,"title":"","firstname":"Rachel","middleinitial":"","lastname":"Kyte","description":"Sustainable development diplomat, educator, activist","whotheyare":"Rachel Kyte works to mobilize finance and spur action along a critical path towards a resilient, inclusive and decarbonized world.","whylisten":"<p>Rachel Kyte has spent her career at the intersection of sustainable development, finance and climate policy, working in civil society, international organizations, multilateral development banks and the private sector. Driven by a commitment to leave no one behind and for more effective policy, she has worked most recently to identify the critical path to energy systems that ensure clean, affordable and reliable energy for all and how to finance the energy transition. She has also worked to mobilize funds and shift the financial system to better act in support of global goals. She moved from leadership in civil society organizations to senior leadership positions at the International Finance Corporation and the World Bank, and then as special representative to the UN Secretary-General and CEO of SEforALL.<\/p><p>A&nbsp;lifelong advocate for women, Kyte brings a strong commitment to actively sponsoring young people in her work. Now serving as Dean of The Fletcher School at Tufts University, she aims to ensure that climate change is taught, together with other new threats, as the context for all fields of study in a global affairs education. She focuses on preparing tomorrow&rsquo;s leaders for our rapidly decarbonizing, digitalized, deeply unequal world.<\/p><p>Kyte serves as an advisor to the UN Secretary-General, is a friend of COP26, serves as a trustee of organizations in the climate and finance space and is an advisor to funds committed to carbon-neutral investing. She is also the co-chair of the Voluntary Carbon Markets Integrity Initiative focused on achieving the highest standards of integrity in carbon markets as a critical component of halting global heating and directing investment to protect critical natural resources.<\/p>","slug":"rachel_kyte","published_at":"2021-08-10 19:27:00","updated_at":"2022-01-10 16:54:19"}}