{"speaker":{"id":6465,"title":"","firstname":"Gabrielle","middleinitial":"","lastname":"Walker","description":"Writer, climate thinker and strategist","whotheyare":"Gabrielle Walker wants to marry the power of nature and human ingenuity to take carbon out of the air -- and keep it out.","whylisten":"<p>Gabrielle Walker is a passionate advocate for climate action, focused on the intersection between business, NGOs, governments and philanthropy. She formed Valence Solutions to catalyze faster change in the sectors that are hardest to decarbonize, have the biggest potential for impact and are being addressed by the fewest other groups. Valence is currently working in partnership with the UNFCCC Climate Champions on Rethinking Removals, a program that aims to accelerate action in the confused but vital area of carbon removals\/negative emissions and figure out how to do them right.&nbsp;<\/p><p>Walker has been working on climate change for nearly three decades. She was climate editor at <em>Nature<\/em> and features editor at <em>New Scientist<\/em>, has written countless magazine and newspaper articles, broadcast many programs for the BBC (TV and Radio) and has authored four books, including co-authoring the bestselling book <em>The Hot Topic: How to Tackle Global Warming and Still Keep the Lights On<\/em>, which was described by Al Gore as &quot;a beacon of clarity&quot; and by the <em>Times<\/em> as &quot;a material gain for the axis of good.&quot;<\/p><p>Walker gives keynote addresses to corporate audiences around the world and is an accomplished moderator of high-level debates, guiding panels involving CEOs, former heads of state, government ministers, military generals and humanitarian leaders. She has worked at senior level with global companies in most sectors from finance and energy to consumer goods, transport and heavy industry. She has a PhD from Cambridge University and has taught at both Cambridge and Princeton.<\/p>","slug":"gabrielle_walker","published_at":"2021-08-10 19:32:00","updated_at":"2022-01-18 22:29:03"}}