{"speaker":{"id":6476,"title":"","firstname":"Sister True","middleinitial":"","lastname":"Dedication","description":"Zen Buddhist nun","whotheyare":"Sister True Dedication is a Zen Buddhist nun ordained by Thich Nhat Hanh, the editor of several of his books and a leading voice in a new generation of young monastics.","whylisten":"<p>Sister True Dedication is a former journalist and Zen Buddhist nun ordained by Thich Nhat Hanh. She is the editor of his latest book,&nbsp;<a href=\"https:\/\/bookshop.org\/books\/zen-and-the-art-of-saving-the-planet\/9780062954794 \" target=\"_blank\"><em>Zen and the Art of Saving the Planet<\/em><\/a> (2021), as well as his books <em>The Art of Living<\/em> (2017) and <em>Love Letters to the Earth<\/em> (2013). Before entering the monastery in 2008 at the age of 27, she studied history and political thought at Cambridge University, hosted a feminist blog and worked as a journalist for BBC News in London. In the early years of her monastic training, she assisted Thich Nhat Hanh and Sister Chan Khong in their engaged Buddhist actions for human rights, religious freedom, applied ethics and ecology, accompanying them on official visits to international parliaments, the US Congress and the Vatican.<\/p><p>Sister True Dedication is cofounder of the international&nbsp;<a href=\"https:\/\/wkup.org\/\" target=\"_blank\">Wake Up Movement<\/a>, a community of young meditators who are finding new ways to combine mindfulness and engaged Buddhism. She currently resides at&nbsp;<a href=\"https:\/\/plumvillage.org\/\" target=\"_blank\">Plum Village monastery<\/a> in southwest France, where she spends her time and energy deepening her meditation practice, sharing Thich Nhat Hanh&#39;s teachings with a wide audience online and offline, editing Thich Nhat Hanh&rsquo;s writings and guiding a new generation of young monastics. A determined optimist, she is committed to facing both the deep suffering and extraordinary wonders of life with compassion and courage. She is happiest when taking care of trees, listening to Mother Earth, savoring fresh coffee and acting in comedy skits.<\/p>","slug":"sister_true_dedication","published_at":"2021-08-10 19:46:00","updated_at":"2021-12-06 17:25:43"}}