{"speaker":{"id":6486,"title":"","firstname":"Vera","middleinitial":"","lastname":"Songwe","description":"Economist","whotheyare":"Vera Songwe is the UN Under-Secretary General and the executive secretary of the Economic Commission for Africa.","whylisten":"<p>Vera Songwe is the chief architect of Africa&#39;s response to the financial challenges posed by COVID-19. As executive secretary of the UN Economic Commission for Africa (ECA), Songwe acts as a de facto chairman of the board of Africa&#39;s finance ministers and is their leading advocate with key international lenders such as the World Bank and Paris Club of bilateral creditors. Trained as mathematician and economist, she has more than three decades of experience in senior policy roles at the World Bank and its the private sector counterpart, the International Finance Corporation. She is the first woman to head the ECA -- the UN&#39;s economic decision-making body for Africa -- at the level of Under Secretary-General, a position she has held since August 2017.<\/p><p>Recognizing the central role of private investors as the main sources of capital for African nations, Songwe has developed a unique role as the continent&#39;s central interlocutor with world&#39;s main financial sector trade body, the Institute of International Finance. She has consistently asserted that African countries continue to service their private sector debt obligations (primarily in the form of international bonds), in order to maintain access to international capital markets. As part of this effort, she has developed a special purpose funding vehicle which would keep African nations current on their existing obligations while encouraging private sector investors to purchase in new issues of African sovereign debt. This innovative funding structure complements a previous initiative she led in conjunction with the fixed income asset manager PIMCO, which is aimed at guaranteeing liquidity for African debt markets and thereby allowing the continent&rsquo;s continued access to development capital. Songwe emphasizes the need to support the private sector throughout the continent because of the extent to which small and medium private enterprises provide employment in both the formal and informal sector. In this way, the African countries can mitigate the worst financial dislocations caused by the pandemic.<\/p>","slug":"vera_songwe","published_at":"2021-08-12 16:42:00","updated_at":"2022-03-04 16:33:44"}}