{"speaker":{"id":655,"title":"","firstname":"Stephen","middleinitial":"","lastname":"Wolfram","description":"Scientist, inventor","whotheyare":"Stephen Wolfram is the creator of Mathematica and Wolfram|Alpha, the author of <em>A New Kind of Science<\/em>, and the founder and CEO of Wolfram Research.","whylisten":"<p>Stephen Wolfram published his first scientific paper at the age of 15, and received his PhD in theoretical physics from Caltech by the age of 20. Having started to use computers in 1973, Wolfram rapidly became <strong>a leader in the emerging field of scientific computing<\/strong>.<br \/><br \/>In 1981 Wolfram became the youngest recipient of a MacArthur Prize Fellowship. He then set out on an ambitious new direction in science aimed at understanding the origins of complexity in nature. Wolfram&#39;s first key idea was to use computer experiments to study the behavior of <strong>simple computer programs known as cellular automata<\/strong>. This allowed him to make a series of startling discoveries about the origins of complexity.<br \/><br \/>Wolfram founded the first research center and the first journal in the field, Complex Systems, and began the development of Mathematica. Wolfram Research soon became a world leader in the software industry -- widely recognized for excellence in both technology and business.<br \/><br \/>Following the release of Mathematica Version 2 in 1991, Wolfram began to divide his time between Mathematica development and scientific research. Building on his work from the mid-1980s, and now with Mathematica as a tool, Wolfram made a rapid succession of major new discoveries, which he described in his book,&nbsp;<a href=\"http:\/\/geni.us\/newkindofscience\" target=\"_blank\"><em>A New Kind of Science<\/em><\/a>.<br \/><br \/>Building on Mathematica, <em>A New Kind of Science<\/em>, and the success of Wolfram Research, Wolfram recently launched <a href=\"http:\/\/www.wolframalpha.com\/\" target=\"_blank\">Wolfram|Alpha<\/a>  -- an ambitious, long-term project <strong>to make as much of the world&#39;s knowledge as possible computable<\/strong>, and accessible to everyone.<\/p>","slug":"stephen_wolfram","published_at":"2010-01-21 12:07:00","updated_at":"2015-10-03 18:26:21"}}