{"speaker":{"id":66,"title":"","firstname":"Eve","middleinitial":"","lastname":"Ensler","description":"Playwright, activist","whotheyare":"Eve Ensler created the groundbreaking \"Vagina Monologues,\" whose success propelled her to found V-Day -- a movement to end violence against women and girls everywhere.","whylisten":"<p>Eve Ensler is the Tony Award-winning playwright, activist and author of the Obie Award-winning theatrical phenomenon <em>The Vagina Monologues<\/em>, published in over 48 languages, performed in over 140 countries. Her plays include <em>Lemonade<\/em>, <em>Extraordinary Measures<\/em>, <em>Necessary Targets<\/em>, <em>OPC<\/em>, <em>The Good Body<\/em>, <em>Emotional Creature<\/em> and <em>Fruit Trilogy<\/em>. She starred in her one-woman play, <em>In the Body of the World<\/em>, adapted from her memoir. Her most recent book, <em>The Apology<\/em>, has been called &ldquo;transfixing,&rdquo; &ldquo;revelatory&rdquo; and &ldquo;cathartic.&rdquo; Her writings appear regularly in <em>The Guardian<\/em> and <em>TIME Magazine<\/em>.<\/p><p>Ensler is the founder of V-Day, a global activist movement which, over the course of more than two decades, has raised over 100 million dollars to end violence against all women and girls -- cisgender, transgender and gender non-conforming. She is also the founder of One Billion Rising, the largest global mass action to end gender-based violence in over 200 countries.&nbsp;<\/p><p>Ensler is a cofounder of the City of Joy, a revolutionary center for women survivors of violence in the DRC, along with Christine Schuler Deschyrver and Dr. Denis Mukwege, all of whom appeared in the documentary film <em>City of Joy<\/em>, released globally as a Netflix Original in 2019. Ensler has been named one of <em>Newsweek<\/em>&rsquo;s &ldquo;150 Women Who Changed the World&rdquo; and <em>The Guardian<\/em>&rsquo;s &ldquo;100 Most Influential Women.&rdquo;<\/p><p>(Photo credit: Paula Allen)<\/p>","slug":"eve_ensler","published_at":"2007-02-19 13:23:00","updated_at":"2019-12-06 18:03:05"}}