{"speaker":{"id":6600,"title":"","firstname":"Jimmie","middleinitial":"","lastname":"Briggs","description":"Essayist, intersectional justice advocate","whotheyare":"Jimmie Briggs is an essayist, journalist and advocate for racial and gender justice.","whylisten":"<p>Jimmie Briggs was a co-founder of the Man Up Campaign, a global initiative for catalyzing youth to stop violence against women and girls. This led to his selection as the winner of the 2010&nbsp;<em>GQ<\/em>&nbsp;magazine &quot;Better Men Better World&quot; search, and as one of the Women&#39;s eNews &quot;21 Leaders for the 21st Century.&quot; A member of the New York City Gender Equity Commission in the administration of Mayor Bill DeBlasio, he has worked as an adjunct professor of investigative journalism at the New School for Social Research and was a George A. Miller Visiting Professor in the Department of African and African-American Studies at the University of Illinois: Champaign-Urbana. For more than decade, he also taught documentary journalism at the International Center of Photography.&nbsp;<\/p><p>Briggs holds a BA in philosophy from Morehouse College as well as a Medal of Distinction from Barnard College. He currently contributes to <em>Vanity Fair<\/em> and <em>The Guardian,<\/em>&nbsp;among other publications. A National Magazine Award finalist, Briggs&#39;s book&nbsp;<a href=\"https:\/\/geni.us\/edkv\" target=\"_blank\"><em>Innocents Lost: When Child Soldiers Go To War<\/em><\/a>&nbsp;investigates war-affected children around the world. Presently, he is finishing an oral history project on the community of Ferguson, Missouri in the aftermath of the 2014 death of Michael Brown, Jr., as well as designing a book of collected essays on manhood, race and trauma. He is the recipient of awards and fellowships from the National Association of Black Journalists, the Congressional Black Caucus and the Carter Center for Mental Health Journalism.<\/p>","slug":"jimmie_briggs","published_at":"2021-11-02 15:40:00","updated_at":"2022-03-15 14:18:02"}}