{"speaker":{"id":6608,"title":"","firstname":"Nyra","middleinitial":"","lastname":"Jordan","description":"Social impact investor","whotheyare":"Nyra Jordan is an impact investor and social justice activist dedicated to elevating the voices of community change-makers.","whylisten":"<p>Nyra Jordan&nbsp;is one of the founding directors of the American Family Insurance Institute for Corporate and Social Impact, a Madison, Wisconsin-based innovation hub that leverages venture capital investment and transformative public and private partnerships to address major challenges facing the US. These challenges include diminished family economic security, an uncertain national economy, educational disparities, mass incarceration, climate change, systemic racism and other social determinants of health, along with and the void in effective leadership around these issues. As social impact investment director, Jordan&#39;s goal is to engage with innovative initiatives, investments and partnerships that allow more families to gain wealth and enjoy their American Dream.<\/p><p>In addition to leading and implementing initiatives to assess whether internal operations and practices are consistent with social justice values, Jordan amplifies community experts and founders focused on people-centered technology solutions for those impacted by the justice system. She believes that tech can create opportunities and help reduce inequities in the criminal and civil justice system -- but only if it is designed by, with and for people with direct experience in the system or those who have dedicated their lives to criminal and civil justice change. She is also co-creating a coalition to bring funding to underrepresented founders by convening entrepreneurs and investors within the justice tech sector.<\/p><p>Jordan launched her career in the nonprofit space and currently serves on several boards and task forces that include community members, elected officials and law enforcement to drive systemic change. She is committed to transformation that will bring equality to America by increasing access to opportunity and establishing social equity.<\/p>","slug":"nyra_jordan","published_at":"2021-11-09 20:03:00","updated_at":"2021-11-29 16:31:45"}}