{"speaker":{"id":6609,"title":"","firstname":"Brittany K.","middleinitial":"","lastname":"Barnett","description":"Attorney, entrepreneur, author","whotheyare":"Brittany K. Barnett is a best-selling author, attorney and entrepreneur who thrives at the intersection of hope, justice and freedom.","whylisten":"<p>As a corporate attorney, Brittany K. Barnett&nbsp;was committed to pro bono representation of clients unjustly sentenced under federal drug laws. Her dedication to this life-changing work resulted in freedom for numerous people serving fundamental death sentences for federal drug offenses -- including seven clients who received executive clemency from President Barack Obama. As the daughter of a formerly incarcerated mother, Barnett knows firsthand the far-reaching impact of mass incarceration, devastating families and entire communities.<\/p><p>Dedicated to transforming the criminal justice system, Barnett founded two nonprofits to carry out her life&#39;s work: Girls Embracing Mothers, dedicated to empowering girls with mothers in prison, and the Buried Alive Project, which fights to free people buried alive under outdated federal drug laws. Her work is multi-dimensional, seeking not only to free people from prison but also to cultivate their creative and entrepreneurial powers to better the world.<\/p><p>Barnett is also the founder of the Manifest Freedom Fund and Milena Reign, social enterprises devoted to shifting the paradigm to show the world-changing impact that justice-impacted entrepreneurs can have when they have access to capital and resources not to merely survive, but to thrive. Her book, <em>A Knock at Midnight: A Story of Hope, Justice, and Freedom<\/em>, was released to critical acclaim and selected as an NAACP Image Award nominee and <em>Los Angeles Times<\/em> Book Prize Finalist. She is a graduate of SMU&#39;s Dedman School of Law and holds bachelor&#39;s and master&#39;s degrees in accounting.<\/p>","slug":"brittany_k_barnett","published_at":"2021-11-09 20:03:00","updated_at":"2022-01-07 01:56:20"}}