{"speaker":{"id":662,"title":"","firstname":"Jamie","middleinitial":"","lastname":"Heywood","description":"Healthcare revolutionary","whotheyare":"When MIT-trained mechanical engineer Jamie Heywood discovered that his younger brother was diagnosed with the terminal illness ALS, he focused all his energy on founding revolutionary healthcare initiatives to help his brother and others like him. ","whylisten":"<p><strong>After finding out that his brother, Stephen, had the terminal illness ALS, Jamie Haywood founded the <a href=\"http:\/\/www.als.net\/\">ALS Therapy Development Institute<\/a><\/strong> in 1999. ALS TDI is the world&rsquo;s first non-profit biotechnology company and accelerated research on the disease by hiring scientists to develop treatments outside of academia and for-profit corporations. They were the first to publish research on the safety of using stem cells in ALS patients.<\/p><p> In 2005,Jamie and his youngest brother Ben, along with close friend Jeff Cole, built <strong><a href=\"http:\/\/www.patientslikeme.com\/\">PatientsLikeMe.com<\/a> to give patients control and access to their healthcare information and compare it to others like them.<\/strong> Its bold (and somewhat controversial) approach involves aggregating users health info in order to test the effects of particular treatments, bypassing clinical trials. It was named one of &quot;15 companies that will change the world&quot; by CNN Money.<br \/><br \/>Although his brother passed away in the fall of 2006, Jamie continues to serve as chairman of PatientsLikeMe and on the board of directors of ALS TDI. Jamie has raised over $50 million dollars for ALS TDI and was the subject of the biography <em><a href=\"http:\/\/www.jonathanweiner.com\/keeper.html\">His Brother&rsquo;s Keeper<\/a><\/em>, written by Jonathan Weiner. He was also featured in the documentary <em><a href=\"http:\/\/www.pbs.org\/wgbh\/pages\/frontline\/somuchsofast\/\">So Much So Fast<\/a><\/em>, exploring the development of ALS TDI and the personal story of he and Stephen.<\/p> ","slug":"jamie_heywood","published_at":"2010-02-02 07:06:00","updated_at":"2010-02-02 09:35:22"}}