{"speaker":{"id":6643,"title":"","firstname":"Deval","middleinitial":"","lastname":"Patrick","description":"","whotheyare":"Deval Patrick is a poor kid from the South Side of Chicago who, with grit, determination and the help and kindness of others, has lived the American Dream.","whylisten":"<p>Committed to honoring his opportunity by leaving things better for those who come behind, Deval Patrick has served as a civil rights and business lawyer, a senior official in the federal government, an executive in two Fortune 50 companies, an entrepreneur and investor. He was the 71st governor of Massachusetts -- the first Black person to serve in the role -- and one of only two Black governors elected in American history.<\/p><p>Under his leadership, and through unprecedented investments in education, innovation and infrastructure, Massachusetts ranked first in the nation in student achievement, energy efficiency, veterans services and entrepreneurship; delivered health care coverage to over 98% of the state&rsquo;s residents; and emerged from recession to achieve a 25-year high in employment. Patrick remains involved in progressive politics as co-chair of American Bridge 21st Century through its BridgeTogether initiative, which supports local grassroots groups working to engage disenfranchised and marginalized voters throughout the country.&nbsp;<\/p><p>Patrick is a Rockefeller Fellow, a Crown Fellow of the Aspen Institute and the author of two books,&nbsp;<a href=\"https:\/\/www.amazon.com\/Reason-Believe-Lessons-Improbable-Life\/dp\/0767931122\" target=\"_blank\"><em>A Reason to Believe: Lessons from an Improbable Life<\/em><\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.amazon.com\/Faith-Dream-Nation-Reclaim-American-ebook\/dp\/B007FSIL56\" target=\"_blank\"><em>Faith in the Dream: A Call to the Nation to Reclaim American Values<\/em><\/a>.<\/p><p>He spends most of his time in Western Massachusetts with his wife Diane, his dogs and his bees.<\/p><a href=\"https:\/\/www.amazon.com\/Faith-Dream-Nation-Reclaim-American-ebook\/dp\/B007FSIL56\" target=\"_blank\"><\/a> <p>&nbsp;<\/p><div><br \/><\/div>","slug":"deval_patrick","published_at":"2022-01-18 18:59:00","updated_at":"2022-01-26 22:46:41"}}