{"speaker":{"id":6646,"title":"","firstname":"Katie","middleinitial":"","lastname":"McGinty","description":"Sustainability expert","whotheyare":"Kathleen \"Katie\" McGinty is vice president and chief sustainability and external relations officer for Johnson Controls, a global leader for smart, healthy and sustainable buildings technology. Johnson Controls signed The Climate Pledge in 2021, joining hundreds of leading global companies with a commitment to be net-zero carbon by 2040.","whylisten":"<p>Katie McGinty serves on the executive committee for Johnson Controls and helps drive the company&#39;s top-tier sustainability performance, including recognition as one of the world&#39;s 100 most sustainable corporations.<\/p><p>McGinty champions technology development, sustainability and creative policies to solve tough environmental problems. She loves opportunities where she can work with people who bring diverse insights and ideas to help chart a positive course for the future of the planet. With her team, McGinty&nbsp;is driven by staying on the cutting edge of new trends, ideas and themes to tackle climate change, encourage smart buildings and energy efficiency, drive impactful net-zero carbon strategies and bring forward initiatives, technologies and partnerships needed to get the job done.<\/p><p>McGinty has more than 25 years of public and private sector experience, and she is a recognized innovator in clean energy and environmental protection. Her public sector career includes being the first woman to serve as chair of the White House Council on Environmental Quality and as deputy assistant to President Bill Clinton (1993-1998), as Pennsylvania&#39;s secretary of environmental protection (2003-2008) and as chair of the Pennsylvania Energy Development Authority (2004-2008).<\/p><p>McGinty holds a bachelor&#39;s degree in chemistry from St. Joseph&#39;s University and a law degree from Columbia University. She served as a senior visiting fellow at TERI in New Delhi, India. McGinty&nbsp;has received honorary doctorates from Muhlenberg University, Dickinson College and Clarion State University.<\/p>","slug":"katie_mcginty","published_at":"2022-01-21 16:19:00","updated_at":"2022-01-31 15:33:21"}}