{"speaker":{"id":6660,"title":"","firstname":"Ken","middleinitial":"","lastname":"Chenault","description":"Business leader","whotheyare":"Ken Chenault invests in fast-growing companies that have the potential to become large, fundamental institutions.","whylisten":"<p>Ken Chenault is the chairman and managing director of the venture capital firm General Catalyst, where he invests in fast-growing companies and provides guidance to portfolio companies, particularly to those with an eye towards global markets and responsible innovation, as they scale their teams and products. Prior to joining General Catalyst, he was chairman and CEO of American Express, a position he held from 2001-2018. Upon his retirement from American Express, Warren Buffett, the company&rsquo;s largest shareholder, stated, &quot;Ken&#39;s been the gold standard for corporate leadership and the benchmark that I measure others against.&quot;<\/p><p>Chenault is recognized as one of the business world&#39;s experts on brands and brand management. He has been honored by multiple publications, including <em>Fortune<\/em> magazine, which named him as one of the &quot;World&#39;s 50 Greatest Leaders&quot; in its inaugural list in 2014 and, most recently, in 2021. <em>TIME<\/em> celebrated Chenault together with Ken Frazier in the TIME100 &quot;Most Influential People of 2021&quot; list for their corporate and social activism. This recognition was specifically for mobilizing hundreds of corporate leaders to advocate for equitable voting rights in the US and for cofounding OneTen, a coalition of leading executives coming together to upskill, hire and advance one million Black Americans over the next 10 years into family-sustaining jobs with opportunities for advancement. Chenault serves on the boards of Airbnb, Berkshire Hathaway, Chief, Guild Education and the Harvard Corporation. He also serves on the boards of numerous nonprofit organizations, including the Smithsonian Institutions&#39;s Advisory Council for the National Museum of African American History and Culture.<\/p>","slug":"ken_chenault","published_at":"2022-02-16 21:28:00","updated_at":"2022-05-25 13:38:25"}}