{"speaker":{"id":67,"title":"","firstname":"Anna","middleinitial":"","lastname":"Deavere Smith","description":"Actor, playwright, social critic","whotheyare":"Anna Deavere Smith's ground-breaking solo shows blur the lines between theater and journalism, using text from real-life encounters to create gripping portraits.","whylisten":"<p>Hailed by <em>Newsweek<\/em> as &quot;the most exciting individual in American theater,&quot; Anna Deavere Smith uses solo performance as a public medium to <strong>explore issues of race, identity and community in America<\/strong>. Her grandfather once told her, &quot;Say a word often enough, and it becomes you.&quot;<\/p><p>Inspired by this and Walt Whitman&#39;s idea &quot;to absorb America,&quot; Deavere Smith began interviewing people (more than 2,000 now) across the country some 20 years ago. Without props, sets or costumes, she translates those encounters into profound performances, each drawing verbatim from the original recorded interview. <strong>She has an uncanny ability to inhabit the characters -- or rather the people -- she&#39;s representing <\/strong>onstage, regardless of their race, gender or age. And while her approach to cultural commentary is now widely imitated, she remains the master of the form. Her play, <a href=\"http:\/\/events.stanford.edu\/events\/95\/9520\/\" target=\"_blank\"><em>Let Me Down Easy<\/em><\/a>, premiered this year at the Long Wharf Theater. <\/p><p>Deavere Smith is perhaps best known for her examination of race relations, having written and performed <em> <a href=\"http:\/\/books.google.com\/books?id=XtNoLSy35IsC&amp;dq=fires+in+the+mirror&amp;printsec=frontcover&amp;source=web&amp;ots=-snQjEdv6L&amp;sig=2Sgqq5C_qgsSZvWywvwAc6onidY#PPA6,M1\" target=\"_blank\">Fires in the Mirror<\/a>,<\/em> a raw view of those affected by the Crown Heights riots of 1991, and <em><a href=\"http:\/\/www.imdb.com\/title\/tt0237865\/\" target=\"_blank\">Twilight: Los Angeles<\/a>,<\/em> which tackled the 1992 Los Angeles riots. Along the way, she&#39;s earned two Obies, <strong>a MacArthur &quot;genius&quot; grant<\/strong>, and several Tony nominations, while also teaching at Stanford and NYU, and roles on such shows as <em>The West Wing<\/em> and HBO&#39;s <em><a href=\"http:\/\/www.hbo.com\/films\/lifesupport\/\" target=\"_blank\">Life Support<\/a>. <\/em>Her most recent book is <em><a href=\"http:\/\/www.randomhouse.com\/anchor\/catalog\/display.pperl?isbn=9781400032389\" target=\"_blank\">Letters to a Young Artist: Straight Up Advice on Making a Life in the Arts<\/a>,<\/em> and she is the founding director of the <a href=\"http:\/\/www.artsandcivicdialogue.org\/\" target=\"_blank\">Institute on the Arts and Civic Dialogue<\/a>, a group that brings together artists to make works about social change. <\/p> ","slug":"anna_deavere_smith","published_at":"2007-02-19 14:27:00","updated_at":"2016-07-14 16:07:40"}}