{"speaker":{"id":6767,"title":"","firstname":"Damien","middleinitial":"","lastname":"Riehl","description":"Lawyer, musician, technologist","whotheyare":"Damien Riehl is a lawyer, musician and technologist with experience in complex litigation, digital forensics and software development.","whylisten":"<p>A coder since 1985 and for the web since 1995, Damien&nbsp;Riehl clerked for the chief judges of state and federal courts, practiced in complex litigation for over a decade, has led teams of cybersecurity and world-spanning digital forensics investigations as well as legal-software development.<\/p><p>An appointee of the Minnesota Governor&rsquo;s Council on Connected and Automated Vehicles, he has helped recommend changes to Minnesota statutes, rules and policies &mdash; all related to connected and autonomous vehicles. As a leader of the legal-data standard SALI, Riehl has greatly expanded a taxonomy of 10,000 legal elements that matter, helping the legal industry&#39;s AI and data-analytics development. At Fastcase, he helps lead the design, development and expansion of Fastcase&#39;s various products, integrating AI-backed technologies to improve legal workflows and to power legal data analytics.<\/p><p>Riehl and Noah Rubin also co-founded the All the Music project. To date, they have computationally composed over 400,000,000,000 (400B) melodies, written them to disc (fixed in a tangible medium) and given the public access through Creative Commons Zero (CC0), which provides rights similar to rights to works in the Public Domain. Their project has contributed to discussions between lawyers, musicians and music-industry professionals regarding (1) copyrightability of machine-created works and (2) copyrightability of melodies alone.<\/p><p>During the pandemic, Riehl began producing videos for virtual choirs, including the choir he founded, Schola Diffusa, whose singers span five continents.<\/p>","slug":"damien_riehl","published_at":"2022-03-24 20:15:00","updated_at":"2022-03-25 15:07:17"}}