{"speaker":{"id":6789,"title":"","firstname":"Margaret","middleinitial":"","lastname":"Levi","description":"Political economist","whotheyare":"Margaret Levi is committed to promoting equity and equality by ensuring that political, economic and social arrangements enable the flourishing of all.  ","whylisten":"<div>Margaret Levi was raised in the shadow of the Holocaust, polio, nuclear bombs and McCarthyism. Her mother, who died as the Trump presidency began, claimed the McCarthy era was the most terrifying time of her life. Levi&#39;s mother bequeathed to her a drive to prevent its reprisal. In those same early years, the family went together to civil rights marches to signal the support of middle-class white people.&nbsp; At 16 in 1963, Margaret was on the lawn of the Lincoln Memorial listening to Martin Luther King Jr.&#39;s historic speech. She learned early on that governments and laws often fail to serve all of their populations equally. She also learned how polarized the US is; there are deep-seated disagreements, often involving very different notions of who our enemies are and who constitutes our nation.&nbsp;&nbsp;<\/div><div><br \/><\/div><div>Levi toyed with an activist career but became a scholar and teacher, a professor of political science, with a commitment to understanding the conditions under which people come to believe their governments are legitimate and the consequences of those beliefs for compliance, consent and the rule of law. Always interested in labor unions, she became the Harry Bridges Chair of Labor Studies at the University of Washington. She subsequently began her investigations of how organizations provoke member willingness to act beyond material interest.&nbsp;<\/div><div><br \/><\/div><div>She has been much awarded and recognized throughout her long career, including receiving the Johann Skytte Prize, often considered the Nobel Prize in political science. Levi is now completing her term as Director of the storied Center for Advanced Study of Behavioral Sciences (CASBS) at Stanford but will continue to direct its Moral Political Economy program.&nbsp;<\/div>","slug":"margaret_levi","published_at":"2022-05-09 16:23:00","updated_at":"2022-05-23 18:14:41"}}