{"speaker":{"id":6790,"title":"","firstname":"Julieanna L.","middleinitial":"","lastname":"Richardson","description":"Founder of The HistoryMakers","whotheyare":"Julieanna L. Richardson has a diverse background in theatre, television production, and the cable television industry that created a unique path to founding and heading up the largest national collection effort of African American video oral histories on record since the WPA Slave Narratives. T","whylisten":"<p>Julieanna L. Richardson is Founder and President of The HistoryMakers. The HistoryMakers is a national, 501(c)(3) non-profit educational institution headquartered in Chicago. The HistoryMakers organization is committed to preserving, developing and providing easy access to an internationally recognized archival collection of thousands of African American video oral histories.&nbsp;<\/p><p>A 1980 graduate of Harvard Law School, Richardson graduated from Brandeis University with a double-major in Theatre Arts and American Studies, where she did extensive oral history interviews on the Harlem Renaissance and Langston Hughes. She worked as a corporate lawyer at the Chicago law firm of Jenner and Block prior to serving in the early 1980s as the Cable Administrator for the City of Chicago Office of Cable Communications.<\/p><p>Richardson currently sits on the Honors Council of Lawyers for the Creative Arts. She has been awarded Honorary Doctorates from Howard University (2012), Dominican University (2014) and Brandeis University (2016). She has also served as the commencement speaker for Dominican University as well as Brandeis University 65th commencement.&nbsp; In 2014, <em>Black Enterprise<\/em> magazine awarded Richardson its 2014 Legacy Award, its highest recognition of women&rsquo;s achievement. That same year, Richardson was profiled in American Masters: The Boomer List, a PBS documentary and exhibition at the Newseum in Washington, DC.&nbsp;<\/p>","slug":"julieanna_l_richardson","published_at":"2022-05-10 02:23:00","updated_at":"2022-06-17 15:08:25"}}