{"speaker":{"id":683,"title":"","firstname":"Alan","middleinitial":"","lastname":"Siegel","description":"Executive, simplicity guru","whotheyare":"A branding expert and one of the leading authorities on business communication, Alan Siegel wants to put plain English into legal documents for government and business.","whylisten":"<p>Almost nothing so mundane renders as many beads of sweat on the foreheads of the citizens of the United States than the looming of April 15, the day of the dreaded yearly income tax mail-ins. But Alan Siegel says the better portion of that anxiety ain&#39;t necessarily the pay hit -- it&#39;s <strong>navigating the legendarily confusing jungle of jargon <\/strong>(and cluttered checkboxes) that constitutes the IRS&#39;s tax forms. It&#39;s more than a question of convenience to individuals, he emphasizes; as our society&#39;s systems get more complicated, the perplexing legal documents that make them run are becoming more of a drain, undermining our potential prosperity.<br \/><br \/>It&#39;s also a problem that&#39;s bigger than taxes; it&#39;s even bigger than the United States. Siegel, <strong>one of the world&#39;s foremost branding experts<\/strong> (he&#39;s founder and chairman of brand consultancy Siegel+Gale) notes that the world is suffering from an epidemic of legalese: fear of loopholes and lawsuits is forcing the world&#39;s attorneys, contract designers and EULA scribes to take their art form to historically impenetrable lows.<\/p><p>Better for us, Siegel has spent decades as a pioneer in the practice of simplification -- as he says, &quot;bringing clarity to such daunting documents as insurance policies, bank loans, mutual fund agreements&quot; and government communications. He hopes to transform the idea of document simplicity from a creative principle into an aggressive movement for change.<br \/><br \/>Siegel was recently director of a project for the IRS to simplify US income tax forms. He has written on the topic for the <em>New York Times<\/em>, <em>Across the Board<\/em>, and the <em>National Law Journal<\/em>.<\/p>","slug":"alan_siegel","published_at":"2010-03-24 08:50:00","updated_at":"2018-12-13 02:42:24"}}