{"speaker":{"id":6833,"title":"","firstname":"Andrea","middleinitial":"","lastname":"Driessen","description":"","whotheyare":"Imagine hearing your eulogy -- while you’re still able to savor it. That’s Andrea Driessen’s mission. And it’s the power and promise of her Gracenotes message. ","whylisten":"<p>Gracenotes are actions that families, friends, and colleagues take that say, &ldquo;I see you. Here&rsquo;s how you matter.&rdquo; They&rsquo;re notes to those who may (or may not!) be dying, that express our sincerest thoughts about one another, while we&rsquo;re still here -- and before it&rsquo;s too late.<\/p><p>Lying at the intersection of mattering, meaning-making, inclusion, belonging, legacy, grief and loss, Gracenotes help us become more resilient, hopeful and collaborative -- especially when life feels precarious and uncertain. They help transform the pain and regret of loss into celebrations of lives well-lived -- and well-shared -- for both givers and receivers.<\/p><p>Through her interactions with people who are dying -- and those who are very much alive -- Driessen has witnessed the life-changing effects this straightforward exercise has on anyone.<\/p><p>Applying a long career in speaking and event design, Driessen presents interactive workshop experiences to organizations around the world to help participants use Gracenotes to foster more meaning, mattering and inclusion. And as a hospice volunteer, Andrea understands the profound power of open communication between those who are dying and their loved ones.<br \/>&nbsp;<br \/>Driessen has devoted her career to helping others communicate their ideas more clearly. Whether via Gracenotes, through messaging that drives business results or by helping thought leaders amplify their genius, she&rsquo;s a communication professional who knows that the right word at the right time can foster enormous change -- in our hearts, relationships and organizations.<br \/>&nbsp;<br \/>She is the author of&nbsp;<a href=\"https:\/\/www.amazon.com\/Non-Obvious-Planning-Kick-Ass-Gatherings-Inspire\/dp\/1940858615\" target=\"_blank\"><em>The Non-Obvious Guide to Event Planning<\/em><\/a>, a book dedicated to her parents for showing what full-on engagement with life looks like until the very end of it.<\/p>","slug":"andrea_driessen","published_at":"2022-07-11 20:25:00","updated_at":"2022-07-14 20:04:11"}}