{"speaker":{"id":6835,"title":"","firstname":"Trish","middleinitial":"","lastname":"Millines Dziko","description":"Education visionary, strategist","whotheyare":"Trish Millines Dziko is the cofounder, Executive Director, visionary and strategist behind the Technology Access Foundation (TAF) -- one of the leading education non-profits educating kids of color to their full potential.","whylisten":"<p>A New Jersey native, Trish Millines Dziko graduated with a BS in Computer Science in 1979 at a time when few people of color and few women were entering the field. Working in the tech sector for nearly two decades, she saw very little change in employee demographics despite tremendous industry growth: Blacks, Latinos, Native Americans and Pacific Islanders remained grossly underrepresented. She felt a calling to do something.<\/p><p>Determined to solve the problem, Dziko left her successful career in tech in 1996 to ensure more young people who looked like her could thrive in this influential field. Her work through Technology Access Foundation (TAF) has evolved from working directly with students and families to addressing the root of the problem -- effective teaching and anti-racist practices in public schools.&nbsp;<\/p><p>Over the past 15 years TAF has partnered public schools and school districts in the United States to help them create collaborative, anti-racist learning environments grounded in equity using the TAF academic model. With a 95 percent graduation rate and 91 percent entering college, the TAF academic model is a proof point for the nation that all kids can learn at the highest levels if they are all given the same opportunities.<\/p><p>TAF&rsquo;s model ensures that students learn through doing, are full partners in their learning experience and have teachers that share their cultural backgrounds. All of this is done in a way that celebrates their culture and embraces their place as future leaders and change makers. Ensuring that students possess the skills they need to create a world they envision personally, communally, nationally, and globally. With this approach, Dziko believes every industry benefits.<\/p>","slug":"trish_millines_dziko","published_at":"2022-07-13 18:45:00","updated_at":"2022-07-21 14:39:02"}}