{"speaker":{"id":684,"title":"","firstname":"Joel","middleinitial":"","lastname":"Levine","description":"Planetary and atmospheric scientist","whotheyare":"Joel Levine studies the atmospheres of Earth and Mars, looking at their origin, evolution, structure and chemistry and climate change. He's the principal investigator of the proposed ARES Mars Airplane Mission.","whylisten":"<p>Joel S. Levine is a senior research scientist in the Science Mission Directorate at NASA&#39;s Langley Research Center, and the principal investigator and chief scientist of the proposed <a href=\"http:\/\/marsairplane.larc.nasa.gov\/\" target=\"_blank\">ARES Mars Airplane Mission<\/a>. ARES (Aerial Regional-scale  Environmental Survey) is a robotic, rocket-powered  Mars airplane designed to investigate the atmosphere, surface and  sub-surface of Mars.<\/p><p>In his research, he studies the atmospheres of Earth and Mars, tracking their development and changes: How similar are they? What can Earth learn from Mars? <\/p><p>His work as an atmospheric scientist had an interesting sideline, as he wrote in <a href=\"http:\/\/www.nasa.gov\/audience\/foreducators\/robotics\/careercorner\/Joel_Levine.html\" target=\"_blank\">this Q&amp;A for students<\/a>: &nbsp; <\/p><p>From 1998 to 2001, at the request of the National Archives and Records  Administration in Washington, D.C., I formed and led a team of NASA  scientists to solve the mystery of why tiny white spots were forming in  the hermetically sealed encasements containing the Declaration of  Independence, the U.S. Constitution and the Bill of Rights. Using  noninvasive techniques that were originally developed to measure trace  gases in Earth&#39;s atmosphere, we solved the problem. We measured very  high concentrations of water vapor in the hermetically sealed  encasements. The high concentrations of water vapor chemically reacted  with the glass encasements, causing the leaching out of alkaline  material from the glass, resulting in the formation of the mysterious  white spots. The situation was corrected in 2001, when personnel at the  National Archives and Records Administration removed the documents from  the original encasements, put them in brand-new encasements and put them  back on display at the National Archives. This was a unique opportunity  to apply NASA-developed technology to solve a non-aerospace problem of  great national interest and concern -- the preservation of the founding  documents of the United States of America!&nbsp; <\/p>","slug":"joel_levine","published_at":"2010-03-25 08:34:00","updated_at":"2010-03-25 09:10:17"}}