{"speaker":{"id":686,"title":"","firstname":"Patsy","middleinitial":"","lastname":"Rodenburg","description":"Acting and voice coach","whotheyare":"A sought-after voice and acting coach, Patsy Rodenburg has worked with some of the world's leading actors.","whylisten":"<p>&quot;To be present or not to be present?&quot; is the question Patsy Rodenburg would ask all of us; she&#39;s trying to bring the <strong>highly practical techniques that make actors successful to the rest of us<\/strong>. There&#39;s often an inflexible screen between us human beings and the performances we&#39;re shoehorned into every day, and we need to tear it out -- establishing a space she calls &quot;<a href=\"http:\/\/geni.us\/secondcircle\" target=\"_blank\">the Second Circle<\/a>&quot;: a state of mind and body where confident, relaxed control allows us establish intimacy and human connection where and when we want it.<br \/><br \/>With years behind her already as the eminent proponent of <strong>the use of Shakespeare in teaching for the present day<\/strong> (not just for actors, but for public speakers, prison inmates, and the mentally ill; see her book <a href=\"http:\/\/geni.us\/speakingshakespeare\" target=\"_blank\"><em>Speaking Shakespeare<\/em><\/a>), she&#39;s also spent years as a voice coach, perhaps Britain&#39;s most highly-regarded. The actors on her formidable roster of have-taughts include Judi Dench, Ian McKellen, Daniel Day-Lewis, many other Oscar-nominees and winners, as well as other shining figures of the silver screen and the stage.<br \/><br \/>As a teacher of acting, Rodenburg is known for <strong>her emphasis of the primacy of the human voice<\/strong>. In her book <em><a href=\"http:\/\/geni.us\/actorspeaks\" target=\"_blank\">The Actor Speaks<\/a><\/em>, she illustrates how solving the frustrating physical challenges of line delivery -- questions as pragmatic as &quot;When do I breathe?&quot; to more philosophical ones like &quot;How to get my message across to other actors?&quot; -- can open up new paths to performances which go beyond stage-ready to unforgettable.<br \/><br \/>She currently serves as Director of Voice at the Guildhall School of Music and Drama and teaches voice at <a href=\"http:\/\/www.michaelhowardstudios.com\/\" target=\"_blank\">Michael Howard Studios<\/a>  in New York City.<\/p>","slug":"patsy_rodenburg","published_at":"2010-03-26 13:45:00","updated_at":"2015-07-10 20:28:23"}}