{"speaker":{"id":69,"title":"","firstname":"Sir Ken","middleinitial":"","lastname":"Robinson","description":"Author, educator","whotheyare":"Creativity expert Sir Ken Robinson challenged the way we educate our children, championing a radical rethink of how our school systems cultivate creativity and acknowledge multiple types of intelligence.","whylisten":"<p>Why don&#39;t we get the best out of people? Sir Ken Robinson believed that it&#39;s because we&#39;ve been educated to become good workers, rather than creative thinkers. Students with restless minds and bodies -- far from being cultivated for their energy and curiosity -- are ignored or even stigmatized, with terrible consequences. &quot;We are educating people out of their creativity,&quot; Robinson said. It&#39;s a message with deep resonance. Robinson&#39;s first TED Talk has been distributed widely around the Web since its release in June 2006. The most popular words framing blog posts on his talk? &quot;Everyone should watch this.&quot;<\/p><p>A visionary cultural leader, Sir Ken led the British government&#39;s 1998 advisory committee on creative and cultural education, a massive inquiry into the significance of creativity in the educational system and the economy, and was knighted in 2003 for his achievements. His 2009 book, <em><a href=\"http:\/\/sirkenrobinson.com\/?page_id=15\" target=\"_blank\">The Element: How Finding Your Passion Changes Everything<\/a><\/em>, is a&nbsp;<em>New York Times<\/em> bestseller and has been translated into 21 languages. A 10th-anniversary edition of his classic work on creativity and innovation,&nbsp;<a href=\"http:\/\/sirkenrobinson.com\/?page_id=15\" target=\"_blank\"><em>Out of Our Minds: Learning to be Creative<\/em><\/a>, was published in 2011. His 2013 book,&nbsp;<a href=\"http:\/\/sirkenrobinson.com\/?page_id=420\" target=\"_blank\"><em>Finding Your Element: How to Discover Your Talents and Passions and Transform Your Life<\/em><\/a>, is a practical guide that answers questions about finding your personal Element. And in&nbsp;<a href=\"http:\/\/sirkenrobinson.com\/creative-schools-the-grassroots-revolution-thats-transforming-education\/\" target=\"_blank\"><em>Creative Schools: The Grassroots Revolution That&rsquo;s Transforming Education<\/em><\/a>,&nbsp;he reasoned for an end to our outmoded industrial educational system and proposed a highly personalized, organic approach that draws on today&rsquo;s unprecedented technological and professional resources to engage all students.<\/p>","slug":"sir_ken_robinson","published_at":"2007-02-19 14:43:00","updated_at":"2020-12-17 16:11:40"}}