{"speaker":{"id":7,"title":"","firstname":"Craig","middleinitial":"","lastname":"Venter","description":"Biologist, genetics pioneer","whotheyare":"In 2001, Craig Venter made headlines for sequencing the human genome. In 2003, he started mapping the ocean's biodiversity. And now he's created the first synthetic lifeforms -- microorganisms that can produce alternative fuels.","whylisten":"<p>Craig Venter, the man who led the private effort to sequence the human genome, is hard at work now on even more potentially world-changing projects. <\/p><p>First, there&#39;s his mission aboard the <em><a href=\"http:\/\/www.sorcerer2expedition.org\/version1\/HTML\/main.htm\" target=\"_blank\">Sorcerer II<\/a>,<\/em> a 92-foot yacht<strong>, <\/strong>which, in 2006, finished its voyage around the globe to sample, catalouge and decode the genes of the ocean&#39;s unknown microorganisms. Quite a task, when you consider that there are tens of millions of microbes in a single drop of sea water. Then there&#39;s the <a href=\"http:\/\/www.jcvi.org\/\" target=\"_blank\">J. Craig Venter Institute<\/a>, a nonprofit dedicated to researching genomics and exploring its societal implications. <\/p><p>In 2005, Venter founded <a href=\"http:\/\/www.syntheticgenomics.com\/about.htm\" target=\"_blank\">Synthetic Genomics<\/a>, a private company with <strong>a provocative mission: to engineer new life forms<\/strong>. Its goal is to design, synthesize and assemble <a href=\"http:\/\/en.wikipedia.org\/wiki\/Mycoplasma_laboratorium\" target=\"_blank\">synthetic microorganisms<\/a>  that will produce alternative fuels, such as ethanol or hydrogen. He was on <a href=\"http:\/\/www.time.com\/time\/\" target=\"_blank\"><em>Time<\/em><\/a>  magzine&#39;s 2007 list of the <a href=\"http:\/\/www.time.com\/time\/specials\/2007\/time100\" target=\"_blank\">100 Most Influential People in the World.<\/a> <\/p><p>In early 2008, scientists at the J. Craig Venter Institute announced that they had manufactured the entire genome of a bacterium by painstakingly stitching together its chemical components. By sequencing a genome, scientists can begin to custom-design bootable organisms, creating biological robots that can produce from scratch chemicals humans can use, such as biofuel. And in 2010, they announced, they had created &quot;synthetic life&quot; -- DNA created digitally, inserted into a living bacterium, and remaining alive.<\/p>","slug":"craig_venter","published_at":"2007-02-13 11:00:00","updated_at":"2015-07-10 21:33:09"}}