{"speaker":{"id":71,"title":"","firstname":"Rick","middleinitial":"","lastname":"Warren","description":"Pastor, author","whotheyare":"Pastor Rick Warren is the author of <em>The Purpose-Driven Life,<\/em> which has sold more than 30 million copies worldwide. His has become an immensely influential voice seeking to apply the values of his faith to issues such as global poverty, HIV\/AIDS and injustice.","whylisten":"<p>Pastor Rick Warren is one of the world&#39;s most influential Christians. His <a href=\"http:\/\/www.saddleback.com\/flash\/default.htm\" target=\"_blank\">Saddleback Church<\/a>, founded in 1980, boasts a congregation of 22,000, and his <a href=\"http:\/\/www.purposedrivenlife.com\/\" target=\"_blank\"><em>Purpose-Driven Life<\/em><\/a>  is one of the best-selling books of all time. <strong>Warren&#39;s mission is to attack what he calls the five &quot;Global Goliaths&quot; -- spiritual emptiness, egocentric leadership, extreme poverty, pandemic disease, and illiteracy and poor education.<\/strong> <\/p><p>He teaches that <strong>doing good is the only way humans create significance in our lives<\/strong>. He and his wife famously became &quot;reverse tithers,&quot; donating 90 percent of their considerable fortune to philanthropic causes. Warren is particularly passionate about fighting AIDS, and in 2006, his church hosted the second annual <a href=\"http:\/\/www.purposedriven.com\/en-US\/HIVAIDSCommunity\/GlobalConference\/What_one_church_is_doing_after_the_Summit.htm\" target=\"_blank\">Global Summit on AIDS<\/a>  and the Church, attended by US Senator Barack Obama, among others (controversial within the evangelical movement, because Obama is pro-choice). <br \/><br \/>In recent years, Warren has become <strong>a prominent steward of social justice<\/strong>, speaking out on poverty relief and encouraging spiritual leaders to play a role in <strong>guiding the planet toward sustainability<\/strong>. (He even attended the premiere of <em><a href=\"http:\/\/www.imdb.com\/title\/tt0497116\/\" target=\"_blank\">An Inconvenient Truth<\/a>,<\/em> after meeting Al Gore and producer Lawrence Bender at TED2006.) <br \/><br \/>Given his global focus and considerable platform, <strong>Warren has become a sought-after advisor to world leaders<\/strong>, speaking at the <a href=\"http:\/\/www.un.org\/\" target=\"_blank\">United Nations<\/a>, the <a href=\"http:\/\/www.weforum.org\/en\/index.htm\" target=\"_blank\">World Economic Forum<\/a>  and the <a href=\"http:\/\/www.cfr.org\/\" target=\"_blank\">Council on Foreign Relations<\/a>. His involvement in the 2008 Presidential election sparked controversy and praise from both sides; during the campaign trail, he hosted candidates John McCain and Barack Obama at Saddleback Church for a forum on moral issues. It was the first time McCain and Obama appeared together publicly as presidential candidates. When Barack Obama was later elected to office, he asked Warren to give the invocation at his inauguration.&nbsp;<\/p>","slug":"rick_warren","published_at":"2007-02-26 20:10:00","updated_at":"2010-06-21 09:10:34"}}