{"speaker":{"id":737,"title":"","firstname":"Nic","middleinitial":"","lastname":"Marks","description":"Happiness researcher","whotheyare":"Nic Marks gathers evidence about what makes us happy, and uses it to promote policy that puts the well-being of people and the planet first. He's the founder of the Centre for Well-Being at the UK think tank New Economics Foundation (NEF).","whylisten":"<p>Nic Marks thinks quality of life is measurable, and that true contentment comes not from the accumulation of material wealth but from our connections with others, engagement with the world, and a sense of autonomy. This isn&#39;t just theory: a pioneer in the field of well-being research, Marks creates statistical methods to measure happiness, analyzing and interpreting the evidence so that it can be applied to such policy fields as education, sustainable development, healthcare, and economics. <\/p><p>The founder of the Centre for Well-Being, an independent think tank at the <a href=\"http:\/\/www.neweconomics.org\" target=\"_blank\">New Economics Foundation<\/a>  (NEF), in London, Marks is particularly keen to promote a balance between sustainable development and quality of life. To investigate this, he devised the <a href=\"http:\/\/www.happyplanetindex.org\" target=\"_blank\">Happy Planet Index<\/a>, a global index of human well-being and environmental impact. The results made headlines: People in the world&#39;s wealthiest countries, who consume the most of the planet&#39;s resources, don&#39;t come out on top in terms of well-being. Which raises the question: What purpose does unfettered economic growth serve?<\/p><p>To measure (and possibly improve) your own, or your organization&#39;s, happiness and well-being, visit two useful sites: <a href=\"http:\/\/www.fivewaystowellbeing.org\" target=\"_blank\">5 ways to Well-being<\/a>  and <a href=\"http:\/\/www.happinessworks.com\" target=\"_blank\">Happiness Works<\/a>.  <\/p><p>Read the TED Book: <a href=\"http:\/\/geni.us\/happinessmanifesto\" target=\"_blank\">The Happiness Manifesto &gt;&gt;<\/a> <\/p>","slug":"nic_marks","published_at":"2010-06-09 08:14:00","updated_at":"2015-07-13 18:10:52"}}