{"speaker":{"id":74,"title":"","firstname":"Alex","middleinitial":"","lastname":"Steffen","description":"Planetary futurist","whotheyare":"Alex Steffen explores our planet's future, telling powerful, inspiring stories about the hard choices facing humanity ... and our opportunity to create a much better tomorrow.","whylisten":"<p>Do you ever wonder whether we should be optimistic or pessimistic about the future? If you want more reasons to think things may still turn out for the better, Alex Steffen&#39;s your man. He doesn&#39;t downplay the scope and scale of the problems we face. Instead, he shows that we have the tools within our grasp for meeting those massive challenges, if we have the will to use them.<br \/><br \/>This isn&#39;t just hopeful thinking, either. Steffen uses real-world examples and big-picture research to show us that a brighter, greener future is ours to choose, and his work has earned him the ear of leading cities, corporations and philanthropic foundations. As the <em>New York Time<\/em>s said a recent profile, &quot;Alex Steffen lays out the blueprint for a successful century.&quot;<br \/><br \/>After working as a journalist on four continents, Steffen co-founded and ran the online magazine <a href=\"http:\/\/worldchanging.com\/\" target=\"_blank\">Worldchanging.com<\/a> from 2003-2010. In those seven years, he made Worldchanging one of the world&#39;s leading sustainability-related publications with an archive of almost 12,000 articles and a large global audience. He also edited an internationally best-selling book surveying innovative solutions to the planet&#39;s most pressing problems:&nbsp;<em><a href=\"http:\/\/geni.us\/worldchanging\" target=\"_blank\">Worldchanging: A User&#39;s Guide for the 21st Century<\/a>.<\/em>&nbsp;<br \/><br \/>His most recent work is&nbsp;<a href=\"http:\/\/geni.us\/carbonzero\" target=\"_blank\"><em>Carbon Zero<\/em><\/a>, a book describing cities that create prosperity not climate change, accelerating their economies while reducing their climate emissions to zero. He is now at work on a new book and a television project. &quot;The big open secret about sustainability work,&quot; he recently told <em>Design Observer<\/em> magazine, &#39;is not how bad things are. It is how good things can get.&quot;<\/p>","slug":"alex_steffen","published_at":"2007-02-27 09:54:00","updated_at":"2015-10-01 15:39:25"}}