{"speaker":{"id":748,"title":"","firstname":"Zainab","middleinitial":"","lastname":"Salbi","description":"Activist and social entrepreneur","whotheyare":"Iraqi-born Zainab Salbi founded and runs Women for Women International, and has dedicated her life to helping women in war-torn regions rebuild their lives and communities.","whylisten":"<p>In her memoir&nbsp;<a href=\"http:\/\/geni.us\/hiddeninplainsight\" target=\"_blank\"><em>Hidden in Plain Sight: Growing Up in the Shadow of Saddam<\/em><\/a>, Zainab Salbi writes of being raised in Saddam Hussein&#39;s inner circle -- her father was Saddam&#39;s personal pilot. She left Iraq for an arranged marriage in the US, which quickly became another form of tyranny. But in 1993, when she heard of the rape and concentration camps in Bosnia, she realized she could no longer remain passive. Salbi founded Women for Women International to help women who are victims of war in every way -- from those who&#39;ve been physically harmed to those who suffer from the poverty that war and strife inevitably bring. WFWI provides economic and emotional aid, job-skills training, and rights education, empowering women to stop the cycle of violence and create social change. <\/p><p>In her latest book,<em>&nbsp;<\/em><em><a href=\"http:\/\/geni.us\/hiddeninplainsight\" target=\"_blank\">The Other Side of War<\/a>,<\/em>&nbsp;she shares personal stories of women&#39;s experience in conflict. As she writes: &quot;War is not a computer-generated missile striking a digital map. War is the color of earth as it explodes in our faces, the sound of child pleading, the smell of smoke and fear. Women survivors of war are not the single image portrayed on the television screen, but the glue that holds families and countries together. Perhaps by understanding women, and the other side of war ... we will have more humility in our discussions of wars... perhaps it is time to listen to women&#39;s side of history.&quot;<\/p>","slug":"zainab_salbi","published_at":"2010-06-09 07:34:00","updated_at":"2015-10-01 16:00:04"}}