{"speaker":{"id":752,"title":"","firstname":"Elif","middleinitial":"","lastname":"Shafak","description":"Novelist, political scientist","whotheyare":"One of the most unique novelists in today's world literature, Elif Shafak's writing blends East and West, feminism and memory, the local and the global, bringing the periphery to the centre, giving voice to the voiceless and the disempowered.","whylisten":"<p>Elif Shafak is an award-winning British-Turkish novelist. She writes in both Turkish and English, and has published 18 books, 11 of which are novels. Her work has been translated into 54 languages. Her latest novel,&nbsp;<a href=\"https:\/\/geni.us\/E4KMY4T\" target=\"_blank\"><em>10 Minutes 38 Seconds in this Strange World<\/em><\/a>, was shortlisted for the Booker Prize and RSL Ondaatje Prize and chosen as Blackwell&#39;s Book of the Year. Her previous novel, <em><a href=\"https:\/\/geni.us\/TrEltS9\" target=\"_blank\">The Forty Rules of Love<\/a>,<\/em>&nbsp;was chosen by BBC among 100 Novels that Shaped Our World.<\/p><p>Shafak holds a PhD in political science and has taught at various universities in Turkey, the US and the UK, including St Anne&#39;s College, Oxford University, where she is an honorary fellow.   She is a member of Weforum Global Agenda Council on Creative Economy and a founding member of ECFR (European Council on Foreign Relations). An advocate for women&#39;s rights, LGBT rights and freedom of speech, Shafak is an inspiring public speaker. She contributes to major publications around the world and was awarded the medal of Chevalier de l&rsquo;Ordre des Arts et des Lettres and is a Fellow of the Royal Society of Literature. In 2017, she was chosen by Politico as one of the 12 people &quot;who will give you a much needed lift of the heart.&quot; Shafak has judged numerous literary prizes, chaired the Wellcome Prize and is presently judging the Orwell Prize.<\/p>","slug":"elif_shafak","published_at":"2010-06-09 07:34:00","updated_at":"2020-10-08 18:44:51"}}