{"speaker":{"id":753,"title":"","firstname":"Auret","middleinitial":"","lastname":"van Heerden","description":"Labor-rights activist","whotheyare":"At the head of the Fair Labor Association (FLA), Auret van Heerden takes a practical approach to workers' rights, persuading corporations and NGOs to protect labor in global supply chains.","whylisten":"<p>Raised in apartheid South Africa, Auret van Heerden became an activist early. As a student, he agitated for workers&#39; rights and co-wrote a book on trade unionism; he was tortured and placed in solitary confinement, then exiled in 1987. (Later, in post-apartheid South Africa, he became labor attach&eacute; to the South African mission to the UN.) For the past decade he&#39;s been the president and CEO of the Fair Labor Association, or FLA, an initiative that brings together companies, NGOs and universities to develop and keep up international labor standards in global supply chains. <\/p><p>Founded in 1999, the FLA grew out of a task force convened by President Clinton to investigate and end child labor and other sweatshop practices. Difficult enough in the US, protecting labor is even more complex in the global economy, with its multiple sets of laws and layers of contractors and outsourcers. Policing the entire chain is impossible, so the FLA works instead to help all parties agree that protecting workers is the best way to do business, and agree on voluntary initiatives to get there. The FLA worked with Apple Computer, for example, to inspect its global factories and seek raises and better working conditions at the Foxconn plant in China. <\/p><p>Van Heerden and FLA create a safe space in which stakeholders representing different interest groups within a global supply chain can work together to resolve conflicts of rights and interests, filling in the governance gap. Van Heerden&#39;s newest initiative: the Institute for Social and Environmental Responsibility, which will conduct research and convene multi-stakeholder forums on corporate responsibility.<\/p>","slug":"auret_van_heerden","published_at":"2010-06-09 07:34:00","updated_at":"2012-02-18 13:26:40"}}