{"speaker":{"id":76,"title":"","firstname":"Susan","middleinitial":"","lastname":"Savage-Rumbaugh","description":"Primate authority","whotheyare":"Susan Savage-Rumbaugh has made startling breakthroughs in her lifelong work with chimpanzees and bonobos, showing the animals to be adept in picking up language and other \"intelligent\" behaviors.","whylisten":"<p>Into the great debate over intelligence and instinct -- over what makes us human -- Susan Savage-Rumbaugh has thrown a monkey wrench. Her work with apes has forced <strong>a new way of looking at what traits are truly and distinctly human<\/strong>, and new questions about whether some abilities we attribute to &quot;species&quot; are in fact due to an animal&#39;s social environment. She believes culture and tradition, in many cases more than biology, can account for differences between humans and other primates. <\/p><p>Her bonobo apes, including a superstar named Kanzi, understand spoken English, interact, and have learned to execute tasks once believed limited to humans -- such as starting and controlling a fire. They aren&#39;t trained in classic human-animal fashion. <strong>Like human children, the apes learn by watching.<\/strong> &quot;Parents really don&#39;t know how they teach their children language,&quot; she has said. &quot;Why should I have to know how I teach Kanzi language? I just act normal around him, and he learns it.&quot;<\/p><p>Her latest book is&nbsp;<em><a href=\"http:\/\/www.amazon.com\/Kanzis-Primal-Language-Cultural-Initiation\/dp\/1403996040\/ref=sr_1_fkmr0_3?ie=UTF8&amp;qid=1454351013&amp;sr=8-3-fkmr0&amp;keywords=Susan+Savage-Rumbaugh\" target=\"_blank\">Kanzi&#39;s Primal Language: The Cultural Initiation of Primates into Language<\/a>.<\/em><\/p><p>Also, in 2011, she was named one of&nbsp;<a href=\"http:\/\/content.time.com\/time\/specials\/packages\/article\/0,28804,2066367_2066369_2066401,00.html\" target=\"_blank\"><em>TIME<\/em>&#39;s 100 Most Influential People<\/a>.&nbsp;<\/p><h1 id=\"title\" style=\"box-sizing: border-box; padding: 0px; margin-top: 0px; margin-right: 0px; margin-left: 0px; font-family: Arial, sans-serif; text-rendering: optimizeLegibility; font-size: 28px; line-height: 1.2; color: #111111; margin-bottom: 0px !important\" class=\"a-spacing-none\"><br \/><\/h1><p>&nbsp;<\/p>","slug":"susan_savage_rumbaugh","published_at":"2007-03-03 12:18:00","updated_at":"2016-02-01 18:29:45"}}