{"speaker":{"id":764,"title":"","firstname":"Tim","middleinitial":"","lastname":"Jackson","description":"Economist","whotheyare":"Tim Jackson is a British ecological economist and professor for sustainable development at the University of Surrey. He is the author of \"Prosperity without Growth\" and director of the Centre for the Understanding of Sustainable Prosperity.","whylisten":"<p>Tim Jackson has been at the forefront of international debates about sustainable development for 30 years and has worked closely with the UK Government, the United Nations Environment Programme and numerous private companies and NGOs to bring social science research into sustainability. During five years at the Stockholm Environment Institute in the early 1990s, he pioneered the concept of preventative environmental management outlined in his 1996 book&nbsp;<a href=\"https:\/\/www.amazon.com\/Material-Concerns-Pollution-Profit-Quality\/dp\/0415132495\" target=\"_blank\"><em>Material Concerns: Pollution, Profit and Quality of Life<\/em><\/a>. He worked for over a decade pioneering alternative measures of economic progress, and he has written extensively about the&nbsp;<a href=\"https:\/\/www.cusp.ac.uk\/wp-content\/uploads\/TJ_2014_-_angste_essen_seele_auf_in-_ws_48.pdf\" target=\"_blank\">meaning function of consumerism in modern society<\/a>. For seven years, he served as economics commissioner on the UK government&#39;s Sustainable Development Commission and led its Redefining Prosperity programme.<\/p><p>He is the director of the&nbsp;<a href=\"https:\/\/cusp.ac.uk\/\" target=\"_blank\">Centre for the Understanding of Sustainable Prosperity<\/a>, a multi-disciplinary, international research consortium which aims to understand the economic, social and political dimensions of sustainable prosperity. In 2016 he received the Hillary Laureate for exceptional mid-career Leadership.&nbsp;<\/p><p>In addition to his scientific work, Jackson&nbsp;is an award-winning professional playwright with&nbsp;<a href=\"http:\/\/timjackson.org.uk\/plays\/\" target=\"_blank\">numerous BBC radio-writing credits<\/a>&nbsp;to his name.<\/p>","slug":"tim_jackson","published_at":"2010-06-09 09:50:00","updated_at":"2018-02-25 17:45:04"}}