{"speaker":{"id":774,"title":"","firstname":"Stephen","middleinitial":"","lastname":"Palumbi","description":"Marine biologist","whotheyare":"Stephen Palumbi studies the way humanity and ocean life interact and intertwine. His insights into our codependence offer ideas for protecting both the ocean and ourselves.","whylisten":"<p>Stephen Palumbi teaches and does research in evolution and marine biology at Stanford University, and has long been fascinated by how quickly the world around us changes. His work on the genetics of marine organisms tries to focus on basic evolutionary questions but also on practical solutions to questions about how to preserve and protect the diverse life in the sea. DNA data on the genetics of marine populations like corals helps in the design and implementation of marine protected areas for conservation and fisheries enhancement. A second focus is on the use of molecular genetic techniques for the elucidation of past population sizes and dynamics of baleen whales, with the notion of recreating a better sense of the ecology of the virgin ocean.<br \/>&nbsp;<br \/>Palumbi has lectured extensively on human-induced evolutionary change, has used genetic detective work to identify whales for sale in retail markets, and is working on new methods to help design marine parks for conservation. His first book for non-scientists,&nbsp;<em><a href=\"http:\/\/geni.us\/XEv\" target=\"_blank\">The Evolution Explosion<\/a>,<\/em>&nbsp;documents the impact of humans on evolution. His latest is an unusual environmental success story called <a href=\"http:\/\/geni.us\/4EEZ\" target=\"_blank\"><em>The Death and Life of Monterey Bay<\/em><\/a>. He also helped write and research and appears in the BBC series <em>The Future Is Wild<\/em> and the History Channel&#39;s <em>World Without People<\/em>. Other recent films appearances include <em>The End of the Line<\/em> and an upcoming Canadian Broadcasting series <em>One Ocean.<\/em> <\/p><p>Palumbi&#39;s other passion: microdocumentaries. His <a href=\"http:\/\/microdocs.org\" target=\"_blank\">Short Attention Span Science Theater<\/a>  site received a million hits last year. And his band Sustainable Soul has several songs out, including &quot;Crab Love&quot; and &quot;The Last Fish Left.&quot;<\/p>","slug":"stephen_palumbi","published_at":"2010-06-30 09:01:00","updated_at":"2015-10-09 21:41:52"}}