{"speaker":{"id":792,"title":"","firstname":"Johan","middleinitial":"","lastname":"Rockström","description":"Climate impact scholar","whotheyare":"A co-developer of the planetary boundaries framework, Johan Rockström works to understand Earth’s resilience.","whylisten":"<p>Johan Rockstr&ouml;m is an internationally recognized scientist for his work on global sustainability. He helped lead a team of scientists that presented the planetary boundaries framework, first published in 2009 and updated in 2015. The nine planetary boundaries presented in the framework are assessed to be fundamental in maintaining a &quot;safe operating space for humanity.&quot; This framework has been embraced as an approach to sustainable development and has been used to help guide governments, international organizations, NGOs and companies considering sustainable development.<\/p><p>Before focusing on the planetary scale, Rockstr&ouml;m&#39;s research focused on water resources and building resilience in water-scarce regions. After completing a PhD at Stockholm University&#39;s Systems Ecology Department in 1997, he spent over a decade working on applied water research in tropical regions.&nbsp;<\/p><p>Rockstr&ouml;m cofounded the Stockholm Resilience Centre and is currently director of the Potsdam Institute for Climate Impact Research. He co-chaired the EAT-Lancet Commission on healthy diets from sustainable food systems, published in 2019 and he is co-chair of Future Earth and the Earth Commission.&nbsp;<\/p><p>Rockstr&ouml;m has published more than 150 research articles, including articles in <em>Science<\/em> and <em>Nature<\/em>, and 20 book chapters. He is a regular speaker at the World Economic Forum in Davos and has also published four books:&nbsp;<a href=\"http:\/\/geni.us\/cdlb\" target=\"_blank\"><em>The Human Quest<\/em><\/a>&nbsp;(2012) and&nbsp;<a href=\"http:\/\/geni.us\/PBId\" target=\"_blank\"><em>Big World Small Planet<\/em><\/a>&nbsp;(2015), with National Geographic photographer Mattias Klum; coauthored&nbsp;<a href=\"http:\/\/geni.us\/Icrjqut\" target=\"_blank\"><em>Water Resilience for Human Prosperity<\/em><\/a>&nbsp;(2014); and coauthored&nbsp;<a href=\"http:\/\/geni.us\/6a8L\" target=\"_blank\"><em>Bankrupting Nature<\/em><\/a>&nbsp;(2012) with Swedish writer and politician Anders Wijkman.<\/p>    ","slug":"johan_rockstrom","published_at":"2010-08-30 10:11:00","updated_at":"2021-08-18 15:46:19"}}