{"speaker":{"id":803,"title":"","firstname":"Melinda","middleinitial":"","lastname":"Gates","description":"Philanthropist","whotheyare":"Melinda French Gates is cochair of the Bill & Melinda Gates Foundation, where she puts into practice the idea that every life has equal value.","whylisten":"<p>The <a href=\"http:\/\/www.gatesfoundation.org\/Pages\/home.aspx\" target=\"_blank\">Bill &amp; Melinda Gates Foundation<\/a>  works to help all people lead healthy, productive lives. As cochair, Melinda French Gates helps shape and approve strategies, review results, advocate for foundation issues and set the overall direction. In developing countries, the foundation focuses on improving people&#39;s health with vaccines and other life-saving tools and giving them a chance to lift themselves out of hunger and extreme poverty. In the United States, it seeks to dramatically improve education, so that all young people have the opportunity to reach their full potential. Based in Seattle, Washington, the foundation is led by CEO Jeff Raikes and cochair William H. Gates Sr., under the direction of Bill Gates, Melinda Gates and Warren Buffett.<\/p><p>In recent years, Gates has become a vocal advocate for access to contraception, advancing the idea that empowering women to decide whether and when to have children can have transformational effects on societies. In 2012, she spearheaded the London Summit on Family Planning, with the goal of delivering contraceptives to 120 million women in developing countries by 2020. When asked why she got involved in this issue, Gates said, &quot;We knew that 210 million women were saying they wanted access to the contraceptives we have here in the United States and we weren&#39;t providing them because of political controversy in our country. To me, that was just a crime. I kept looking around trying to find the person to get this back on the global stage. I realized I just had to do it.&quot;<\/p>                <p>&nbsp;<\/p>","slug":"melinda_french_gates","published_at":"2010-10-12 08:34:00","updated_at":"2020-06-15 22:13:42"}}