{"speaker":{"id":818,"title":"","firstname":"Elizabeth","middleinitial":"","lastname":"Lesser","description":"Wellness specialist","whotheyare":"Elizabeth Lesser helps her readers and students transform their lives after brushes with pain, adversity and life's myriad problems.","whylisten":"<p>Elizabeth Lesser is a bestselling author and the cofounder of Omega Institute, the renowned conference and retreat center located in Rhinebeck, New York. Lesser&#39;s first book,&nbsp;<a href=\"http:\/\/geni.us\/uIQrQGe\" target=\"_blank\"><em>The Seeker&#39;s Guide<\/em><\/a>, chronicles her years at Omega and distills lessons learned into a potent guide for growth and healing. Her <em>New York Times<\/em> bestselling book,&nbsp;<a href=\"http:\/\/geni.us\/nKfE\" target=\"_blank\"><em>Broken Open: How Difficult Times Can Help Us Grow<\/em><\/a>&nbsp;(Random House), has sold more than 300,000 copies and has been translated into 20 languages. Her book,&nbsp;<a href=\"http:\/\/geni.us\/b3w5\" target=\"_blank\"><em>Marrow: A Love Story<\/em><\/a>&nbsp;(Harper Collins\/September 2016), is a memoir about Elizabeth and her younger sister, Maggie, and the process they went through when Elizabeth was the donor for Maggie&#39;s bone marrow transplant. And her newest book is <em>Cassandra Speaks: When Women Are the Storytellers, the Human Story Changes&nbsp;<\/em>(Harper Collins\/September 2020).<\/p><p>Lesser cofounded Omega Institute in 1977 -- a time when a variety of fresh ideas were sprouting in American culture. Since then, the institute has been at the forefront of holistic education, offering workshops and trainings in: integrative medicine, prevention, nutrition, and the mind\/body connection; meditation and yoga; cross-cultural arts and creativity; ecumenical spirituality; and social change movements like women&#39;s empowerment and environmental sustainability. Lesser is also the cofounder of Omega&#39;s Women&#39;s Leadership Center, which grew out of the popular Women &amp; Power conference series featuring women leaders, activists, authors and artists from around the world. Each year more than 30,000 people participate in Omega&#39;s programs on its campus in Rhinebeck, New York and at urban and travel sites, and more than a million people visit its website for online learning.<\/p><p>A student of the Sufi master, Pir Vilayat Inayat Khan, for many years, Lesser has also studied with spiritual teachers, healers, psychologists and philosophers from other traditions. In 2008 she helped Oprah Winfrey produce a ten-week online seminar based on Eckhart Tolle&#39;s book, <em>A New Earth<\/em>. The webinar was viewed by more than 8 million people worldwide. She was a frequent host on Oprah&#39;s &quot;Soul Series,&quot; a weekly radio show on Sirius\/XM, and a guest on Oprah&#39;s &quot;Super Soul Sunday.&quot; In 2011, she gave a TED Talk, &quot;<a href=\"\/talks\/elizabeth_lesser_take_the_other_to_lunch\" target=\"_blank\">Take &#39;the Other&#39; to lunch<\/a> ,&quot; in which she called for civility and understanding as we negotiate our differences as human beings.<\/p><p>Lesser attended Barnard College, where she studied literature, and San Francisco State University, where she received a teaching degree. In 2011 she received an honorary doctorate from the Institute of Transpersonal Psychology, in Palo Alto, California. Early in her career she was a midwife and birth educator. Today, besides writing and her work at Omega Institute, she lends her time to social and environmental causes&nbsp;and is an avid walker, cook and gardener. She lives with her family in New York&#39;s Hudson River Valley.<\/p>","slug":"elizabeth_lesser","published_at":"2010-11-02 15:54:00","updated_at":"2020-10-23 18:03:55"}}