{"speaker":{"id":82,"title":"","firstname":"Bill","middleinitial":"","lastname":"Clinton","description":"Activist","whotheyare":"Through his William J. Clinton Foundation, former US President Bill Clinton has become a vital and innovative force for world change. He works in four critical areas: health, economic empowerment, citizen service, and reconciliation.","whylisten":"<p>Elected President of the United States in 1992 and again in 1996, <strong>Bill Clinton left office determined to continue his life of service<\/strong> -- to build the kind of world he wants to hand down to his daughter. His <a href=\"http:\/\/www.clintonfoundation.org\/index.htm\" target=\"_blank\">William J. Clinton Foundation<\/a>  is focused on four critical areas: health security, with an emphasis on HIV\/AIDS; economic empowerment; leadership development and citizen service; and racial, ethnic and religious reconciliation. <\/p><p>Foundation projects include <strong>working with pharmaceutical companies to lower the costs of medicines to needy areas<\/strong>, and, through his <a href=\"http:\/\/www.clintonfoundation.org\/cf-pgm-hs-ai-home.htm\" target=\"_blank\">Clinton Foundation HIV\/AIDS Initiative (CHAI)<\/a>, developing an innovative health care system that can be successful and sustainable throughout the developing world. His <a href=\"http:\/\/www.clintonglobalinitiative.org\" target=\"_blank\">Clinton Global Initiative<\/a>  brings together world leaders to discuss the world&#39;s most pressing challenges.<\/p><p>In 2015, The Clinton Development Initiative partnered with Visa to help&nbsp;<a href=\"https:\/\/www.clintonfoundation.org\/press-releases\/clinton-development-initiative-and-visa-announce-partnership-link-farmers-rwanda\" target=\"_blank\">Rwandan farmers conduct business digitally<\/a>, increasing their financial security and economic empowerment.&nbsp;<\/p><p>Keep up with other updates and news from the Clinton Foundation&nbsp;<a href=\"https:\/\/www.clintonfoundation.org\/press-releases-and-statements\" target=\"_blank\">here<\/a>.&nbsp;<\/p>","slug":"bill_clinton","published_at":"2007-03-14 19:03:00","updated_at":"2016-02-01 18:47:18"}}