{"speaker":{"id":821,"title":"","firstname":"Caroline","middleinitial":"","lastname":"Casey","description":"Inclusivity activist","whotheyare":"Caroline Casey works relentlessly to bring out a global shift in business inclusion, and ensure that everyone can live their life without limit or labels.","whylisten":"<p>Caroline Casey is an award-winning social entrepreneur, Ashoka Fellow and Young Global Leader of the World Economic Forum. Since taking the life-changing decision at 28 to leave her career in management consulting, Caroline has committted to creating inclusion for all.<\/p><p>In 2000, she rode 1,000 kilometers across India on an elephant to raise funds for Sight Savers. Then, as founding CEO of Kanchi, in Dublin, she developed a set of best practices for businesses, to help them see &quot;disabled&quot; workers as an asset, as opposed to a liability. Hundreds of companies have adopted these standards, changing their policies and attitudes. In 2004, Casey started the Ability Awards, sponsored by 02, to recognize Irish businesses for their inclusion of people with disabilities, as employees, suppliers, customers and members of the community. The initiative received great international praise and, in 2010, a parallel program was launched in Spain, backed by Telef&oacute;nica.<br \/><br \/>In 2015 Casey founded business inclusion company Binc which, in August 2017, launched #valuable &ndash; a worldwide &lsquo;call to action&rsquo; for business to recognise the value and potential of the 1 billion people living with a disability and position disability equally on the global business agenda. To start the conversation and build momentum, Casey, who is registered blind, embarked on a 1,000km horse adventure through Colombia, ending with a keynote address at &lsquo;One Young World Summit 2017&rsquo; in Bogota, Colombia.<br \/><br \/>Join the conversation <a href=\"https:\/\/twitter.com\/ValuableTribe\" target=\"_blank\">@valuabletribe<\/a>  <\/p>","slug":"caroline_casey","published_at":"2010-11-02 21:44:00","updated_at":"2017-09-08 20:23:24"}}