{"speaker":{"id":86,"title":"","firstname":"Ze","middleinitial":"","lastname":"Frank","description":"Web humorist","whotheyare":"Ze Frank has been involved in online comedy, web toys and virtually shared experiences for the past 20 years as an influencer, performer, executive and mischief maker.","whylisten":"<p>Ever since his &quot;<a href=\"http:\/\/www.zefrank.com\/invite\/swfs\/index2.html\" target=\"_blank\">How to Dance Properly<\/a>&quot;&nbsp;viral video&nbsp;(born as a party invite for 17 friends) hit the web in 2001, Ze Frank has been making people giggle, guffaw and gasp out loud whilst procrastinating at work. In many ways, he defines the genre of online comedy and continues to innovate madly on the form.&nbsp;His video series <em>True Facts<\/em>&nbsp;(which riffs on funny life forms like the echidna and venus fly traps) routinely attracts hundreds of thousands of viewers.<\/p><p>In 2006, Frank launched a year-long daily video blog called <a href=\"http:\/\/www.zefrank.com\/theshow\/\" target=\"_blank\"><em>The Show with Ze Frank<\/em><\/a>,&nbsp;which Slate.com called &quot;the best sustained comedy run in the history of the web.&quot; His rapid-fire delivery and absurd explorations in audience participation has influenced a generation of digital native YouTubers. Perhaps his most brilliant move involved calling on fans to write the show for him.  Using collaborative tools, online viewers collectively put words in his  mouth (and props in his lap); he faithfully performed this wiki-comedy  each week for his <em>Fabuloso Friday<\/em> show.<\/p><p>In 2008, along with Erik Kastner,&nbsp;Frank launched <em>Colowars<\/em>, the first massively multiplayer game on Twitter, which featured two months of sponsored online events and competitions. Recently he has worked with his audience to create a series of projects based on shared emotions such as pain, fear and the pang of nostalgia. Frank works as a consultant on audience engagement and a public speaker on the subject of the virtual life. In 2012, he returned to the internet airwaves with <a href=\"http:\/\/ashow.zefrank.com\/\" target=\"_blank\"><em>A Show<\/em><\/a>.<\/p>","slug":"ze_frank","published_at":"2007-03-14 22:30:00","updated_at":"2020-03-05 16:23:36"}}