{"speaker":{"id":870,"title":"","firstname":"Kim","middleinitial":"","lastname":"Gorgens","description":"Neuropsychologist","whotheyare":"Kim Gorgens studies the brain's response to injury -- and advocates that we mind our (gray) matter.","whylisten":"<p>As a neuropsychologist working for decades to understand brain injuries, Dr. Kim Gorgens has seen firsthand the damage sports-related impacts can do. And as a former chair of the&nbsp;<a href=\"http:\/\/mindsourcecolorado.org\/\" target=\"_blank\">State of Colorado Traumatic Brain Injury Trust Fund Board<\/a>&nbsp;and a member of the Colorado Brain Injury Legislative Collaborative, she helped draft the&nbsp;<a href=\"https:\/\/www.cde.state.co.us\/sites\/default\/files\/documents\/healthandwellness\/download\/brain%20injury\/sb11-040.pdf\" target=\"_blank\">Colorado law around youth sports injuries<\/a>.<\/p><p>Gorgens is a Professor of Psychophysiology, Clinical Neuropsychology and Psychology of Criminal Behavior at the&nbsp;<a href=\"https:\/\/www.du.edu\/gspp\/\" target=\"_blank\">University of Denver<\/a>. She manages a large portfolio of traumatic brain injury (TBI) related research and has lectured extensively on those issues (including her 2010 TED talk on youth sports concussion, a&nbsp;<a href=\"https:\/\/www.youtube.com\/watch?v=j78G4Pr6C1o\" target=\"_blank\">2018 TEDxMileHigh talk on brain injuries in criminal justice<\/a>, several NPR spots and an interview on CNN with Anderson Cooper). Her work has been featured in&nbsp;<a href=\"https:\/\/www.usnews.com\/news\/best-states\/articles\/2018-08-22\/denver-based-project-exposes-link-between-brain-injury-and-incarceration\" target=\"_blank\">USNews<\/a>,&nbsp;<a href=\"https:\/\/www.newsweek.com\/2016\/07\/08\/prison-inmate-traumatic-brain-injury-research-475615.html\" target=\"_blank\">Newsweek<\/a>, Salon.com&nbsp; and more. She completed a postdoctoral fellowship in Clinical Neuropsychology and is board certified in Rehabilitation Psychology. She is a fellow of the&nbsp;<a href=\"http:\/\/www.div22.org\/\" target=\"_blank\">American Psychological Association&#39;s Division 22<\/a>, Rehabilitation Psychology and Vice President of the&nbsp;<a href=\"https:\/\/www.abpp.org\/Applicant-Information\/Specialty-Boards\/Rehabilitation-Psychology.aspx\" target=\"_blank\">American Board of Rehabilitation Psychology<\/a>.<\/p><p>Her research studies the reported injury history, cognitive function and brain biomarkers of youth and college athletes, probationers and inmates. Her mission is to better understand the short and long-term impacts of injuring our most vital organ. She has a fridge filled with human brains&nbsp;and a love of zombie movies (coincidence?). Simply put, she cares more about your brain than you do.<\/p>","slug":"kim_gorgens","published_at":"2010-11-22 14:50:00","updated_at":"2018-10-09 18:45:55"}}