{"speaker":{"id":877,"title":"","firstname":"William","middleinitial":"","lastname":"Ury","description":"Mediator","whotheyare":"William Ury is a mediator, writer and speaker, working with conflicts ranging from family feuds to boardroom battles to ethnic wars. He's the author of \"Getting to Yes.\"","whylisten":"<p>William L. Ury co-founded Harvard&#39;s Program on Negotiation and is currently a Senior Fellow of the Harvard Negotiation Project. He is the author of&nbsp;<a href=\"http:\/\/geni.us\/powerofpositiveno\" target=\"_blank\"><em>The Power of a Positive No: How to Say No &amp; Still Get to Yes<\/em><\/a>, and co-author (with Roger Fisher) of&nbsp;<a href=\"http:\/\/geni.us\/gettingtoyes1\" target=\"_blank\"><em>Getting to Yes: Negotiating Agreement Without Giving In<\/em><\/a>, translated into 30+ languages. He is also author of the award-winning&nbsp;<a href=\"http:\/\/geni.us\/gettingpastno\" target=\"_blank\"><em>Getting Past No: Negotiating with Difficult People<\/em><\/a>&nbsp;and&nbsp;<a href=\"http:\/\/geni.us\/gettingtopeace\" target=\"_blank\"><em>Getting To Peace<\/em><\/a>&nbsp;(released in paperback under the title <em>The Third Side<\/em>).<br \/><br \/>Over the last 30 years, Ury has served as a negotiation adviser and mediator in conflicts ranging from corporate mergers to wildcat strikes in a Kentucky coal mine to ethnic wars in the Middle East, the Balkans, and the former Soviet Union. With former president Jimmy Carter, he co- founded the International Negotiation Network, a non-governmental body seeking to end civil wars around the world. During the 1980s, he helped the US and Soviet governments create nuclear crisis centers designed to avert an accidental nuclear war. In that capacity, he served as a consultant to the Crisis Management Center at the White House. More recently, Ury has served as a third party in helping to end a civil war in Aceh, Indonesia, and helping to prevent one in Venezuela.<br \/><br \/>Ury has taught negotiation to tens of thousands of corporate executives, labor leaders, diplomats and military officers around the world. He helps organizations try to reach mutually profitable agreements with customers, suppliers, unions, and joint-venture partners.<\/p>","slug":"william_ury","published_at":"2010-11-30 16:06:00","updated_at":"2015-07-09 22:04:20"}}