{"speaker":{"id":889,"title":"","firstname":"Deb","middleinitial":"","lastname":"Roy","description":"Cognitive scientist","whotheyare":"Deb Roy studies how children learn language, and designs machines that learn to communicate in human-like ways. On sabbatical from MIT Media Lab, he's working with the AI company Bluefin Labs.","whylisten":"<p>Deb Roy directs the <strong><a href=\"http:\/\/web.media.mit.edu\/~dkroy\/\" target=\"_blank\">Cognitive Machines group<\/a>   at the MIT Media Lab<\/strong>, where he studies how  children learn language, and designs machines that learn to communicate  in human-like ways. To enable this work, he has pioneered new  data-driven methods for analyzing and modeling human linguistic and  social behavior. He has authored numerous scientific papers on  artificial intelligence, cognitive modeling, human-machine interaction,  data mining, and information visualization. <\/p> <p><a href=\"http:\/\/www.bluefinlabs.com\/deb-roy\/\" target=\"_blank\">Deb Roy<\/a>  was the co-founder and serves as CEO of <a href=\"http:\/\/www.bluefinlabs.com\/\" target=\"_blank\">Bluefin Labs<\/a>, a  venture-backed technology company. Built upon deep machine learning  principles developed in his research over the past 15 years, Bluefin has  created a technology platform that analyzes social media commentary to  measure real-time audience response to TV ads and shows.<\/p><p>Follow <a href=\"http:\/\/twitter.com\/#!\/dkroy\/\" target=\"_blank\">Deb Roy on Twitter&gt;<\/a><\/p><p><span class=\"commentText\">Roy adds some relevant papers: <\/span><\/p><p><span class=\"commentText\">Deb Roy. (2009). New Horizons in the Study of Child Language Acquisition. Proceedings of Interspeech 2009. Brighton, England.  <a rel=\"nofollow\" href=\"http:\/\/bit.ly\/fSP4Qh\" target=\"_blank\">bit.ly\/fSP4Qh<\/a><br \/> <br \/> Brandon C. Roy, Michael C. Frank and Deb Roy. (2009). Exploring word  learning in a high-density longitudinal corpus. Proceedings of the 31st  Annual Meeting of the Cognitive Science Society. Amsterdam, Netherlands.  <a rel=\"nofollow\" href=\"http:\/\/bit.ly\/e1qxej\" target=\"_blank\">bit.ly\/e1qxej<\/a><br \/> <br \/> Plenty more papers on our research including technology and methodology  can be found here, together with other research from my lab at MIT: <a rel=\"nofollow\" href=\"http:\/\/dkroy.media.mit.edu\/publications\/\" target=\"_blank\">bit.ly\/h3paSQ<\/a><br \/> <br \/> The work that I mentioned on relationships between television content and the social graph is being done at Bluefin Labs (<a rel=\"nofollow\" href=\"http:\/\/www.bluefinlabs.com\/\" target=\"_blank\">www.bluefinlabs.com<\/a>).  Details of this work have not been published. The social structures we  are finding (and that I highlighted in my TED talk) are indeed new. The  social media communication channels that are leading to their formation  did not even exist a few years ago, and Bluefin&#39;s technology platform  for discovering these kinds of structures is the first of its kind.  We&#39;ll certainly have more to say about all this as we continue to dig  into this fascinating new kind of data, and as new social structures  continue to evolve!<\/span> <\/p>","slug":"deb_roy","published_at":"2010-12-18 20:31:00","updated_at":"2016-04-29 12:34:50"}}