{"speaker":{"id":89,"title":"","firstname":"Jacqueline","middleinitial":"","lastname":"Novogratz","description":"Founder and CEO of Acumen","whotheyare":"Jacqueline Novogratz works to enable human flourishing. Her organization, Acumen, invests in people, companies and ideas that see capital and networks as means, not ends, to solving the toughest issues of poverty.","whylisten":"<p>Jacqueline Novogratz writes: &quot;I want to build a movement in which we define success based on the amount of human energy we release in the world. <\/p><p>&quot;I started my career on Wall Street and soon discovered that markets are efficient, but by themselves they too often overlook or exploit the poor.  So I moved to Rwanda in 1986 to help found the country&#39;s first micro-finance bank.  There I saw the humanitarian ethos of philanthropy, and also how often top-down solutions too often create dependency, the opposite of dignity. Through 30 years of working on solutions to poverty, I have come to redefine it for myself, seeing it not as how much income a person earns, but how free they are to make their own choices and decisions, how much agency they have over their own lives.  <br \/> <br \/>&quot;Acumen was founded to change the way the world tackles poverty in 2001.  Our mission was simple -- to raise philanthropy and  invest it as patient capital -- long-term investment in intrepid entrepreneurs willing to go where markets and government had failed the poor.  We enable companies to experiment and fail, never wavering from a commitment to stand with the poor, yet understanding that profitability is necessary for sustainable solutions. We&#39;ve invested more than $110M across South Asia, Africa, Latin America and the US, and have seen entire sectors disrupted and hundreds of millions served.  <br \/> <br \/>&quot;The work also taught that it was critical to invest in talent. To date, we&#39;ve supported nearly 400 Acumen Fellows across lines of race, class, ethnicity, religion and ideology.  They are a beautiful group, full of vision and grit, and a determination to do what is right, not easy. The group itself enables individual leaders to endure the loneliness that is part of the work.<br \/> <br \/>&quot;And then we measure what matters rather than just what we can count. Take this all together and you see our mission to do what it takes to build a world in which all of us have the chance to dream and to flourish, not from a place of easy sentimentality but through a commitment to using the tools of capitalism and the attributes of moral leadership to focus on doing what it takes, and no less.&quot;<\/p>","slug":"jacqueline_novogratz","published_at":"2007-03-23 06:01:00","updated_at":"2020-09-09 19:30:58"}}