{"speaker":{"id":890,"title":"","firstname":"Ed","middleinitial":"","lastname":"Boyden","description":"Neuroengineer","whotheyare":"Ed Boyden is a professor of biological engineering and brain and cognitive sciences at the MIT Media Lab and the MIT McGovern Institute.","whylisten":"        <p class=\"p1\">Ed Boyden leads the Synthetic Neurobiology Group, which develops tools for analyzing and repairing complex biological systems such as the brain. His group applies these tools in a systematic way in order to reveal ground truth scientific understandings of biological systems, which in turn reveal radical new approaches for curing diseases and repairing disabilities. These technologies include expansion microscopy, which enables complex biological systems to be imaged with nanoscale precision, and optogenetic tools, which enable the activation and silencing of neural activity with light (TED Talk:&nbsp;<a href=\"http:\/\/www.ted.com\/talks\/ed_boyden\" target=\"_blank\">A light switch for neurons<\/a>).&nbsp;Boyden also co-directs the MIT Center for Neurobiological Engineering, which aims to develop new tools to accelerate neuroscience progress.<\/p><p class=\"p1\">Amongst other recognitions, Boyden has received the Breakthrough Prize in Life Sciences (2016), the BBVA Foundation Frontiers of Knowledge Award (2015), the Carnegie Prize in Mind and Brain Sciences (2015), the Jacob Heskel Gabbay Award (2013), the Grete Lundbeck Brain Prize (2013) and the NIH Director&#39;s Pioneer Award (2013). He was also named to the World Economic Forum Young Scientist list (2013) and the <em>Technology Review World&#39;<\/em>s &quot;Top 35 Innovators under Age 35&quot; list (2006). His group has hosted hundreds of visitors to learn how to use new biotechnologies and spun out several companies to bring inventions out of his lab and into the world. Boyden received his Ph.D. in neurosciences from Stanford University as a Hertz Fellow, where he discovered that the molecular mechanisms used to store a memory are determined by the content to be learned. Before that, he received three degrees in electrical engineering, computer science and physics from MIT. He has contributed to over 300 peer-reviewed papers, current or pending patents and articles, and he has given over 300 invited talks on his group&#39;s work.<\/p>","slug":"ed_boyden","published_at":"2010-12-18 21:15:00","updated_at":"2016-07-21 15:51:49"}}