{"speaker":{"id":9,"title":"","firstname":"David","middleinitial":"","lastname":"Rockwell","description":"Architect, experience designer","whotheyare":"Architect David Rockwell draws on his love of drama and spectacle to create fantastic, high-impact restaurants, cultural facilities, airline terminals, theater sets -- and playgrounds. ","whylisten":"<p>David Rockwell, FAIA, is the Founder and President of&nbsp;<a href=\"http:\/\/www.rockwellgroup.com\/\" target=\"_blank\">Rockwell Group<\/a>, an award-winning, cross-disciplinary architecture and design practice based in New York City with a satellite office in Madrid. The firm crafts a unique narrative for each project through the intersection of theater and architecture.<\/p><p>Projects include Nobu restaurants and hotels worldwide; The New York EDITION; the Union Square Cafe (New York); NeueHouse (New York and Los Angeles); the TED Theater (Vancouver); W Hotels worldwide; 15 Hudson Yards and The Shed in collaboration with Diller Scofidio + Renfro; the Imagination Playground initiative; and set designs for <em>Falsettos<\/em>, <em>She Loves Me<\/em> and <em>Kinky Boots<\/em>. From surface and floor coverings for Maya Romanoff, The Rug Company and Jim Thompson, to lighting for Rich Brilliant Willing, to furniture for Stellar Works and Knoll, the firm celebrates product design as a natural extension of its immersive environments.<\/p><p>Honors and recognition include 2016 Tony, Drama Desk and Outer Critics Circle Awards for Best Scenic Design for <em>She Loves Me<\/em>; the AIANY President&rsquo;s Award; Cooper-Hewitt National Design Award; the Presidential Design Award; Fast Company&#39;s World&#39;s Top 10 Most Innovative Companies; the James Beard Foundation Who&#39;s Who of Food &amp; Beverage in America; and the Interior Design Hall of Fame. Rockwell&nbsp;serves on the boards of the Design Industries Foundation Fighting AIDS (DIFFA), Citymeals-on-Wheels, the Cooper Hewitt National Design Museum and New York Restoration Project. He is a Fellow of the American Institute of Architects.<\/p><p>(Photo: Brigitte Lacombe)<\/p>","slug":"david_rockwell","published_at":"2007-06-12 05:02:00","updated_at":"2018-03-07 21:29:46"}}