{"speaker":{"id":90,"title":"","firstname":"Hans","middleinitial":"","lastname":"Rosling","description":"Global health expert; data visionary","whotheyare":"In Hans Rosling’s hands, data sings. Global trends in health and economics come to vivid life. And the big picture of global development -- with some surprisingly good news -- snaps into sharp focus.","whylisten":"<p>Even the most worldly and well-traveled among us have had their perspectives shifted by Hans Rosling. A professor of global health at Sweden&#39;s <a href=\"http:\/\/ki.se\/ki\/jsp\/polopoly.jsp?d=130&amp;l=en\" target=\"_blank\">Karolinska Institute<\/a>, his work focused on dispelling common myths about the so-called developing world, which (as he pointed out) is no longer worlds away from the West. In fact, most of the Third World is on the same trajectory toward health and prosperity, and many countries are moving twice as fast as the west did.<br \/><br \/>What set Rosling apart wasn&#39;t just his apt observations of broad social and economic trends, but the stunning way he presented them. Guaranteed: You&#39;ve never seen data presented like this. A presentation that tracks global health and poverty trends should be, in a word: boring. But in Rosling&#39;s hands, data sings. Trends come to life. And the big picture &mdash; usually hazy at best &mdash; snaps into sharp focus. <br \/><br \/>Rosling&#39;s presentations were grounded in solid statistics (often drawn from United Nations and World Bank data), illustrated by the visualization software he developed. The animations transform development statistics into moving bubbles and flowing curves that make global trends clear, intuitive and even playful. During his legendary presentations, Rosling took this one step farther, narrating the animations with a sportscaster&#39;s flair. <br \/><br \/>Rosling developed the breakthrough software behind his visualizations through his nonprofit <a href=\"http:\/\/www.gapminder.org\/\" target=\"_blank\">Gapminder<\/a>, founded with his son and daughter-in-law. The free software &mdash; which can be loaded with any data &mdash; was purchased by Google in March 2007. (Rosling met the Google founders at TED.)<br \/><br \/>Rosling began his wide-ranging career as a physician, spending many years in rural Africa tracking a rare paralytic disease (which he named konzo) and discovering its cause: hunger and badly processed cassava. He co-founded M&eacute;decins sans Fronti&egrave;rs (Doctors without Borders) Sweden, wrote a textbook on global health, and as a professor at the Karolinska Institut in Stockholm initiated key international research collaborations. He&#39;s also personally argued with many heads of state, including Fidel Castro. <br \/><br \/>Hans Rosling passed away in February 2017. He is greatly missed.<br \/><br \/><br \/> <\/p>","slug":"hans_rosling","published_at":"2007-04-01 22:34:00","updated_at":"2020-02-07 15:28:38"}}