{"speaker":{"id":91,"title":"","firstname":"Barry","middleinitial":"","lastname":"Schwartz","description":"Psychology professor","whotheyare":"Barry Schwartz studies the link between economics and psychology, offering startling insights into modern life.","whylisten":"<p>In his 2004 book <a href=\"http:\/\/geni.us\/paradoxofchoice\" target=\"_blank\"><em>The Paradox of Choice<\/em><\/a>, Barry Schwartz tackles one of the great mysteries of modern life: Why is it that societies of great abundance -- where individuals are offered more freedom and choice (personal, professional, material) than ever before -- are now witnessing a near-epidemic of depression? Conventional wisdom tells us that greater choice is for the greater good, but Schwartz argues the opposite. He makes a compelling case that the abundance of choice in today&#39;s western world is actually making us miserable.<\/p><p>Schwartz believes that infinite choice is paralyzing and exhausting for the human psyche. It leads us to set unreasonably high expectations, question our choices before we even make them and blame our failures entirely on ourselves. His relatable examples, from consumer products (jeans, TVs, salad dressings) to lifestyle choices (where to live, what job to take, who and when to marry), underscore his central point that too much choice undermines happiness.<\/p><p>Schwartz&#39;s previous research has addressed morality, decision-making and the varied inter-relationships between science and society. Before <em>Paradox<\/em> he published <a href=\"http:\/\/geni.us\/costofliving\" target=\"_blank\"><em>The Costs of Living<\/em><\/a>, which traces the impact of free-market thinking on the explosion of consumerism -- and the effect of the new capitalism on social and cultural institutions that once operated above the market, such as medicine, sports and the law. And after <em>Paradox<\/em>, he argued for the importance of remoralizing our lives -- both public and private -- in the book&nbsp;<a href=\"https:\/\/geni.us\/qQoRK8z\" target=\"_blank\"><em>Practical Wisdom<\/em><\/a>, coauthored with&nbsp;<a href=\"https:\/\/www.ted.com\/talks\/barry_schwartz_using_our_practical_wisdom\" target=\"_blank\">Kenneth Sharpe<\/a>. Both books level serious criticism against modern Western society, illuminating the under-reported psychological plagues of our time. But they also offer concrete ideas on addressing these problems, on a personal and societal level.<\/p><p>Schwartz is the author of the TED Book,&nbsp;<em><a href=\"http:\/\/geni.us\/whyweworkintl\" target=\"_blank\">Why We Work<\/a>, <\/em>and a professor of social theory at Swarthmore College.<\/p>","slug":"barry_schwartz","published_at":"2007-04-01 22:54:00","updated_at":"2020-09-11 15:46:57"}}