{"speaker":{"id":912,"title":"","firstname":"Bill","middleinitial":"","lastname":"Ford","description":"Executive chair, Ford Motor Co.","whotheyare":"As executive chair of the Ford Motor Company, Bill Ford leads the company that put the world on wheels.","whylisten":"<p>William Clay Ford Jr. is the executive chair of the Ford Motor Company, founded by his great-grandfather, Henry Ford, in Detroit. This massive company found great success selling cars to the world. Now, Ford is looking toward a future that&#39;s not simply about selling more and more cars. Ford looks to a future where cars are greener and cleaner, move more efficiently on better, smarter road systems -- and sometimes are replaced by mass transit and other forms of mobility.<\/p><p>Ford joined Ford Motor Company in 1979 as a product  planning  analyst.&nbsp; He subsequently held a  variety of positions in manufacturing,  sales, marketing, product development  and finance.&nbsp; During the  breakthrough  1982 Ford-United Auto Workers labor talks, which launched  the employee  involvement movement that revolutionized the industry, he  served on the  company&rsquo;s National Bargaining Team. <\/p><p>Mr. Ford joined the Board of Directors in 1988 and has been  its  chairman since January 1999.&nbsp; He  serves as chairman of the board&#39;s  Finance Committee and as a member of the  Sustainability Committee.&nbsp; He  also served  as chief executive officer of the company from October 2001  to September 2006,  when he was named executive chairman.<\/p> <p>As CEO, Mr. Ford improved quality, lowered costs and  delivered  exciting new products.&nbsp; During  his time in that position he took the  company from a $5.5 billion loss in 2001  to three straight years of  profitability.&nbsp;  Through the years, his vision for the company has  remained unchanged.<\/p><p>He says: &quot;The ongoing success of Ford Motor Company is my life&rsquo;s work. We want to have an even  greater impact in our next 100 years than we  did in our first 100.&quot;<\/p>","slug":"bill_ford","published_at":"2010-12-19 23:19:00","updated_at":"2011-06-20 14:50:34"}}