{"speaker":{"id":916,"title":"","firstname":"Sal","middleinitial":"","lastname":"Khan","description":"Educator and social entrepreneur","whotheyare":"In 2004, Sal Khan, a hedge fund analyst, began making math tutorials for his cousins. Twelve years later, Khan Academy has more than 42 million registered users from 190 countries, with tutorials on subjects from basic math through economics, art history, computer science, health, medicine and more.","whylisten":"<p>Salman &quot;Sal&quot; Khan is the founder and chief executive officer of Khan Academy, a not-for-profit with a mission of providing a free, world-class education for anyone, anywhere.<\/p><p>Khan Academy started as a passion project in 2004. Khan&#39;s cousin was struggling with math, so he tutored her remotely and posted educational videos on YouTube. So many people watched the videos that eventually Khan quit his job at a hedge fund and pursued Khan Academy full time. Today Khan Academy has more than 100 employees in Mountain View, California. Khan Academy believes learners of all ages should have unlimited access to free educational content they can master at their own pace. Its resources cover preschool through early college education, including math, grammar, biology, chemistry, physics, economics, finance and history. Additionally, Khan Academy offers free personalized SAT test prep in partnership with the test developer, the College Board. More than 42 million registered users access Khan Academy in dozens of languages across 190 countries.<\/p><p>Khan has been profiled by &quot;60 Minutes,&quot; featured on the cover of <em>Forbes<\/em>, and recognized as one of TIME&rsquo;s &quot;100 Most Influential People in the World.&quot; In his book,&nbsp;<a href=\"https:\/\/www.amazon.com\/One-World-Schoolhouse-Education-Reimagined\/dp\/1455508373\" target=\"_blank\"><em>The One World Schoolhouse: Education Reimagined<\/em><\/a>, Sal outlines his vision for the future of education.<\/p><p>Khan holds three degrees from MIT and an MBA from Harvard Business School.<\/p>","slug":"salman_khan","published_at":"2010-12-23 19:57:00","updated_at":"2018-01-31 19:34:12"}}