{"speaker":{"id":92,"title":"","firstname":"Dan","middleinitial":"","lastname":"Dennett","description":"Philosopher, cognitive scientist","whotheyare":"Dan Dennett thinks that human consciousness and free will are the result of physical processes.","whylisten":"<p>One of our most important living philosophers, Dan Dennett is best known for his provocative and controversial arguments that human consciousness and free will are the result of physical processes in the brain. He argues that the brain&#39;s computational circuitry fools us into thinking we know more than we do, and that what we call consciousness &mdash; isn&#39;t. His 2003 book &quot;Freedom Evolves&quot; explores how our brains evolved to give  us -- and only us -- the kind of freedom that matters, while 2006&#39;s  &quot;Breaking the Spell&quot; examines belief through the lens of biology.<br \/><br \/>This mind-shifting perspective on the mind itself has distinguished Dennett&#39;s career as a philosopher and cognitive scientist. And while the philosophy community has never quite known what to make of Dennett (he defies easy categorization, and refuses to affiliate himself with accepted schools of thought), his computational approach to understanding the brain has made him, as Edge&#39;s John Brockman writes, &ldquo;the philosopher of choice of the AI community.&rdquo;<br \/><br \/>&ldquo;It&#39;s tempting to say that Dennett has never met a robot he didn&#39;t like, and that what he likes most about them is that they are philosophical experiments,&rdquo; Harry Blume wrote in the <em>Atlantic Monthly<\/em> in 1998. &ldquo;To the question of whether machines can attain high-order intelligence, Dennett makes this provocative answer: &lsquo;The best reason for believing that robots might some day become conscious is that we human beings are conscious, and we are a sort of robot ourselves.&#39;&quot;<\/p><p>In recent years, Dennett has become outspoken in his atheism, and his 2006 book&nbsp;<a href=\"http:\/\/geni.us\/breakingthespell\" target=\"_blank\"><em>Breaking the Spell<\/em><\/a>&nbsp;calls for religion to be studied through the scientific lens of evolutionary biology. Dennett regards religion as a natural -- rather than supernatural -- phenomenon, and urges schools to break the taboo against empirical examination of religion. He argues that religion&#39;s influence over human behavior is precisely what makes gaining a rational understanding of it so necessary: &ldquo;If we don&#39;t understand religion, we&#39;re going to miss our chance to improve the world in the 21st century.&rdquo;<\/p><p>Dennett&#39;s landmark books include <em>The Mind&#39;s I<\/em>, co-edited with Douglas Hofstaedter,&nbsp;<a href=\"http:\/\/geni.us\/consciousnessexplained\" target=\"_blank\"><em>Consciousness Explained<\/em><\/a><em>,<\/em> and&nbsp;<a href=\"http:\/\/geni.us\/darwinsdangerousidea\" target=\"_blank\"><em>Darwin&#39;s Dangerous Idea<\/em><\/a><em>. <\/em>Read an excerpt from his 2013 book, <a href=\"http:\/\/geni.us\/intuitionpumps\" target=\"_blank\"><em>Intuition Pumps<\/em><\/a>, in the <a href=\"http:\/\/www.guardian.co.uk\/books\/2013\/may\/19\/daniel-dennett-intuition-pumps-thinking-extract\" target=\"_blank\"><em>Guardian<\/em> &gt;&gt;<\/a>  <\/p>","slug":"dan_dennett","published_at":"2007-04-02 01:28:00","updated_at":"2018-06-15 02:09:41"}}