{"speaker":{"id":921,"title":"","firstname":"Handspring","middleinitial":"","lastname":"Puppet Company","description":"Puppeteers","whotheyare":"Basil Jones and Adrian Kohler, of Handspring Puppet Company, bring the emotional complexity of animals to the stage with their life-size puppets. Their latest triumph: \"War Horse.\"","whylisten":"<p><a href=\"http:\/\/www.handspringpuppet.co.za\/\" target=\"_blank\">Handspring Puppet Company<\/a>  was founded in 1981 by four graduates of  the Michaelis School of Fine Art in Cape Town, South Africa.  Two of the  co-founders, Adrian Kohler and Basil Jones, continue to run the  company.  Originally they created shows for children and thereafter  works for adult audiences. Arguably one of the greatest puppetry  companies in the world, Handspring has since collaborated with a  succession of innovative South Africa directors including Malcolm  Purkey, Barney Simon and artist William Kentridge.<\/p> \t\t\t\t\t <p>Apart from seasons throughout theatres across South Africa,  Handspring has been presented at many international festivals including  Edinburgh, the Avignon Festival, the Next Wave Festival at BAM in New  York, The African Odyssey Festival at the Kennedy Centre in Washington,  Theatre d&#39; Automne in Paris, Theatre der Welt in Germany, as well as in  Hong Kong, Singapore, Adelaide, Zurich and Bogota.<\/p> \t\t\t\t\t <p>The company provides an artistic home and professional base for a  core group of performers, designers, theatre artists and technicians  who collaborate with them on a project basis.  Based in South Africa  they continue to explore the boundaries of adult puppet theatre within  an African context.<\/p><p>&quot;War Horse&quot; is currently playing in <a href=\"http:\/\/warhorselondon.nationaltheatre.org.uk\/\" target=\"_blank\">London<\/a>,  at the New London Theatre, and <a href=\"http:\/\/www.lct.org\/showMain.htm?id=199\" target=\"_blank\">opens in New York<\/a> at Lincoln Center on April 14, 2011. <\/p>","slug":"handspring_puppet_company","published_at":"2010-12-24 13:48:00","updated_at":"2011-03-30 14:38:24"}}