{"speaker":{"id":924,"title":"General","firstname":"Stanley","middleinitial":"","lastname":"McChrystal","description":"Military leader","whotheyare":"General Stanley McChrystal is the former commander of U.S. and International forces in Afghanistan. A four-star general, he is credited for creating a revolution in warfare that fuses intelligence and operations.","whylisten":"<p>With a remarkable record of achievement, General Stanley McChrystal has been praised for creating a revolution in warfare that fused intelligence and operations. A four-star general, he is the former commander of U.S. and international forces in Afghanistan and the former leader of Joint Special Operations Command (JSOC), which oversees the military&rsquo;s most sensitive forces. McChrystal&rsquo;s leadership of JSOC is credited with the December 2003 capture of Saddam Hussein and the June 2006 location and killing of Abu Musab al-Zarqawi, the leader of al-Qaeda in Iraq. McChrystal, a former Green Beret, is known for his candor.<br \/><br \/>After McChrystal graduated from West Point, he was commissioned as an infantry officer, and spent much of his career commanding special operations and airborne infantry units. During the Persian Gulf War, McChrystal served in a Joint Special Operations Task Force and later commanded the 75th Ranger Regiment. He completed year-long fellowships at Harvard&rsquo;s John F. Kennedy School of Government in 1997 and in 2000 at the Council on Foreign Relations. In 2002, he was appointed chief of staff of military operations in Afghanistan. Two years later, McChrystal was selected to deliver nationally televised Pentagon briefings about military operations in Iraq. From 2003 to 2008, McChrystal commanded JSOC and was responsible for leading the nation&rsquo;s deployed military counter-terrorism efforts around the globe. He assumed command of all International Forces in Afghanistan in June 2009. President Obama&rsquo;s order for an additional 30,000 troops to Afghanistan was based on McChrystal&rsquo;s assessment of the war there. McChrystal retired from the military in August 2010. <\/p>","slug":"stanley_mcchrystal","published_at":"2011-01-04 19:57:00","updated_at":"2014-05-06 19:54:42"}}