{"speaker":{"id":929,"title":"","firstname":"Neil","middleinitial":"","lastname":"Pasricha","description":"Thinker, writer, speaker, podcaster","whotheyare":"Neil Pasricha is one of the world's leading authorities on intentional living.","whylisten":"        <p class=\"p1\">In 2008, Neil Pasricha&#39;s world fell apart after a sudden divorce and death of a close friend. He channeled his energies into his blog 1000 Awesome Things, which counted down one small pleasure -- like snow days, bakery air or finding money in your coat pocket -- every single day for 1000 straight days. While writing his blog, Pasricha was working as Director of Leadership Development inside Walmart.<\/p><p class=\"p1\"><span class=\"s1\">Years later, he fell in love again and got married. On the airplane home from his honeymoon, his wife told him she was pregnant, and Pasricha began writing again. The result was a 300-page letter written to his unborn son sharing the nine secrets to finding true happiness. That letter has evolved into<\/span>&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/0425277984\/\" target=\"_blank\"><em>The Happiness Equation<\/em><\/a>.<\/p><p class=\"p1\">Pasricha is the <em>New York Times<\/em> bestselling author of six books which have spent over 200 weeks on bestseller lists and sold more than a million copies, including&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/0425238903\" target=\"_blank\"><em>The Book of Awesome<\/em><\/a> (gratitude),&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/0425277984\/\" target=\"_blank\"><em>The Happiness Equation<\/em><\/a>&nbsp;(happiness) and&nbsp;<a href=\"https:\/\/www.amazon.com\/gp\/product\/1982135883\/\" target=\"_blank\"><em>You Are Awesome<\/em><\/a>&nbsp;(resilience). He spent a decade running leadership development inside Walmart after completing his Harvard MBA. Pasricha&nbsp;is one of the world&#39;s leading authorities on intentional living.&nbsp;<\/p>","slug":"neil_pasricha","published_at":"2011-01-07 16:04:00","updated_at":"2019-10-24 13:09:59"}}