{"speaker":{"id":93,"title":"","firstname":"Richard","middleinitial":"","lastname":"Dawkins","description":"Evolutionary biologist","whotheyare":"Oxford professor Richard Dawkins has helped steer evolutionary science into the 21st century, and his concept of the \"meme\" contextualized the spread of ideas in the information age. In recent years, his devastating critique of religion has made him a leading figure in the New Atheism.","whylisten":"<p>As an evolutionary biologist, Richard Dawkins has broadened our understanding of the genetic origin of our species; as a popular author, he has helped lay readers understand complex scientific concepts. He&#39;s best-known for the ideas laid out in his landmark book <a href=\"http:\/\/geni.us\/selfishgene\" target=\"_blank\"><em>The Selfish Gene<\/em><\/a>  and fleshed out in <a href=\"http:\/\/geni.us\/extendedphenotype\" target=\"_blank\"><em>The Extended Phenotype<\/em><\/a>: the rather radical notion that <strong>Darwinian selection happens not at the level of the individual, but at the level of our DNA<\/strong>. The implication: We evolved for only one purpose &mdash; to serve our genes.<br \/><br \/>Of perhaps equal importance is Dawkins&#39; concept of the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Meme\" target=\"_blank\">meme<\/a>, which he defines as a self-replicating unit of culture -- an idea, a chain letter, a catchy tune, an urban legend -- which is passed person-to-person, its longevity based on its ability to lodge in the brain and inspire transmission to others. Introduced in <em>The Selfish Gene<\/em> in 1976, <strong>the concept of memes has itself proven highly contagious, inspiring countless accounts and explanations of idea propagation<\/strong> in the information age.<br \/><br \/>In recent years, <strong>Dawkins has become outspoken in his atheism<\/strong>, coining the word &quot;bright&quot; (as an alternate to atheist), and encouraging fellow non-believers to stand up and be identified. His controversial, confrontational 2002 TED talk was a seminal moment for the New Atheism, as was the publication of his 2006 book, <em><a href=\"http:\/\/geni.us\/goddelusion\" target=\"_blank\">The God Delusion<\/a>,<\/em> a bestselling critique of religion that championed atheism and promoted scientific principles over creationism and intelligent design.<\/p>","slug":"richard_dawkins","published_at":"2007-04-05 19:28:00","updated_at":"2015-07-09 22:11:15"}}