{"speaker":{"id":939,"title":"","firstname":"Bruce","middleinitial":"","lastname":"Feiler","description":"Writer, TV host","whotheyare":"Bruce Feiler is a leading voice on family, work, transitions and meaning.","whylisten":"<p>Bruce Feiler is one of America&rsquo;s most thoughtful voices on contemporary life. He is the author of seven <em>New York Times<\/em> bestsellers; the presenter of two prime-time series on PBS; and the inspiration for the NBC drama series Council of Dads. A former columnist with the <em>New York Times<\/em>, Feiler writes the newsletter&nbsp;<a href=\"https:\/\/brucefeiler.bulletin.com\/\" target=\"_blank\">The Nonlinear Life<\/a> about navigating life&rsquo;s ups and downs.<\/p><p>Employing a firsthand approach to his work, Feiler is known for living the experiences he writes about. His work combines timeless wisdom with timely knowledge to encourage people to live with more meaning, passion and joy. His latest book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Life-Story-You-Tell-Yourself\/dp\/1594206821\" target=\"_blank\"><em>Life is in the Transitions: Mastering Change at Any Age<\/em>,<\/a> describes his journey across America, collecting hundreds of life stories, exploring how we can navigate life&rsquo;s growing number of with skill and purpose.<\/p><p>His next book is about how to find meaning and purpose at work.<\/p><p>Feiler has long explored the intersection of families, relationships, health and happiness. His book,&nbsp;<a href=\"https:\/\/www.amazon.com\/Secrets-Happy-Families-Improve-Mornings\/dp\/0061778745\" target=\"_blank\"><em>The Secrets of Happy Families<\/em><\/a>, collects best practices from some of the country&rsquo;s most creative minds. He captured what he learned in the TED Talk, &ldquo;<a href=\"https:\/\/www.ted.com\/talks\/bruce_feiler_agile_programming_for_your_family\" target=\"_blank\">Agile programming&mdash;for your family<\/a>.&rdquo;&nbsp;<em><a href=\"https:\/\/www.amazon.com\/gp\/product\/006177877X\" target=\"_blank\">The Council of Dads<\/a> <\/em>describes how, faced with one of life&rsquo;s greatest challenges, he asked six friends to support his young daughters. He narrates that story, which became a documentary on CNN hosted by Sanjay Gupta, in this TED Talk.&nbsp;<\/p><p>A native of Savannah, Georgia, Feiler lives in Brooklyn with his wife, Linda Rottenberg, and their identical twin daughters.&nbsp;<\/p>","slug":"bruce_feiler","published_at":"2011-01-27 17:25:00","updated_at":"2022-06-02 19:24:05"}}