{"speaker":{"id":94,"title":"","firstname":"Dan","middleinitial":"","lastname":"Gilbert","description":"Psychologist; happiness expert","whotheyare":"Harvard psychologist Dan Gilbert says our beliefs about what will make us happy are often wrong -- a premise he supports with intriguing research, and explains in his accessible and unexpectedly funny book, <em>Stumbling on Happiness.<\/em>","whylisten":"<p>Dan Gilbert believes that, in our ardent, lifelong pursuit of happiness, most of us have the wrong map. In the same way that optical illusions fool our eyes -- and fool everyone&#39;s eyes in the same way -- Gilbert argues that <strong>our brains systematically misjudge what will make us happy<\/strong>. And these quirks in our cognition make humans very poor predictors of our own bliss.<br \/><br \/>The premise of his current research -- that our assumptions about what will make us happy are often wrong -- is supported with clinical research drawn from psychology and neuroscience. But his delivery is what sets him apart. His engaging -- and often hilarious -- style pokes fun at typical human behavior and invokes pop-culture references everyone can relate to. This winning style translates also to Gilbert&#39;s writing, which is <strong>lucid, approachable and laugh-out-loud funny<\/strong>. The immensely readable <em><a href=\"http:\/\/www.randomhouse.com\/kvpa\/gilbert\/\" target=\"_blank\">Stumbling on Happiness<\/a>,<\/em> published in 2006, became a <em>New York Times<\/em> bestseller and has been translated into 20 languages.<br \/><br \/>In fact, the title of his book could be drawn from his own life. At 19, he was a high school dropout with dreams of writing science fiction. When a creative writing class at his community college was full, he enrolled in the only available course: psychology. He found his passion there, earned a doctorate in social psychology in 1985 at Princeton, and has since won a Guggenheim Fellowship and the Phi Beta Kappa teaching prize for his work at Harvard. He has written essays and articles for <em>The New York Times, Time<\/em> and even <a href=\"http:\/\/wjh-www.harvard.edu\/~dtg\/STARBUCKS%20CUP.pdf\" target=\"_blank\">Starbucks<\/a>, while <strong>continuing his research into happiness at his <a href=\"http:\/\/wjh-www.harvard.edu\/~dtg\/gilbert.htm\" target=\"_blank\">Hedonic Psychology Laboratory<\/a>.<\/strong><\/p>","slug":"dan_gilbert","published_at":"2007-04-05 19:33:00","updated_at":"2015-07-02 16:59:45"}}