{"speaker":{"id":945,"title":"","firstname":"Krista","middleinitial":"","lastname":"Tippett","description":"Journalist","whotheyare":"Krista Tippett hosts the national public radio program \"On Being,\" which takes up the great, animating questions of human life: What does it mean to be human? And how do we want to live?","whylisten":"<p>Krista Tippett grew up in Oklahoma, the granddaughter of a Southern Baptist preacher. She studied history at Brown University and went to Bonn, West Germany in 1983 on a Fulbright Scholarship to study politics in Cold War Europe. In her 20s, she ended up in divided Berlin for most of the 1980s, first as the<em> New York Times<\/em> stringer and a freelance correspondent for <em>Newsweek<\/em>, the <em>International Herald Tribune<\/em>, the BBC and <em>Die Zeit<\/em>. She later became a special assistant to the U.S. Ambassador to West Germany. <br \/><br \/>When Tippett graduated with a M.Div. from Yale, she saw a black hole where intelligent coverage of religion should be. As she conducted a far-flung oral history project for the Benedictines of St. John&#39;s Abbey, she began to imagine radio conversations about the spiritual and intellectual content of faith that could open minds and enrich public life. These imagined conversations became reality when she created &quot;Speaking of Faith&quot; (later &quot;On Being&quot;), which is broadcast on over 200 US public radio stations and globally by NPR. From ecology to autism to torture, Tippett and her guests reach beyond the headlines to explore meaning, faith and ethics amidst the political, economic, cultural and technological shifts that define 21st-century life. Tippett is the author of&nbsp;<a href=\"http:\/\/geni.us\/speakingoffaith\" target=\"_blank\"><em>Speaking of Faith<\/em><\/a>&nbsp;and&nbsp;<a href=\"http:\/\/geni.us\/einsteinsgod\" target=\"_blank\"><em>Einstein&#39;s God<\/em><\/a>.<\/p>","slug":"krista_tippett","published_at":"2011-02-14 17:04:00","updated_at":"2018-01-21 14:53:57"}}