{"speaker":{"id":947,"title":"","firstname":"Janna","middleinitial":"","lastname":"Levin","description":"Physicist","whotheyare":"Janna Levin is a professor of physics and astronomy at Barnard, where she studies the early universe, chaos, and black holes. She's the author of  “How the Universe Got Its Spots\" and the novel “A Madman Dreams of Turing Machines.”","whylisten":"<p>Janna Levin is a Professor of Physics and Astronomy at <a href=\"http:\/\/www.barnard.edu\/\" target=\"_blank\">Barnard College<\/a> of <a href=\"http:\/\/www.iscap.columbia.edu\/\" target=\"_blank\">Columbia University<\/a>. Her scientific research concerns the early universe, chaos and black holes. Her second book &ndash; a novel, <em><a href=\"http:\/\/www.jannalevin.com\/books.html\">A Madman Dreams of Turing Machines<\/a><\/em> &ndash; won the <a href=\"http:\/\/www.pen.org\/page.php\/prmID\/1308\" target=\"_blank\">PEN\/Bingham Fellowship for Writers<\/a> and was a  runner-up for the PEN\/Hemingway award for &quot;a distinguished book of first  fiction.&quot; She is the author of the popular science book, <em><a href=\"http:\/\/www.jannalevin.com\/books.html\">How the Universe Got Its Spots: Diary of a Finite Time in a Finite Space<\/a><\/em>.<br \/><br \/>  She holds a BA in Physics and Astronomy from Barnard College with a  concentration in Philosophy, and a PhD from MIT in Physics. She has  worked at the Center for Particle Astrophysics (CfPA) at the University  of California, Berkeley before moving to the UK where she worked at  Cambridge University in the <a href=\"http:\/\/www.damtp.cam.ac.uk\/\" target=\"_blank\">Department of Applied Mathematics and Theoretical Physics<\/a>  (DAMTP). Just before returning to New York, she was the first scientist-in-residence at the Ruskin School of Fine Art and Drawing at Oxford with an award from the National Endowment for Science, Technology, and Arts (<a href=\"http:\/\/www.nesta.org.uk\/\" target=\"_blank\">NESTA<\/a>).<\/p><p>Listen to a Q&amp;A with another TED speaker, <a href=\"\/talks\/krista_tippett_reconnecting_with_compassion.html\" target=\"_blank\">Krista Tippett<\/a>  -- where they talk <a href=\"http:\/\/being.publicradio.org\/programs\/2009\/mathandtruth\/\" target=\"_blank\">math and faith and truth and more ...<\/a>  <\/p>","slug":"janna_levin","published_at":"2011-02-16 16:25:00","updated_at":"2011-03-17 15:53:59"}}