{"speaker":{"id":973,"title":"","firstname":"AnnMarie","middleinitial":"","lastname":"Thomas","description":"Educator","whotheyare":"AnnMarie Thomas works on the playful side of engineering -- using cool tools to teach and help others.","whylisten":"<p><a href=\"http:\/\/courseweb.stthomas.edu\/apthomas\/\" target=\"_blank\">AnnMarie Thomas<\/a>  joined the faculty of the University of St. Thomas in the fall of 2006. Previously, she was a faculty member at Art Center College of Design. She is the director of the UST Design laboratory and leads a team of students looking at both the playful side of engineering (squishy circuits for students, the science of circus, toy design) and ways to use engineering design to help others (projects in technology design for older adults). Thomas, in partnership with collaborator Jan Hansen, is co-director of the University of St. Thomas Center for Pre-Collegiate Engineering Education (CPCEE).<\/p><p>Thomas teaches Engineering Graphics, Machine Design, Dynamics (with Circus Lab), Toy Design, Product Design for an Aging Population, and Brain Machine Interfaces (seminar). She organizes the School of Engineering Design Night (featuring the ENGR320 Machine Design competition), and the Design Discussions seminar series.<br \/><br \/>Thomas has also worked on underwater robotics (at MIT, Caltech and the Monterey Bay Aquarium Research Institute), specializing in biologically inspired propulsion. She has consulted on projects ranging from the design\/creation of a &quot;musical earthquake-playing robot&quot; to the initial research for a book on earthquakes in Los Angeles. At Caltech, she founded the Caltech Robotics Outreach Group (CROG) and the Caltech\/JPL\/LEGO Middle School Robotics Conference.<\/p><p>Get the recipes for the two squishy circuits <a href=\"http:\/\/courseweb.stthomas.edu\/apthomas\/SquishyCircuits\/index.htm\" target=\"_blank\">play doughs here &gt;&gt;<\/a>  <\/p>","slug":"annmarie_thomas","published_at":"2011-04-04 02:14:00","updated_at":"2011-04-04 15:17:50"}}