{"speaker":{"id":981,"title":"","firstname":"Ben","middleinitial":"","lastname":"Goldacre","description":"Debunker","whotheyare":"Ben Goldacre unpicks dodgy scientific claims made by scaremongering journalists, dubious government reports, pharmaceutical corporations, PR companies and quacks.","whylisten":"<p>&quot;It was the MMR story that finally made me crack,&quot; begins the Bad Science manifesto, referring to the sensationalized -- and now-refuted -- link between vaccines and autism. With that sentence Ben Goldacre fired the starting shot of a crusade waged from the pages of <em>The Guardian<\/em> from 2003 to 2011, on an addicitve <a href=\"https:\/\/twitter.com\/#%21\/bengoldacre\" target=\"_blank\">Twitter<\/a>  feed, and in bestselling books, including <a href=\"http:\/\/geni.us\/badscience\" target=\"_blank\"><em>Bad Science<\/em><\/a> and his latest, <em><a href=\"http:\/\/geni.us\/badpharma\" target=\"_blank\">Bad Pharma<\/a>, <\/em>which puts the $600 billion global pharmaceutical industry under the microscope. What he reveals is a fascinating, terrifying mess. <br \/><br \/>Goldacre was trained in medicine at Oxford and London, and works as an academic in epidemiology. Helped along by this inexhaustible supply of material, he also travels the speaking circuit, promoting skepticism and nerdish curiosity with fire, wit, fast delivery and a lovable kind of exasperation. (He might even convince you that real science, sober reporting and reason are going to win in the end.) <\/p><p>As he writes, &quot;If you&#39;re a journalist who misrepresents science for the sake of a headline, a politician more interested in spin than evidence, or an advertiser who loves pictures of molecules in little white coats, then beware: your days are numbered.&quot;<\/p><p>Read <a href=\"http:\/\/www.guardian.co.uk\/business\/2012\/sep\/21\/drugs-industry-scandal-ben-goldacre\" target=\"_blank\">an excerpt of <em>Bad Pharma<\/em> &gt;&gt; <\/a> <\/p>","slug":"ben_goldacre","published_at":"2011-04-19 13:36:00","updated_at":"2017-02-28 16:32:51"}}