{"speaker":{"id":984,"title":"","firstname":"Bruce","middleinitial":"","lastname":"Schneier","description":"Security expert","whotheyare":"Bruce Schneier thinks hard about security -- as a computer security guru, and as a philosopher of the larger notion of making a safer world. ","whylisten":"<p><a href=\"http:\/\/www.schneier.com\/\" target=\"_blank\">Bruce Schneier<\/a>  is an internationally renowned security technologist and author. Described by the <em>Economist<\/em> as a &quot;security guru,&quot; he is best known as a refreshingly candid and lucid security critic and commentator. When people want to know how security really works, they turn to Schneier. <\/p><p>His first bestseller,&nbsp;<em><a href=\"http:\/\/geni.us\/appliedcryptography\" target=\"_blank\">Applied Cryptography<\/a>,<\/em>&nbsp;explained how the arcane science of secret codes actually works, and was described by <em>Wired<\/em> as &quot;the book the National Security Agency wanted never to be published.&quot; His book on computer and network security,&nbsp;<a href=\"http:\/\/geni.us\/secretsandlies\" target=\"_blank\"><em>Secrets and Lies<\/em><\/a>, was called by <em>Fortune<\/em> &quot;[a] jewel box of little surprises you can actually use.&quot;&nbsp;<a href=\"http:\/\/geni.us\/beyondfear\" target=\"_blank\"><em>Beyond Fear<\/em><\/a>&nbsp;tackles the problems of security from the small to the large: personal safety, crime, corporate security, national security. His current book,&nbsp;<em><a href=\"http:\/\/geni.us\/schneieronsecurity\" target=\"_blank\">Schneier on Security<\/a>,<\/em>&nbsp;offers insight into everything from the risk of identity theft (vastly overrated) to the long-range security threat of unchecked presidential power and the surprisingly simple way to tamper-proof elections. <\/p><p>Schneier publishes a free monthly newsletter, <em><a href=\"http:\/\/www.schneier.com\/crypto-gram.html\" target=\"_blank\">Crypto-Gram<\/a>,<\/em> with over 150,000 readers. In its ten years of regular publication, <em>Crypto-Gram<\/em> has become one of the most widely read forums for free-wheeling discussions, pointed critiques and serious debate about security. As head curmudgeon at the table, Schneier explains, debunks and draws lessons from security stories that make the news.<\/p>","slug":"bruce_schneier","published_at":"2011-04-26 13:50:00","updated_at":"2016-11-22 22:23:11"}}