{"speaker":{"id":989,"title":"","firstname":"Louie","middleinitial":"","lastname":"Schwartzberg","description":"Filmmaker","whotheyare":"Louie Schwartzberg is a cinematographer, director and producer who captures breathtaking images that celebrate life -- revealing connections, universal rhythms, patterns and beauty.","whylisten":"<p>Louie Schwartzberg is a cinematographer, director and producer whose career spans more than four decades of providing breathtaking imagery using his time-lapse, high-speed and macro cinematography techniques. Schwartzberg tells stories that celebrate life and reveal the mysteries and wisdom of nature, people and places.<\/p><p>Schwartzberg&#39;s recent theatrical releases include the 3D IMAX film,&nbsp;<a href=\"http:\/\/movies.nationalgeographic.com\/movies\/mysteries-of-the-unseen-world\/\" target=\"_blank\"><em>Mysteries of the Unseen World<\/em><\/a>&nbsp;with National Geographic, narrated by Forest Whitaker, and the documentary&nbsp;<a href=\"http:\/\/nature.disney.com\/wings-of-life\" target=\"_blank\"><em>Wings of Life<\/em><\/a>&nbsp;for Disneynature, narrated by Meryl Streep. <em>Mysteries of the Unseen World<\/em>&nbsp;is a journey into invisible worlds that are too slow, too fast, too small and too vast for the human eye to see, while <em>Wings of Life<\/em> focuses on pollination and the web of life. Schwartzberg also directed <em>Soarin&#39; Around the World<\/em>, an international update to the original Soarin&#39; ride now showing at Disney Parks in Anaheim, Orlando and Shanghai.<\/p><p>Designed to inspire, educate and evolve our perspective on the world, Schwartzberg creates and curates&nbsp;<a href=\"https:\/\/movingart.com\/\" target=\"_blank\">Moving Art<\/a>&nbsp;videos, which can be found on your smart phone and Netflix. The Moving Art series will be expanded from six to thirteen videos in early 2017.<\/p><p>Schwartzberg&#39;s&nbsp;<a href=\"http:\/\/gratituderevealed.com\/\" target=\"_blank\"><em>Gratitude Revealed<\/em><\/a>&nbsp;series of shorts were launched on Oprah.com. Supported by the Templeton Foundation, with science and analytics by the Greater Good Center at UC Berkeley, the series explores the multifaceted virtues of gratitude. Schwartzberg is the first filmmaker to be inducted into the Association for the Advancement of Science and the Lemelson Foundation&rsquo;s Invention Ambassadors Program.<\/p><p>For Schwartzberg, the greatest satisfaction is creating works that can have a positive effect on the future of the planet. &quot;I hope my films inspire and open people&#39;s hearts,&quot; he says. &quot;Beauty is nature&#39;s tool for survival -- we protect what we love. Nature&#39;s beauty can open hearts, and the shift in consciousness we need to sustain and celebrate life.&quot;<\/p>","slug":"louie_schwartzberg","published_at":"2011-05-06 13:57:00","updated_at":"2016-08-19 02:54:16"}}