{"speaker":{"id":99,"title":"","firstname":"Evelyn","middleinitial":"","lastname":"Glennie","description":"Musician","whotheyare":"Percussionist and composer Dame Evelyn Glennie lost nearly all of her hearing by age 12. Rather than isolating her, it has given her a unique connection to her music.","whylisten":"<p>Dame Evelyn Glennie&#39;s music challenges the listener to ask where music comes from: Is it more than simply a translation from score to instrument to audience? <br \/><br \/>The Grammy-winning percussionist and composer became almost completely deaf by the age of 12, but her hearing loss brought her a deeper understanding of and connection to the music she loves. She&#39;s the subject of the documentary <em><a href=\"http:\/\/www.skyline.uk.com\/touchthesound\/index.html\" target=\"_blank\">Touch the Sound<\/a>,<\/em> which explores this unconventional and intriguing approach to percussion.  <br \/><br \/>Along with her vibrant solo career, Glennie has collaborated with musicians ranging from classical orchestras to Bj&ouml;rk. Her career has taken her to hundreds of concert stages around the world, and she&#39;s recorded a dozen albums, winning a Grammy for her recording of<a href=\"http:\/\/geni.us\/bartoksonata\" target=\"_blank\"><\/a> <a href=\"http:\/\/www.amazon.com\/Bart%C3%B3k-Sonata-Pianos-Percussion-Variations\/dp\/B0000026HH\/ref=sr_1_15\/002-0596195-8622435?ie=UTF8&amp;s=music&amp;qid=1176914497&amp;sr=1-15\" target=\"_blank\">Bart&oacute;k&#39;s <\/a> <em><a href=\"http:\/\/www.amazon.com\/Bart%C3%B3k-Sonata-Pianos-Percussion-Variations\/dp\/B0000026HH\/?tag=tedspeakers-20\" target=\"_blank\">Sonata for Two Pianos and Percussion<\/a>,<\/em><em>&nbsp;<\/em>and another for <a href=\"http:\/\/geni.us\/perpetualmotion\" target=\"_blank\">her 2002 collaboration with Bela Fleck<\/a>.<\/p><p>Her passion for music and musical literacy brought her to establish, in collaboration with fellow musicians Julian Lloyd Weber and Sir James Galway, the Music Education Consortium, which successfully lobbied for an investment of 332 million pounds in music education and musical resources in Britain.&nbsp;<\/p>","slug":"evelyn_glennie","published_at":"2007-04-06 17:44:00","updated_at":"2015-07-09 21:34:18"}}