{"speaker":{"id":997,"title":"","firstname":"Allan","middleinitial":"","lastname":"Jones","description":"Brain scientist","whotheyare":"As CEO of the Allen Institute for Brain Science, Allan Jones leads an ambitious project to build an open, online, interactive atlas of the human brain.","whylisten":"<p>The Allen Institute for Brain Science -- based in Seattle, kickstarted by Microsoft co-founder Paul Allen -- has a mission to fuel discoveries about the human brain by building tools the entire scientific community can use. As CEO, one of Allan Jones&#39; first projects was to lead the drive to create a comprehensive atlas of the brain of a mouse. Flash forward to April 2011, when the Allen Institute announced the first milestone in its online interactive atlas of the human brain, showing the activity of the more than 20,000 human genes it contains. It&#39;s based on a composite of 15 brains, since every human brain is unique.<br \/><br \/>Think of the Allen Human Brain Atlas as a high-tech bridge between brain anatomy and genetics. Using this atlas, scientists will be able to determine where in the brain genes that encode specific proteins are active, including proteins that are affected by medication. Or researchers could zoom in on brain structures thought to be altered in mental disorders such as schizophrenia to find their molecular footprint. The atlas may provide clues to memory, attention, motor coordination, hunger, and perhaps emotions such as happiness or anxiety.<\/p><p>He says: &quot;Understanding how our genes are used in our brains will help scientists and the medical community better understand and discover new treatments for the full spectrum of brain diseases and disorders.&quot; <\/p><p>Watch Dr. Jones&#39; latest TEDx talk on the map of the brain, from <a href=\"https:\/\/www.youtube.com\/watch?v=XBcPFhg0BC8\" target=\"_blank\">TEDxCaltech 2013 &gt;&gt;<\/a>  <\/p>","slug":"allan_jones","published_at":"2011-05-20 14:09:00","updated_at":"2013-05-06 17:54:54"}}